[
  {
    "pageNumber": 1,
    "fileName": "1.png",
    "type": "title",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is the title page of the Hip-Hop Time Capsule book. It features the main title 'HIP-HOP TIME CAPSULE:' in large, bold pink/magenta letters at the top. Below that is the subtitle 'DOCUMENT YOUR PERSONAL JOURNEY' in blue text with spaced lettering. At the bottom, it displays 'AUTHORED BY:' followed by the two authors' names 'ANITA SCIPIO' and 'HILTON V. SCIPIO' in black text. The page uses a clean, modern design with a white background and contrasting typography.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 2,
    "fileName": "2.png",
    "type": "blank",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a blank page with only the page number '2' centered at the bottom. It appears to be an intentionally blank page, possibly serving as a separator or buffer page in the book's layout.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 3,
    "fileName": "3.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A thank you page featuring a centered message \"Your Support Is Everything!\" in purple/blue text at the top with musical note decorations on both sides. Below is \"Thank you!\" in magenta/pink text, followed by \"Anita Scipio and DJ SCIPIO\" in black text. The bottom of the page features three silhouette graphics: a breakdancer on the left, a cassette tape in the center, and a standing dancer on the right, all in purple. There's a decorative line divider between the title and thank you message. Page number 3 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 4,
    "fileName": "4.png",
    "type": "copyright",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Copyright page containing standard rights reservation language and attribution to 2024 Team Scipio. The page features centered text with a copyright symbol and splash icon decoration at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 5,
    "fileName": "5.png",
    "type": "toc",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is the Table of Contents page (page 5) of the Hip-Hop Time Capsule book. It features a bold purple title 'TABLE OF CONTENTS' at the top with an underline. The left side has two vertical magenta/pink decorative bars. The contents are listed in 16 numbered entries showing chapter titles and their corresponding page numbers, ranging from page 1 to page 214. The book includes sections on personal journeys, dedications, hip-hop quotes, trivia questions, and personal stories from DJ Scipio and Anita Scipio.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 6,
    "fileName": "6.png",
    "type": "toc",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Table of Contents page showing chapters 17-30 of the book. Features a blue underlined 'TABLE OF CONTENTS' header in uppercase. Two vertical magenta/pink bars appear on the left side as a design element. The entries list various topics including interviews with Angela Yee and The Breakfast Club, shout-outs, author information, celebrity photos, and personal messages. A footnote at the bottom explains the automatic numbering system used.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 7,
    "fileName": "7.png",
    "type": "foreword",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is the foreword page of the Hip-Hop Time Capsule book. It features a decorative title 'Foreward' at the top with purple text and pink arrow design elements with a diamond center. The page contains three paragraphs explaining the purpose and context of the book. The first paragraph describes Hip-Hop as a living cultural testament. The second paragraph introduces the book and its co-authors Anita Scipio and DJ SCIPIO (Hilton V. Scipio), highlighting DJ SCIPIO's 45+ years of experience in the Hip-Hop industry in The Carolinas. The third paragraph discusses how Hip-Hop's heartbeat lives through individuals like Anita Scipio and her nearly two decades of work at iHeartMedia connecting with Hip-Hop and Rap artists. The page number 7 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 8,
    "fileName": "8.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains a closing statement from an author about personal Hip-Hop experiences, followed by the signature 'In Solidarity, Kool Moe Dee'. Below that is a note from the authors describing the historic 1981 battle between Kool Moe Dee and Busy Bee Starski at Harlem World, which is credited as the first aggressive MC battle in Hip-Hop history. The page includes three QR codes at the bottom that link to recordings of this historic battle.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 9,
    "fileName": "9.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 573 (line 16 column 258)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 10,
    "fileName": "10.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 277 (line 8 column 149)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 11,
    "fileName": "11.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page concludes a section about hats in early Hip-Hop culture with a closing statement from Anita. It includes a fun fact about the Hip-Hop Time Capsule cover, identifying five iconic headwear items and their associated artists: The Notorious B.I.G. (crown), RUN-DMC (black fedora), Queen Latifah (yellow-gold kufi-style crown hat), LL Cool J (red Kangol), and Kool Moe Dee (black leather flat top kufi). The page number is 11.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 12,
    "fileName": "12.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 1274 (line 21 column 861)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 13,
    "fileName": "13.png",
    "type": "foreword",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 13 of the foreword or introduction section of the Hip-Hop Time Capsule book. The author discusses their motivation for creating this unique hybrid journal/book and explains their collaboration with co-author DJ SCIPIO. The text emphasizes that this is a passion project created by a fan rather than an expert, and highlights DJ SCIPIO's 45 years of music industry experience and deep knowledge of Hip-Hop history, including pioneers like DJ Hollywood, Grandmaster Flowers, Disco King Mario, and Cool Herc. The author mentions learning about Hip-Hop's roots in gang culture (particularly the Black Spades in the Bronx) and its musical influences from jazz, funk, and soul. The page concludes by stating that together they created 100 thought-provoking questions and that this journal/book is unique in the market. The page number 13 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 14,
    "fileName": "14.png",
    "type": "foreword",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a foreword or introduction page from a Hip-Hop book. The author describes the challenging process of creating the book covering 50 years of Hip-Hop history. They mention including 50 quotes from artists and 50 trivia questions. The author discusses various setbacks during production including an illegitimate editor and unreliable collaborators. They acknowledge working with their brother Hilton (DJ SCIPIO) and highlight the innovative inclusion of 235 QR codes throughout the book to link to meaningful songs. The page number 14 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 15,
    "fileName": "15.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 15 of the book, containing explanatory text about the QR code integration feature. The page discusses the innovative use of QR codes to link readers to Hip-Hop songs, the family-friendly approach, copyright considerations, and how this feature supports artists while creating an interactive reading experience. The text is presented in three main paragraphs explaining the rationale and implementation of this feature.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 16,
    "fileName": "16.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains important disclaimers about content suitability and copyright compliance for QR code linking, followed by an introduction to a new section about the Hip-Hop Time Capsule personal journey feature. The page emphasizes that most songs are not suitable for all audiences (shown in purple text) and explains the legal considerations for linking to official artist content. It then transitions to describing the evolution of the journal/book concept, mentioning it will include prompt questions, trivia, quotes, and personal experiences spanning 18 years.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 17,
    "fileName": "17.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page explains why the Hip-Hop Time Capsule book was split into two volumes. The author describes how the project grew beyond its original scope of Hip-Hop fans documenting their personal journeys. The first volume contains stories, pictures, and memories, while the second volume (The Next Chapter) will feature deeper stories about Hip-Hop legends and the iHeart family, with QR codes linking to historical moments. The author gives recognition to Thea Mitchem from iHeartMedia and Power 105.1 New York. The page number 17 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 18,
    "fileName": "18.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 1134 (line 23 column 148)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 19,
    "fileName": "19.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a 'Sneak Peek' page (page 19) that previews celebrity encounters featured in the book. At the top are two framed black and white photographs - one showing the author with Kool Moe Dee and LL Cool J, and another with 50 Cent. Below the photos is a decorative 'Sneak Peek' header with a diamond accent. The main content lists approximately 30 hip-hop artists and celebrities the author has met, arranged in rows with periods separating each name. The list includes legendary artists like Kool Moe Dee, LL Cool J, Snoop Dogg, DMX, Will Smith, Salt-N-Pepa, Mary J Blige, Ice Cube, 50 Cent, Run-DMC, and many others, ending with 'and many more.' The page serves as a teaser for the celebrity encounter stories that will appear later in the book.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 20,
    "fileName": "20.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 20 features a heartfelt story about DaBaby. The page includes two photographs at the top - one black and white photo showing someone in a hoodie, and one color photo showing DaBaby with others. The page title 'DaBaby' appears in purple text with a decorative diamond accent below it. The main text tells a touching story about a retired person who received a surprise call from DaBaby via his label rep Sherri. The story describes how DaBaby was upset when he didn't see this person at The Breakfast Club and reached out to them. The author expresses gratitude and love for DaBaby, Sherri, Garrett and the team. At the bottom is the 'stay TUNED' logo in purple stylized text. The page number 20 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 21,
    "fileName": "21.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a dedication page featuring two framed photographs at the top - one showing the author with her daughter, and another showing her with her granddaughter. The page contains a heartfelt dedication message from Anita (Mom & Grandma) to her daughter Arlene Yvette Scipio and granddaughter Gayla Renee Robinson. The text expresses deep love, gratitude, and appreciation for their support, particularly mentioning concerns about proper rest during the book's creation. The dedication is signed 'Love, Mom & Grandma' with decorative pink heart graphics on either side. The page number 21 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 22,
    "fileName": "22.png",
    "type": "dedication",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A heartfelt dedication page titled 'HILTON'S DEDICATION' featuring two framed photographs at the top - one showing a young woman in a yellow dress holding what appears to be a Broadway playbill, and another showing a young girl in a pink 'Birthday Girl' shirt. The dedication is addressed to the author's daughter Cheri Scipio-White, granddaughters Kadence L. White and Chloe N. White, and late son Hilton Fuquan Scipio (RIP). The text expresses love, dedication, and hope that the book will inspire family members to be themselves and follow their hearts while remembering their shared legacy. The page is signed 'With all my love, Dad/Papa Scipio' and includes decorative floral and dove accent images at the bottom corners. Page number 22 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 23,
    "fileName": "23.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a section divider page with vibrant purple and pink colors. The page features 'Hip-Hop Time Capsule' as the main title in bold yellow text with a black outline at the top, followed by 'Document Your Personal Journey' in white and pink text. The center of the page displays the word 'QUESTIONS' in large yellow letters with a gradient effect, set against a bright pink starburst or splash shape with torn/ripped edges. The background is purple with a distressed, grunge texture. The page number 23 appears at the bottom. This page serves as a section header introducing the questions portion of the time capsule activity book.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 24,
    "fileName": "24.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "name_field",
        "type": "text",
        "label": "MY NAME IS:",
        "position": {
          "top": "46%",
          "left": "10%"
        },
        "width": "80%",
        "height": 50,
        "multiline": false,
        "numberOfLines": 1,
        "placeholder": "Tap to write your name..."
      },
      {
        "id": "hometown_field",
        "type": "text",
        "label": "I WAS BORN AND RAISED IN:",
        "position": {
          "top": "60%",
          "left": "10%"
        },
        "width": "80%",
        "height": 50,
        "multiline": false,
        "numberOfLines": 1,
        "placeholder": "Tap to write your hometown..."
      },
      {
        "id": "dob_field",
        "type": "text",
        "label": "MY D.O.B IS:",
        "position": {
          "top": "74%",
          "left": "10%"
        },
        "width": "80%",
        "height": 50,
        "multiline": false,
        "numberOfLines": 1,
        "placeholder": "Tap to write your date of birth..."
      }
    ],
    "description": "Personal introduction page with hip-hop cultural elements listed at the top. Contains three fill-in fields for name, hometown, and date of birth, followed by a statement about loving hip-hop. Decorated with a pink paint splatter in the top right and a purple microphone icon in the bottom left. The page uses bold, graffiti-style purple and blue outlined text throughout.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 25,
    "fileName": "25.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question1_answer",
        "type": "multiline",
        "label": "When did you first discover Hip-Hop music?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to share your story..."
      },
      {
        "id": "question2_answer",
        "type": "multiline",
        "label": "Do you remember where you were?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 220,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to share your story..."
      }
    ],
    "description": "Page 25 of the Hip-Hop Time Capsule book features two reflective questions about the reader's first experience discovering Hip-Hop music. The first question asks when they first discovered the genre, followed by a second question about where they were at the time. The page includes seven blank lines for the first answer and eight blank lines for the second answer. A purple crown icon appears in the top right corner, and a pink breakdancer silhouette is positioned in the bottom left corner. The page number 25 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 26,
    "fileName": "26.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question3_answer",
        "type": "multiline",
        "label": "3. What was the first song that caught your attention?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question4_answer",
        "type": "multiline",
        "label": "4. What were the emotions you felt hearing Hip-Hop for the first time?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Input page with two reflection questions about first experiences with Hip-Hop music. Question 3 asks about the first song that caught attention, and Question 4 asks about the emotions felt when hearing Hip-Hop for the first time. Each question has multiple blank lines (8 lines each) for written responses. Decorated with a pink/magenta ink splatter graphic in the top right corner and a purple chain with dollar sign pendant illustration in the bottom left. Page number 26 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 27,
    "fileName": "27.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question5_answer",
        "type": "multiline",
        "label": "Who are (or were) your hottest (or as we used to say \"illest\") MCs?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 9,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question6_answer",
        "type": "multiline",
        "label": "Did Hip-Hop inspire you to become, or want to become, a lyricist, rapper, dancer, or DJ? If so, was there anyone in particular who inspired you?",
        "position": {
          "top": "62%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 27 features two reflection questions about favorite MCs and personal inspiration from hip-hop culture. Question 5 asks about the user's favorite or 'illest' MCs, with 9 blank lines for responses. Question 6 explores whether hip-hop inspired the user to pursue various hip-hop disciplines (lyricist, rapper, dancer, DJ) and asks for specific inspirational figures, with 8 blank lines provided. The page is decorated with a musical notes icon in the top right and a 'Hip Hop' graffiti-style graphic in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 28,
    "fileName": "28.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question7_answer",
        "type": "multiline",
        "label": "Did Hip-Hop play a role in your friendship or social circles?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question8_answer",
        "type": "multiline",
        "label": "What were the top three or more songs that gave you the confidence to overcome a personal challenge in your life?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Input page 28 featuring two reflective questions about hip-hop's social impact and empowering songs. Question 7 asks about hip-hop's role in friendships and social circles with 7 blank lines for response. Question 8 asks about songs that provided confidence during personal challenges with 8 blank lines. Page includes purple ink splatter decoration in top right and pink speaker/boombox icon in bottom left.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 29,
    "fileName": "29.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question9_answer",
        "type": "multiline",
        "label": "What are (or were) your top five hottest jams or concerts? Where did you attend them?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question10_answer",
        "type": "multiline",
        "label": "Who are (or were) the top DJs who made the biggest impact on Hip-Hop?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 29 contains two open-ended questions about Hip-Hop experiences. Question 9 asks about favorite concerts/jams and their locations, with 7 blank lines for responses. Question 10 asks about influential Hip-Hop DJs, with 8 blank lines for answers. The page includes musical note decorations in the top right corner and a purple microphone illustration in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 30,
    "fileName": "30.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question11_answer",
        "type": "multiline",
        "label": "Who, from your crew, are (or were) your favorite people to party with?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 200,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question12_answer",
        "type": "multiline",
        "label": "What were your top three old-school dances back in the day, and what are they today?",
        "position": {
          "top": "55%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Input page 30 featuring two questions about hip-hop culture and personal experiences. Question 11 asks about favorite people to party with from the user's crew. Question 12 asks about top three old-school dances from the past and what they are today. The page includes a purple ink splatter decoration in the upper right and pink headphones icon in the lower left. Seven blank lines are provided for the first answer and eight for the second answer.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 31,
    "fileName": "31.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Unexpected end of JSON input",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 32,
    "fileName": "32.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question15_answer",
        "type": "multiline",
        "label": "15. What was the first song that you could fully recite?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question16_answer",
        "type": "multiline",
        "label": "16. In your day, who were the hottest or (as we used to say \"illest\") top five male artists or groups?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 320,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 32 of a Hip-Hop Time Capsule questionnaire featuring two questions. Question 15 asks about the first song the respondent could fully recite, with 7 blank lines for the answer. Question 16 asks for top five male artists or groups from their era, with 8 blank lines provided. The page is decorated with purple musical notes in the top right corner and a pink breakdancer silhouette in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 33,
    "fileName": "33.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question17_answer",
        "type": "multiline",
        "label": "17. What is the one concert or event that you regret missing?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question18_answer",
        "type": "multiline",
        "label": "18. What are some old-school lines or quotes that you still recite today?",
        "position": {
          "top": "60%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 33 of a Hip-Hop Time Capsule journal featuring two reflection questions. Question 17 asks about a missed concert or event with regret, providing 7 blank lines for response. Question 18 asks about memorable old-school hip-hop lines or quotes that are still recited today, with 8 blank lines for answers. The page is decorated with a purple crown icon in the upper right and a pink boombox illustration in the lower left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 34,
    "fileName": "34.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question19_answer",
        "type": "multiline",
        "label": "19. What were (or are) your favorite songs to be played at a club?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question20_answer",
        "type": "multiline",
        "label": "20. What were your top five favorite Break Dance tracks for B-Boys?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 320,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 34 of the Hip-Hop Time Capsule features two music-related questions. Question 19 asks about favorite club songs with 7 blank lines for responses. Question 20 asks for top five favorite Break Dance tracks for B-Boys with 8 blank lines. The page is decorated with a magenta/pink paint splatter in the upper right corner and a purple cassette tape icon in the lower left corner. Page number 34 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 35,
    "fileName": "35.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question21_answer",
        "type": "multiline",
        "label": "Did you own any DJ equipment, and if so, what kind?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question22_answer",
        "type": "multiline",
        "label": "Have you ever been at a club or jam where shots were fired or some type of violence took place?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 35 of the Hip-Hop Time Capsule features two questions about DJ equipment ownership and experiences with violence at clubs or jams. Question 21 asks about DJ equipment ownership and types. Question 22 asks about experiences with gun violence or other violence at clubs or jams. Each question has 7-8 blank lines for detailed responses. The page is decorated with a pink/magenta female hip-hop dancer silhouette in the upper right and a blue b-boy breakdancer silhouette in the lower left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 36,
    "fileName": "36.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question23_answer",
        "type": "multiline",
        "label": "Have you ever been affected by the loss of an artist that you were a big fan of?",
        "position": {
          "top": "28%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question24_answer",
        "type": "multiline",
        "label": "If so, how were you specifically affected?",
        "position": {
          "top": "62%",
          "left": "10%"
        },
        "width": "80%",
        "height": 200,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Input page 36 from Hip-Hop Time Capsule featuring two reflective questions about experiencing the loss of a favorite artist. Question 23 asks if the user has been affected by an artist's death, with 7 blank lines for response. Question 24 is a follow-up asking for specific details about how they were affected, with 8 blank lines. The page is decorated with a magenta/purple paint splatter in the top right and a purple speaker icon in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 37,
    "fileName": "37.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question25_answer",
        "type": "multiline",
        "label": "Have you ever had the opportunity to do something kind or important for your favorite artist?",
        "position": {
          "top": "28%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question26_answer",
        "type": "multiline",
        "label": "If the lyrics in one of your favorite songs could come true for a day, which lyrics would you choose?",
        "position": {
          "top": "62%",
          "left": "10%"
        },
        "width": "80%",
        "height": 220,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 37 contains two reflective questions about hip-hop fandom. Question 25 asks about opportunities to do something kind or important for a favorite artist, with 7 blank lines for response. Question 26 asks which song lyrics the reader would want to come true for a day, with 8 blank lines for response. The page is decorated with pink/magenta headphones in the upper right corner and a purple boombox illustration in the lower left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 38,
    "fileName": "38.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question27",
        "type": "multiline",
        "label": "27. What Hip-Hop song do you hear and instantly remember exactly where you were and what you were doing?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question28",
        "type": "multiline",
        "label": "28. Were there any Hip-Hop artists you had a crush on back in your day? If so, who? How about today?",
        "position": {
          "top": "60%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 38 of the Hip-Hop Time Capsule book features two nostalgic questions. Question 27 asks about Hip-Hop songs that trigger specific memories of location and activities. Question 28 explores celebrity crushes on Hip-Hop artists from the past and compares them to current preferences. The page includes musical note graphics in the top right corner and a pink 'HIP HOP' graffiti-style graphic in the bottom left corner. Eight blank lines are provided under each question for detailed written responses.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 39,
    "fileName": "39.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question29",
        "type": "multiline",
        "label": "29. Who are some of your favorite New York mixtape DJs?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question30",
        "type": "multiline",
        "label": "30. Who were your favorite B-Boys, and why?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 39 of a hip-hop themed journal/time capsule book. Contains two open-ended questions with multiple blank lines for written responses. Question 29 asks about favorite New York mixtape DJs with 7 lines for answers. Question 30 asks about favorite B-Boys and reasons why, with 8 lines for answers. The page is decorated with a pink/magenta microphone icon in the upper right and purple musical notes in the lower left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 40,
    "fileName": "40.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question31",
        "type": "multiline",
        "label": "31. What record pool, if any, did you belong to?",
        "position": {
          "top": "22%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question32",
        "type": "multiline",
        "label": "32. When you were on your way to a club; looking clean (or as we used to say) looking fresh, what were your favorite colognes, perfumes, or body oils to wear?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 320,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 40 of the Hip-Hop Time Capsule featuring two questions about DJ culture and personal style. Question 31 asks about record pool membership (record pools were DJ services that provided promotional vinyl records). Question 32 asks about favorite fragrances worn when going to clubs, using the period slang 'looking fresh'. The page includes 7 blank lines for the first answer and 8 blank lines for the second answer. Decorative elements include a magenta paint splatter/ink blot in the top right corner and a purple breakdancer silhouette in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 41,
    "fileName": "41.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question33",
        "type": "multiline",
        "label": "Fashion is an integral part of Hip-Hop. Back in your day, what was your favorite Hip-Hop drip (or as we used to say) gear? And now?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question34",
        "type": "multiline",
        "label": "What was your sneaker and shoe game like? And now?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 220,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 41 contains two questions about Hip-Hop fashion and style. Question 33 asks about favorite Hip-Hop clothing/gear from back in the day versus now, using modern slang 'drip' alongside older terminology. Question 34 focuses specifically on sneaker and shoe preferences then and now. The page features a purple ink splatter decoration in the top right corner and a pink cassette tape icon at the bottom left. Seven blank lines are provided for answering question 33, and eight blank lines for question 34.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 42,
    "fileName": "42.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question35_answer",
        "type": "multiline",
        "label": "What were your favorite drinks to get your party started? And now?",
        "position": {
          "top": "22%",
          "left": "10%"
        },
        "width": "80%",
        "height": 320,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question36_answer",
        "type": "multiline",
        "label": "What three or more artists or groups have influenced your view of social issues and activism?",
        "position": {
          "top": "62%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 42 contains two reflection questions. Question 35 asks about favorite party drinks from the past versus present. Question 36 asks about three or more artists/groups that influenced views on social issues and activism. The page includes seven blank lines for each answer. Decorative elements include purple music notes in the upper right and a pink/purple hip-hop style graffiti graphic in the lower left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 43,
    "fileName": "43.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question37",
        "type": "multiline",
        "label": "Are there any particular artists or groups whose life stories have inspired you?",
        "position": {
          "top": "22%",
          "left": "10%"
        },
        "width": "80%",
        "height": 220,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question38",
        "type": "multiline",
        "label": "Has Hip-Hop contributed to your personal growth, and if so, which song or artist do you credit with your development?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 43 features two reflective questions about inspiration and personal growth through Hip-Hop. Question 37 asks about artists or groups whose life stories have been inspirational. Question 38 explores how Hip-Hop has contributed to personal development and which specific songs or artists were influential. The page includes 7 blank lines for each response. A pink crown icon decorates the top right corner, and a purple paint drip/splash graphic appears at the bottom left.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 44,
    "fileName": "44.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question39",
        "type": "multiline",
        "label": "When was the first time (if ever) that you tried to write your own rap?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 6,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question40",
        "type": "multiline",
        "label": "Who or what inspired you to try, and how would you rate your skills?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 44 of the Hip-Hop Time Capsule journal features two personal reflection questions about writing rap. Question 39 asks about the first time the user tried writing their own rap, with 6 blank lines for response. Question 40 asks who or what inspired them to try and how they would rate their skills, with 7 blank lines for response. The page is decorated with a purple ink splatter graphic in the top right corner and a purple microphone icon in the bottom left corner. The page number 44 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 45,
    "fileName": "45.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question41",
        "type": "multiline",
        "label": "Have you ever met or worked with any of your favorite artists or legends in Hip-Hop?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question42",
        "type": "multiline",
        "label": "Who was the better lyricist: Biggie or Tupac?",
        "position": {
          "top": "62%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 45 contains two hip-hop related questions. Question 41 asks about personal experiences meeting or working with favorite hip-hop artists or legends, with 7 blank lines for response. Question 42 poses the classic debate question about whether Biggie or Tupac was the better lyricist, with 8 blank lines for answer. The page is decorated with a pink paint splatter/ink blot graphic in the upper right corner and a purple breakdancer silhouette in the lower left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 46,
    "fileName": "46.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question43_answer",
        "type": "multiline",
        "label": "43. What were your thoughts on the infamous East Coast vs. West Coast war? Did you choose a side?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question44_answer",
        "type": "multiline",
        "label": "44. If you could have fifteen minutes with your favorite Hip-Hop legend or artist, who would it be and what would you say?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 46 of the Hip-Hop Time Capsule book featuring two reflective questions. Question 43 asks about the East Coast vs. West Coast rivalry and whether the reader chose a side. Question 44 asks which Hip-Hop legend the reader would want to spend fifteen minutes with and what they would say. The page includes 7 blank lines for the first answer and 8 blank lines for the second answer. Decorative elements include a blue/purple ink splatter in the top right corner and a pink breakdancer silhouette in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 47,
    "fileName": "47.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question45",
        "type": "multiline",
        "label": "If you could spend the whole day with your favorite Hip-Hop legend or artist, who would it be and what plans would you make?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 6,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question46",
        "type": "multiline",
        "label": "If you could have a rap battle with any of your favorite artists, who would you choose?",
        "position": {
          "top": "60%",
          "left": "10%"
        },
        "width": "80%",
        "height": 320,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 47 of a Hip-Hop themed journal featuring two imaginative questions. Question 45 asks about spending a day with a favorite Hip-Hop legend and what activities they would do together, with 6 lines for response. Question 46 asks about choosing an artist for a rap battle, with 8 lines provided. The page is decorated with a purple headphones icon in the top right and a pink 'HIP HOP' graffiti-style graphic in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 48,
    "fileName": "48.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question47",
        "type": "multiline",
        "label": "47. What clever lines would you use to diss them?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question48",
        "type": "multiline",
        "label": "48. Can you recall a funny or embarrassing story from back in your day that you still laugh about?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 48 of the Hip-Hop Time Capsule book contains two open-ended questions. Question 47 asks about clever diss lines with 8 blank lines for responses. Question 48 asks the reader to recall a funny or embarrassing story they still laugh about, also with 8 blank lines for writing. The page is decorated with a pink/magenta paint splatter graphic in the top right corner and a purple breakdancer silhouette in the bottom left corner. The page number 48 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 49,
    "fileName": "49.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question49",
        "type": "multiline",
        "label": "If you could challenge any artist to a dance off, who would it be?",
        "position": {
          "top": "22%",
          "left": "10%"
        },
        "width": "80%",
        "height": 240,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question50",
        "type": "multiline",
        "label": "What is the nicest thing a Hip-Hop legend or artist has ever done for you?",
        "position": {
          "top": "54%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 49 of a Hip-Hop Time Capsule journal featuring two creative prompts. Question 49 asks about challenging an artist to a dance-off, accompanied by pink/magenta musical notes decoration in the top right. Question 50 asks about the nicest thing a Hip-Hop legend has done for the user. The page includes a purple microphone illustration at the bottom left. Seven blank lines are provided for the first question and eight for the second question.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 50,
    "fileName": "50.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question51",
        "type": "multiline",
        "label": "What, if any, is the best advice that a Hip-Hop legend or artist has ever given you?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question52",
        "type": "multiline",
        "label": "Do you have any humorous stories that you heard about or personally know about your favorite artists?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 50 of the Hip-Hop Time Capsule featuring two reflective questions. Question 51 asks about the best advice received from a Hip-Hop legend or artist, with seven blank lines for response. Question 52 asks about humorous stories the reader knows about their favorite artists, with eight blank lines for response. The page is decorated with a purple ink blot/paint splatter in the top right and a pink crown icon in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 51,
    "fileName": "51.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question52_continuation",
        "type": "multiline",
        "label": "52. Continued...",
        "position": {
          "top": "15%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to continue your answer..."
      },
      {
        "id": "question53",
        "type": "multiline",
        "label": "53. In the early years, women in Hip-Hop played a crucial and invaluable role in shaping the genre. What do you believe is the most significant contribution they made? Additionally, who are your favorites?",
        "position": {
          "top": "52%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "This is page 51 of the Hip-Hop Time Capsule, featuring a continuation section for question 52 and a new question 53 about the role and contributions of women in early Hip-Hop. The page includes two input areas with multiple lines for written responses. Decorative elements include a pink/magenta paint splatter in the top right and a purple breakdancer silhouette in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 52,
    "fileName": "52.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question54",
        "type": "multiline",
        "label": "54. After the eighties, who were your top five (or more) women artists or groups? Who are they now?",
        "position": {
          "top": "22%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 6,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question55",
        "type": "multiline",
        "label": "55. Who do you consider the top five (or more) \"baddest\" women artists in Hip-Hop and R&B?",
        "position": {
          "top": "60%",
          "left": "10%"
        },
        "width": "80%",
        "height": 320,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 52 features two questions about women in Hip-Hop and R&B. Question 54 asks about favorite women artists after the eighties and who they are now, with 6 blank lines for answers. Question 55 asks who are considered the top 'baddest' women artists in Hip-Hop and R&B, with 8 blank lines provided. A purple ink splatter decoration appears in the top right corner, and a pink spray paint can graphic is in the bottom left.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 53,
    "fileName": "53.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question56_answer",
        "type": "multiline",
        "label": "Who are your favorite male Hip-Hop and R&B artists today?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 200,
        "multiline": true,
        "numberOfLines": 6,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question57_answer",
        "type": "multiline",
        "label": "Did you choose a career in Rap or Hip-Hop? If so, how are you contributing to the genre? If not, what are you doing today instead?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 240,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 53 contains two reflective questions about Hip-Hop and R&B preferences and career choices. Question 56 asks about favorite male artists in Hip-Hop and R&B today, with 6 blank lines for responses. Question 57 is a more complex query asking whether the person pursued a career in Rap or Hip-Hop, how they're contributing to the genre if yes, or what they're doing instead if not, with 8 blank lines provided. The page features a purple paint splatter accent in the upper right corner and a purple breakdancer silhouette in the lower left corner. The page number 53 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 54,
    "fileName": "54.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question58",
        "type": "multiline",
        "label": "If you chose a career in Rap or Hip-Hop, what were some of the challenges you faced?",
        "position": {
          "top": "22%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question59",
        "type": "multiline",
        "label": "Were there any particular family members or friends who encouraged and believed in you during those challenges?",
        "position": {
          "top": "54%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 54 of Hip-Hop Time Capsule containing two reflection questions. Question 58 asks about career challenges in Rap or Hip-Hop with 7 blank lines for response. Question 59 asks about supportive family members or friends during those challenges with 8 blank lines for response. Page is decorated with pink/magenta music notes in the upper right corner and a purple microphone icon in the lower left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 55,
    "fileName": "55.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question60",
        "type": "multiline",
        "label": "60. How did you overcome those challenges?",
        "position": {
          "top": "22%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question61",
        "type": "multiline",
        "label": "61. Who are your favorite Hip-Hop producers?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Input page 55 featuring two reflection questions about overcoming challenges and favorite Hip-Hop producers. The page has a clean layout with bold question text and multiple blank lines for detailed responses. Decorated with a pink ink splatter in the top right corner and a pink Hip-Hop graffiti-style logo in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 56,
    "fileName": "56.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question62",
        "type": "multiline",
        "label": "Has Hip-Hop influenced your view on diversity and inclusion? If so, how?",
        "position": {
          "top": "22%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question63",
        "type": "multiline",
        "label": "Have there been any songs or specific artists that aided you in finding your voice and shaping your identity? If so, which ones?",
        "position": {
          "top": "57%",
          "left": "10%"
        },
        "width": "80%",
        "height": 320,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 56 contains two reflective questions about hip-hop's influence on personal perspectives. Question 62 asks about diversity and inclusion views influenced by hip-hop. Question 63 asks about specific songs or artists that helped shape the reader's voice and identity. The page features pink musical notes decoration in the top right and a purple cassette tape icon at the bottom left. Seven blank lines are provided for answering each question.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 57,
    "fileName": "57.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question64_answer",
        "type": "multiline",
        "label": "64. How do you feel about the storytelling aspect of Hip-Hop? Have you ever written your own stories?",
        "position": {
          "top": "23%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 6,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question65_answer",
        "type": "multiline",
        "label": "65. Do you remember a time when Hip-Hop brought the people in your community together?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 240,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 57 of the Hip-Hop Time Capsule features two reflective questions. Question 64 asks about the storytelling aspect of Hip-Hop and personal story writing. Question 65 asks readers to recall a time when Hip-Hop brought their community together. The page includes 6 blank lines for the first answer and 8 blank lines for the second answer. Decorative elements include a pink/magenta ink splatter in the upper right corner and a purple hip-hop chain graphic in the lower left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 58,
    "fileName": "58.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question66",
        "type": "multiline",
        "label": "Did Hip-Hop make you more active in your community? If so, what changes did you make and how did you improve things for the better?",
        "position": {
          "top": "32%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question67",
        "type": "multiline",
        "label": "What do (or did) you like the most about your generation of Hip-Hop?",
        "position": {
          "top": "62%",
          "left": "10%"
        },
        "width": "80%",
        "height": 240,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 58 features two reflective questions about Hip-Hop's community impact and generational appreciation. Question 66 asks about community activism inspired by Hip-Hop culture. Question 67 asks about favorite aspects of the respondent's Hip-Hop generation. The page includes musical notes icon in the top right and a Hip-Hop chain graphic in the bottom left. Seven blank lines are provided for the first question and eight for the second.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 59,
    "fileName": "59.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question68",
        "type": "multiline",
        "label": "68. What is your go-to favorite Hip-Hop karaoke song?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question69",
        "type": "multiline",
        "label": "69. Has Hip-Hop lead you to explore other genres of music? If so, which ones?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 240,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 59 of the Hip-Hop Time Capsule book containing two open-ended questions about hip-hop music. Question 68 asks about favorite hip-hop karaoke songs, with seven blank lines for responses. Question 69 asks whether hip-hop has led to exploring other music genres, with eight blank lines provided. The page features decorative elements including a purple paint splatter/ink blot in the top right corner and a pink/magenta crown icon in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 60,
    "fileName": "60.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question70",
        "type": "multiline",
        "label": "70. What Dirty South artists, if any, do you feel contributed to Hip-Hop music?",
        "position": {
          "top": "28%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 9,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question71",
        "type": "multiline",
        "label": "71. Who are (or were) your favorite West Coast artists?",
        "position": {
          "top": "65%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Input page 60 featuring two open-ended questions about regional Hip-Hop contributions. Question 70 asks about Dirty South artists' contributions to Hip-Hop, with 9 blank lines for responses. Question 71 asks about favorite West Coast artists, with 8 blank lines. Page includes a magenta headphone icon in the top right and a purple paint drip graphic at the bottom left. Page number 60 appears at bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 61,
    "fileName": "61.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question72",
        "type": "multiline",
        "label": "72. Do you believe that Hip-Hop has promoted positive change in the world? If so, how?",
        "position": {
          "top": "20%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 6,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question73",
        "type": "multiline",
        "label": "73. As classic Hip-Hop has evolved, what artists or groups do you feel have positively impacted the music? How?",
        "position": {
          "top": "52%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 61 of Hip-Hop Time Capsule featuring two reflective questions about hip-hop's positive impact on the world and influential artists in the genre's evolution. The page includes purple musical notes icon in the top right corner and a pink/magenta cassette tape icon at the bottom left. Each question has multiple blank lines for detailed written responses.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 62,
    "fileName": "62.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question74_answer",
        "type": "multiline",
        "label": "What artist or group, if any, do you believe is over-hyped or has negatively impacted the music? If so, who and how?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question75_answer",
        "type": "multiline",
        "label": "Back in your day, when you were frustrated or facing hardships what Hip-Hop songs matched your energy? How about today?",
        "position": {
          "top": "55%",
          "left": "10%"
        },
        "width": "80%",
        "height": 140,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 62 contains two reflection questions. Question 74 asks about over-hyped artists or those who negatively impacted hip-hop music. Question 75 is a two-part question asking about hip-hop songs that matched the respondent's energy during frustrating or difficult times in the past, and which songs do so today. The page features a pink paint splatter accent image in the top right corner and a purple microphone illustration in the bottom left corner. Seven blank lines are provided for answering question 74, and eight blank lines for question 75.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 63,
    "fileName": "63.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question76_answer",
        "type": "multiline",
        "label": "In your borough or state, which artists or DJs are you most proud of for their contribution to Rap or Hip-Hop?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question77_answer",
        "type": "multiline",
        "label": "Who are your favorite beatbox artists? Please name one or more.",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 240,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 63 contains two questions about Hip-Hop culture. Question 76 asks about local artists or DJs from the respondent's borough or state who have contributed to Rap or Hip-Hop. Question 77 asks about favorite beatbox artists. The page has 7 blank lines for the first question and 8 blank lines for the second question. Decorative elements include a purple paint splatter in the top right corner and a pink chain/hip-hop jewelry graphic in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 64,
    "fileName": "64.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question78_answer",
        "type": "multiline",
        "label": "78. Regarding sampling, which artist of your generation was sampled the most?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 200,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question79_answer",
        "type": "multiline",
        "label": "79. What rapper, if any, influenced you to become, or want to become, a rapper? How?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 200,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 64 contains two open-ended questions about hip-hop music production and influences. Question 78 asks about the most sampled artist of the respondent's generation. Question 79 asks about rapper influences on the respondent's career aspirations. The page includes musical note decorations in the upper right and a crown icon in the lower left. Seven blank lines follow each question for written responses.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 65,
    "fileName": "65.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question80",
        "type": "multiline",
        "label": "80. Like Mt. Rushmore, if there were a Mt. EASTmore of Hip-Hop, who would you choose?",
        "position": {
          "top": "22%",
          "left": "10%"
        },
        "width": "80%",
        "height": 200,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question81",
        "type": "multiline",
        "label": "81. Who would you choose for Mt. WESTmore of Hip-Hop?",
        "position": {
          "top": "55%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 9,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 65 presents two creative Hip-Hop questions about selecting legendary artists for hypothetical Mt. Rushmore monuments. Question 80 asks who would be chosen for a Mt. EASTmore (East Coast Hip-Hop legends), while question 81 asks for Mt. WESTmore selections (West Coast Hip-Hop legends). The page includes 7 blank lines for the first answer and 9 blank lines for the second answer. Decorative elements include a blue/purple ink splatter in the top right corner and a pink/magenta 'HIP HOP' graffiti-style graphic at the bottom left.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 66,
    "fileName": "66.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question82",
        "type": "multiline",
        "label": "Who would you choose for a Mt. LADIES-ONLYmore of Hip-Hop?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question83",
        "type": "multiline",
        "label": "In your generation, which local DJs made the biggest impact on Hip-Hop?",
        "position": {
          "top": "60%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 66 features two Hip-Hop history questions with multiple blank lines for answers. Question 82 asks about creating a Mount Rushmore of female Hip-Hop artists (Mt. LADIES-ONLYmore). Question 83 inquires about influential local DJs from the respondent's generation. The page is decorated with pink musical notes in the top right corner and a purple breakdancer silhouette in the bottom left corner.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 67,
    "fileName": "67.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question84",
        "type": "multiline",
        "label": "84. As a DJ, what were/are your favorite songs to play at a club?",
        "position": {
          "top": "22%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question85",
        "type": "multiline",
        "label": "85. Ha-haaa!!! We threw in a trivia question here... What was the first official Hip-Hop love song? (Hint: It came out in the late eighties.) Who was the artist?",
        "position": {
          "top": "65%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 3,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 67 features two questions. Question 84 asks about favorite DJ club songs with 7 blank lines for answers. Question 85 is a trivia question about the first official Hip-Hop love song from the late eighties, presented with a playful tone and reference to DJ SCIPIO. The page is decorated with a magenta paint splatter in the top right and purple drips in the bottom left, plus a thinking person icon at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 68,
    "fileName": "68.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question86_answer",
        "type": "multiline",
        "label": "86. What are your favorite Hip-Hop love songs today?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question87_answer",
        "type": "multiline",
        "label": "87. Who are your favorite women artists in Hip-Hop today?",
        "position": {
          "top": "60%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 68 features two journal-style questions about Hip-Hop music. Question 86 asks about favorite Hip-Hop love songs today with 7 blank lines for responses. Question 87 asks about favorite women artists in Hip-Hop today with 8 blank lines for responses. The page is decorated with a magenta paint splatter graphic in the upper right corner and a purple breakdancer silhouette in the lower left corner. The questions are formatted in italic bold text.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 69,
    "fileName": "69.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "playlist_answer",
        "type": "multiline",
        "label": "What's on your playlist today?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to write your answer..."
      },
      {
        "id": "graffiti_artist_answer",
        "type": "multiline",
        "label": "Who was your favorite graffiti artist? Do you have a favorite today?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to write your answer..."
      }
    ],
    "description": "This is an input page featuring two questions. Question 88 asks about the user's current playlist, with seven blank lines for response. Question 89 asks about favorite graffiti artists, both past and present, also with seven blank lines for response. The page is decorated with a purple headphones icon in the top right corner and a pink microphone icon in the bottom left. The page number 69 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 70,
    "fileName": "70.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question90_answer",
        "type": "multiline",
        "label": "90. In your opinion, what ignited the legendary beef between Drake and Kendrick Lamar?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 6,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question91_answer",
        "type": "multiline",
        "label": "91. How did it impact your perception of them?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 70 of the Hip-Hop Time Capsule book features two reflection questions about the Drake and Kendrick Lamar beef. Question 90 asks about what ignited their legendary feud, with 6 blank lines for response. Question 91 asks how the beef impacted the reader's perception of the two artists, with 7 blank lines for response. A magenta crown icon appears in the top right corner, and a purple breakdancer silhouette is positioned in the bottom left corner. The page number 70 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 71,
    "fileName": "71.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question92_answer",
        "type": "multiline",
        "label": "What specific lyrics from their diss tracks stood out the most to you?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 6,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question93_answer",
        "type": "multiline",
        "label": "Who have you determined the winner, and which song led you to that conclusion?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 71 contains two open-ended questions about diss tracks in hip-hop. Question 92 asks about specific memorable lyrics from diss tracks, with 6 blank lines for response. Question 93 asks the reader to determine a winner in what appears to be a rap battle or beef, and explain which song led to their conclusion, with 7 blank lines for response. The page is decorated with a magenta/pink paint splatter graphic in the top right corner and purple headphones icon at the bottom left.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 72,
    "fileName": "72.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question94",
        "type": "multiline",
        "label": "Did the opinion of those in your inner-circle match yours, or were there drastic differences?",
        "position": {
          "top": "20%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question95",
        "type": "multiline",
        "label": "Do rivalries benefit or negatively impact Hip-Hop and the overall culture?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Input page 72 with two reflection questions about hip-hop culture. Question 94 asks about whether the respondent's inner circle agreed or disagreed with their opinion on a previous topic. Question 95 explores the role of rivalries in hip-hop culture, asking whether they are beneficial or harmful. The page has decorative elements including a pink paint splatter in the top right and a purple graffiti-style splash icon in the bottom left. Seven blank lines are provided for each answer.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 73,
    "fileName": "73.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question96_answer",
        "type": "multiline",
        "label": "What would you say are some of the most iconic beefs in Hip-Hop?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 6,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question97_answer",
        "type": "multiline",
        "label": "Considering this year as the year of enlightenment, what breaking news about an artist you admired changed your perception of them?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 280,
        "multiline": true,
        "numberOfLines": 7,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 73 features two reflection questions about Hip-Hop culture. Question 96 asks about iconic beefs/rivalries in Hip-Hop history, with 6 blank lines for responses. Question 97 prompts reflection on how breaking news about an admired artist changed the reader's perception of them, with 7 blank lines. The page is decorated with a pink/magenta headphones icon near question 96 and a purple microphone illustration at the bottom left.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 74,
    "fileName": "74.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question98_answer",
        "type": "multiline",
        "label": "Presently, which artists represent the best of both old-school and new-school Hip-Hop?",
        "position": {
          "top": "28%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question99_answer",
        "type": "multiline",
        "label": "As a Hip-Hop fan - whether it's buying CDs, attending concerts, and/or interacting with the community - how does your role contribute to the culture?",
        "position": {
          "top": "62%",
          "left": "10%"
        },
        "width": "80%",
        "height": 140,
        "multiline": true,
        "numberOfLines": 6,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 74 contains two Hip-Hop related questions. Question 98 asks about current artists who represent both old-school and new-school Hip-Hop. Question 99 explores the respondent's personal contribution to Hip-Hop culture through various forms of engagement. The page features a b-boy silhouette in the top right corner and a chain/jewelry graphic in the bottom left corner. Multiple blank lines are provided under each question for detailed responses.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 75,
    "fileName": "75.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question100_answer",
        "type": "multiline",
        "label": "100. And finally, when did you realize that you ARE Hip-Hop?",
        "position": {
          "top": "25%",
          "left": "5%"
        },
        "width": "90%",
        "height": 600,
        "multiline": true,
        "numberOfLines": 12,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Final question page (question 100) asking when the reader realized they ARE Hip-Hop, emphasizing personal identity and connection to the culture. Features purple musical notes in the top right corner and pink 'Hip Hop' graffiti text in the bottom left. Contains 12 blank lines for a detailed written response. This is the concluding question of the book.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 76,
    "fileName": "76.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A bonus page featuring 8 inspirational hip hop quotes from various artists including Remy Ma, Young M.A., Queen Latifah, Missy Elliott, N.O.R.E., Lil Wayne, Kool Moe Dee, and Jay-Z. The page has a decorative pink 'BONUS' badge at the top left, followed by the title '50 Hip Hop Quotes' in large purple text. Each quote is numbered and formatted with the quote text followed by the artist's name in bold. The quotes cover themes of self-belief, confidence, learning from mistakes, self-control, hip-hop culture, gratitude, upliftment, and business mindset. Page number 76 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 77,
    "fileName": "77.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains a collection of 12 inspirational and reflective hip-hop quotes (numbered 9-20) from various prominent artists including Nas, Big Sean, Tupac Shakur, Rakim, Nicki Minaj, Drake, Common, Snoop Dogg, Kendrick Lamar, Pop Smoke, Post Malone, and Ice Cube. The quotes cover themes of perseverance, self-belief, dreams, authenticity, teaching, self-love, legacy, identity, and the essence of rap music. Each quote is formatted with the quote text in regular font followed by the artist name in bold. The page is numbered 77 at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 78,
    "fileName": "78.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 78 of a Hip-Hop Time Capsule book displaying 10 inspirational and memorable quotes from hip-hop artists (numbers 21-30). Features quotes from J. Cole, Eminem, LL Cool J, DMX, Cardi B, Kanye West, Big Pun, KRS-One, Run-D.M.C., and Chuck D. Each quote is numbered and attributed to its artist. The quotes cover themes of resilience, life philosophy, love, self-confidence, success, and the culture of hip-hop.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 79,
    "fileName": "79.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page displays 10 inspirational quotes (numbered 31-40) from various hip-hop artists including Fat Joe, Mac Miller, Kodak Black, Chance the Rapper, Vanilla Ice, Doug E. Fresh, Nipsey Hussle, Grandmaster Kaz, The Notorious B.I.G., and Polo G. The quotes cover themes of risk-taking, living life to the fullest, peace of mind, self-protection, authenticity, truth-seeking, belief in the power of words, pursuing dreams with heart, and transforming struggle into strength. The page number 79 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 80,
    "fileName": "80.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 80 of the Hip-Hop Time Capsule book containing inspirational quotes numbered 41-50 from various hip-hop artists including Lauryn Hill, Lil Baby, Megan Thee Stallion, 50 Cent, Method Man, Macklemore, Ed Lover, A$AP Rocky, DJ Marley Marl, and DJ Kool Herc. The quotes cover themes of authenticity, confidence, perseverance, positivity, respect, and the cultural significance of hip-hop. Each quote is formatted with the number, quotation marks, the quote text, and the artist's name in bold.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 81,
    "fileName": "81.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected double-quoted property name in JSON at position 2940 (line 97 column 51)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 82,
    "fileName": "82.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains questions 10 through 21 of a Hip-Hop trivia quiz. Questions cover various topics including Grammy awards, classic songs and albums, record labels, artist real names, TV shows, and Hip-Hop terminology. The page number 82 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 83,
    "fileName": "83.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question22",
        "type": "multiline",
        "label": "22. What legendary Hip-Hop producer is known for his work with Nas, Jay-Z and Alicia Keys?",
        "position": {
          "top": "15%",
          "left": "10%"
        },
        "width": "80%",
        "height": 100,
        "multiline": true,
        "numberOfLines": 4,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question23",
        "type": "multiline",
        "label": "23. What is the name of the dance associated with the song \"Crank That\" by Soulja Boy?",
        "position": {
          "top": "35%",
          "left": "10%"
        },
        "width": "80%",
        "height": 100,
        "multiline": true,
        "numberOfLines": 4,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question24",
        "type": "multiline",
        "label": "24. Who famously sang \"I Like Big Butts\" in the early '90s?",
        "position": {
          "top": "55%",
          "left": "10%"
        },
        "width": "80%",
        "height": 100,
        "multiline": true,
        "numberOfLines": 4,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question25",
        "type": "multiline",
        "label": "25. What's the significance of August 11, 1973, in Hip-Hop history?",
        "position": {
          "top": "75%",
          "left": "10%"
        },
        "width": "80%",
        "height": 100,
        "multiline": true,
        "numberOfLines": 4,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 83 of a Hip-Hop trivia book containing four questions (numbered 22-25). The questions cover various Hip-Hop topics including a legendary producer who worked with major artists, a dance associated with a popular song, an artist known for a famous 90s track, and a significant date in Hip-Hop history. The page has blank space below each question for written answers.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 84,
    "fileName": "84.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is an answer key page showing trivia answers numbered 1-25, though only answers 1-12 are visible on this page. The page features a pink 'BONUS' badge logo in the top left, followed by the title 'Trivia Answers 1-25' in bold purple text. The answers cover hip-hop history including DJ Kool Herc as a pioneer (1973), N.W.A, The Bronx as hip-hop's birthplace, and various artists like Mary J. Blige, Nas, Eminem, Cardi B, Public Enemy, and OutKast. The page number 84 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 85,
    "fileName": "85.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page appears to be an answer key or reference list containing answers numbered 13 through 25. The items include various hip-hop artists, songs, albums, and historical facts about hip-hop culture. Notable entries include Vanilla Ice's 'Ice Ice Baby', Snoop Dogg's album 'Doggystyle', Dr. Dre's 'The Chronic', groups like The Fugees and DJ Jazzy Jeff & The Fresh Prince, and the historical significance of DJ Kool Herc's first hip-hop party. The page number 85 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 86,
    "fileName": "86.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Unterminated string in JSON at position 2954 (line 98 column 49)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 87,
    "fileName": "87.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 87 contains a series of 11 hip-hop trivia questions numbered 35-45. Questions cover various topics including sampling, album releases, artist names, hit songs, fashion lines, and debut albums. Topics include artists like Jay-Z, Kendrick Lamar, Snoop Dogg, Tupac, Missy Elliott, Kanye West, and Macklemore, as well as cultural aspects of hip-hop like the 'bling bling' style and Rocawear clothing line.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 88,
    "fileName": "88.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains five hip-hop trivia questions numbered 46-50. The questions cover various aspects of hip-hop history and culture, including Wu-Tang Clan's influential album, Drake's popular single, the Beastie Boys' debut, Master P's work, and a hip-hop artist nickname. The page has a simple, clean layout with numbered questions in a standard format. Page number 88 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 89,
    "fileName": "89.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a bonus answer key page showing trivia answers numbered 26-50. The page features a pink 'BONUS' badge icon in the top left corner and the title 'Trivia Answers 26-50' in large purple text. The answers are listed vertically and include hip-hop artists, album titles, record labels, and song titles. Notable answers include 50 Cent, Eminem, Kendrick Lamar, Lauryn Hill, A Tribe Called Quest (appearing twice), and albums like 'Ready to Die', 'To Pimp a Butterfly', and 'Reasonable Doubt'. Page number 89 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 90,
    "fileName": "90.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains entries 38-50 of what appears to be a hip-hop trivia or answer key list. It includes names of prominent hip-hop artists (Snoop Dogg, Jay-Z, 2Pac, Lil Wayne, Drake, Master P, MC Hammer), album titles (\"Supa Dupa Fly\", \"The College Dropout\", \"Licensed to Ill\"), and entry 46 provides an explanation about Wu-Tang Clan's \"36 Chambers\" album. Entry 40 lists \"Benjamin Haggerty\" which is Macklemore's real name. The page number 90 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 91,
    "fileName": "91.png",
    "type": "title",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is the title page for DJ Scipio's Hip-Hop Time Capsule project. The page features bold yellow 3D graffiti-style text at the top reading 'HIP-HOP TIME CAPSULE' against a purple and blue graffiti-textured background. Below that is a bright pink banner with white text stating 'Document Your Personal Journey'. The center of the page features a large magenta/pink starburst or badge shape with torn paper edges, containing yellow text that reads 'DJ SCIPIO' and 'THIS IS MY JOURNEY'. The overall design has an urban, street art aesthetic with vibrant colors (purple, blue, pink, yellow) and paint splatter effects. The page number 91 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 92,
    "fileName": "92.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "name_field",
        "type": "text",
        "label": "MY NAME IS:",
        "position": {
          "top": "42%",
          "left": "10%"
        },
        "width": "80%",
        "height": 60,
        "multiline": false,
        "placeholder": "Tap to enter your name..."
      },
      {
        "id": "location_field",
        "type": "text",
        "label": "I WAS BORN AND RAISED IN",
        "position": {
          "top": "62%",
          "left": "10%"
        },
        "width": "80%",
        "height": 60,
        "multiline": false,
        "placeholder": "Tap to enter location..."
      },
      {
        "id": "dob_field",
        "type": "text",
        "label": "MY D.O.B IS:",
        "position": {
          "top": "80%",
          "left": "10%"
        },
        "width": "80%",
        "height": 60,
        "multiline": false,
        "placeholder": "Tap to enter date of birth..."
      }
    ],
    "description": "Personal information page introducing the user's hip-hop journey. Features a header with hip-hop culture keywords (hip hop, rap, DJ'ing, culture, flow, style, lyrics, graffiti, b-boy, fashion, beatboxing, sampling) in stylized graffiti-style font. The page includes example information from 'Hilton Scipio' who was born and raised in Harlem and the Bronx, with DOB listed as private. Three blank fields are provided for the user to fill in their own name, birthplace, and date of birth. The page concludes with 'I LOVE HIP-HOP AND THIS IS MY JOURNEY.' Decorated with a pink ink splatter graphic in the top right and a purple microphone icon in the bottom left. Page number 92 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 93,
    "fileName": "93.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 93 of the Hip-Hop Time Capsule book by DJ Scipio. It displays two questions with pre-filled example answers. Question 1 asks 'When did you first discover Hip-Hop music?' with the answer 'I first discovered Hip-Hop in 1976.' displayed in a light gray rounded rectangle with a magenta circular badge showing '1'. Question 2 asks 'Do you remember where you were?' with the answer 'The first time I discovered Hip-Hop, I was in school. I traded a cassette tape with one of my classmates.' displayed in a similar light gray rounded rectangle with a magenta circular badge showing '2'. This appears to be an example page showing how responses might look, rather than a blank input page.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 94,
    "fileName": "94.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 94 of the Hip-Hop Time Capsule book showing questions 3 and 4 with pre-filled example answers from @DJ SCIPIO. Question 3 asks about the first song that caught attention, with the answer identifying 'Apache' by The Incredible Bongo Band from a cassette tape exchange. A QR code is included below the answer, labeled 'Apache', presumably linking to the song. Question 4 asks about emotions felt when first hearing Hip-Hop, with the answer describing it as 'a soulful experience.' The answers are displayed in rounded rectangular boxes with magenta circular number badges (3 and 4).",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 95,
    "fileName": "95.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 95 features two numbered questions (5 and 6) with answers provided by DJ Scipio. Question 5 asks about the hottest/illiest MCs, with the answer listing Kool Moe Dee, Melle Mel, GrandMaster Caz, Nas, Jay Z, and Jada Kiss. Two QR codes are displayed below, linking to 'NY State of Mind' by Nas and 'It's A Hard Knock Life' by Jay-Z. Question 6 asks if Hip-Hop inspired the reader to pursue music careers, with the answer explaining that the person was already a DJ playing Soul, Disco, and Funk, but GrandMaster Flash and GrandWizard Theodore inspired them to become a Hip-Hop DJ. Both questions and answers are displayed in rounded rectangular boxes with numbered circular badges (5 and 6) in magenta.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 96,
    "fileName": "96.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains questions 7 and 8 with their detailed answers. Question 7 is displayed with a magenta circular number '7' icon and discusses how Hip-Hop influenced the author's social circles, specifically mentioning their partnership with DJ Jazzy G combining Disco, Funk, and Hip-Hop mixing styles. Question 8 features a magenta circular number '8' icon and lists three influential songs that gave the author confidence: 'The Message' by GrandMaster Flash and the Furious Five, 'Self Destruction' by KRS-1, and 'Yes We Can Can' by The Treacherous Three. A QR code is present at the bottom of the page with a note about 'Self Destruction' original artist upload not being available. The page footer shows the social media handle '@DJ SCIPIO' and page number 96.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 97,
    "fileName": "97.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 97 displays answers to questions 9 and 10 about top concerts/jams and influential Hip-Hop DJs. Question 9's answer identifies five iconic Bronx venues. Question 10 provides an extensive ranked list of foundational Hip-Hop DJs, with special emphasis on DJ Kayslay (highlighted in bold) and a detailed explanation about Frankie Crocker's unique contribution as a radio personality rather than traditional DJ. The page includes three QR codes at the bottom linking to tracks by Kid Capri, DJ Kayslay, and DJ Hollywood. Numbered circles (9 and 10) in magenta mark each question.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 98,
    "fileName": "98.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 98 from a Hip-Hop Time Capsule book featuring two Q&A sections. Question 11 asks about favorite crew members to party with, with the answer listing five people with their nicknames (displayed in a light gray rounded box with pink circular number 11). Question 12 asks about top three old-school dances then and now, with the answer mentioning The Hustle, The Freak Dance, and The Bump for the past, and the Electric Slide for today (displayed in a light gray rounded box with pink circular number 12). The page has clean typography with questions in bold italic and answers in a modern sans-serif font. Social media handle @DJ_SCIPIO appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 99,
    "fileName": "99.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 99 displays two completed Q&A entries (questions 13 and 14) from DJ Scipio's Hip-Hop Time Capsule. Question 13 asks about top five Hip-Hop clubs, with the answer listing five Bronx venues: Disco Fever, T-Connection, The Stardust Ballroom, Club 371, and The Sparkle. The answer appears in a light gray rounded rectangle box with a magenta circular badge showing '13'. Question 14 asks about top party songs that 'rocked the house', with the answer listing five classic tracks by Kool Moe Dee, Afrika Bambaataa and Soulsonic Force, Rob Base & DJ E-Z Rock, Strafe, and Newcleus. This answer appears in a similar gray box with a magenta '14' badge. At the bottom of the page are three QR codes labeled 'Wild Wild West', 'Planet Rock', and 'Jam On It', presumably linking to these songs. The page footer shows 'DJ SCIPIO'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 100,
    "fileName": "100.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 398 (line 10 column 81)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 101,
    "fileName": "101.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains questions 17 and 18 from the Hip-Hop Time Capsule. Question 17 asks about a regretted missed concert or event, with an answer describing the historic 1981 MC battle between Busy Bee Starsky and Kool Moe Dee at Harlem World. Three QR codes are provided linking to related videos about this battle. Question 18 asks about old school lines still recited today, with a brief answer stating the inability to name specific lines. The page includes question number badges (17 and 18 in magenta circles) and ends with the DJ Scipio attribution and page number 101.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 102,
    "fileName": "102.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 102 of DJ Scipio's Hip-Hop Time Capsule featuring two Q&A entries. Question 19 asks about favorite club songs, with an extensive list including Apache, The Mexican, and other funk/disco classics. Question 20 asks about top five B-Boy break dance tracks, listing The Mexican, Ride Sally Ride, Just Begun, Rock Creek Park, and Give It Up Turn It Loose. The page features two decorative pink circular badges with the numbers '19' and '20' positioned on opposite sides, and ink blot accent images. Answers are displayed in gray text boxes.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 103,
    "fileName": "103.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 103 of a Hip-Hop Time Capsule book showing Q&A format. Question 21 asks about DJ equipment ownership with an answer displayed in a light gray rounded rectangle box with a magenta circle containing '21' on the left. The answer mentions Technic Turntables, Gemini Mixer, and Kenwood Amp. Question 22 asks about violence at clubs/jams with an answer in another rounded box with a magenta '22' circle on the right side. The answer describes an incident at The Valley in The Bronx with DJ Jazzy G and DJ Whiz Kid. Footer shows '@DJ SCIPIO' and page number 103.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 104,
    "fileName": "104.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a completed input page showing questions 23 and 24 from the Hip-Hop Time Capsule questionnaire. Question 23 asks if the respondent has been affected by the loss of an artist they were a fan of, with the answer 'Yes, I have been affected by the loss of a Hip-Hop artist' displayed in a light gray bubble with a magenta circular badge numbered '23'. Question 24 is a follow-up asking how they were specifically affected, with the answer 'I was saddened by the loss of my friend, DJ Whiz Kid. Also, DJ Silverback and DJ Robert Randolph of Orangeburg, SC.' shown in another light gray bubble with a magenta circular badge numbered '24'. The page includes the footer '@DJ SCIPIO' and page number 104.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 105,
    "fileName": "105.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 105 of the Hip-Hop Time Capsule book containing two questions with filled-in answers. Question 25 asks about opportunities to do something kind or important for a favorite artist, with the answer stating they never had such an opportunity. Question 26 asks which song lyrics the person would want to come true for a day, with the answer being 'If I Ruled The World' by Kurtis Blow. A QR code appears between the questions. The answers are displayed in gray rounded rectangles with magenta circular badges containing the question numbers (25 and 26). The page is attributed to @DJ SCIPIO at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 106,
    "fileName": "106.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 106 of a Hip-Hop Time Capsule book featuring questions 27 and 28 with their answers. Question 27 asks about memorable Hip-Hop songs tied to specific memories, with the answer citing 'The Mexican' by Babe Ruth. A QR code links to this song. Question 28 asks about Hip-Hop artist crushes, with the answer naming Queen Latifah. Another QR code links to 'Ladies First' by Queen Latifah ft. Monie Love. The answers are displayed in speech bubble-style boxes with circular magenta number badges (27 and 28). The page is credited to @DJ SCIPIO at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 107,
    "fileName": "107.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 107 of a Hip-Hop Time Capsule book showing questions 29 and 30 with filled-in answers. Question 29 asks about favorite New York mixtape DJs, with an extensive answer listing DJ Clue, DJ Kayslay, DJ Ron G., DJ Envy, DJ Doowop, DJ SCIPIO, DJ KFD aka Stanley Scipio, DJ Kool Kev., DJ Action Pac, DJ Lazy K, DJ Kid Capri, DJ Dirty Harry, Tony Touch a DJ S&S, and DJ Juice (RIP). Question 30 asks about favorite B-Boys and why, with the answer naming Cholly Rock, Trixi, Salsa and The Legendary Twins. Both answers appear in gray rounded text boxes with magenta circular numbers (29 and 30) on the left and right sides respectively. The page footer shows @DJ SCIPIO.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 108,
    "fileName": "108.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 108 of a DJ interview or questionnaire featuring questions 31 and 32. Question 31 asks about record pool membership, with an answer listing multiple record pools including Columbia Record Pool, Franchise Record Pool, Mr. Excitement, Digi Waxx Media, and The Boogie Report Hit Music Dispatch. Question 32 asks about favorite colognes or fragrances worn when going to clubs, with the answer being Egyptian Musk. Each question-answer pair is displayed in a rounded rectangular box with circular magenta numbered badges (31 and 32). The page is credited to @DJ SCIPIO at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 109,
    "fileName": "109.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 109 contains two filled-in questions about Hip-Hop fashion. Question 33 asks about favorite Hip-Hop clothing/gear with an answer in a gray rounded rectangle bubble with a magenta '33' badge on the left. Question 34 asks about sneaker/shoe preferences then and now, with an answer in a gray rounded rectangle bubble with a magenta '34' badge on the right. The page shows completed responses rather than blank input fields. The footer displays @DJ SCIPIO at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 110,
    "fileName": "110.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 110 displays two completed questions with answers. Question 35 asks about favorite party drinks then and now, with the answer indicating Budweiser was the favorite but the person no longer drinks. Question 36 asks about artists/groups that influenced views on social issues and activism, listing Public Enemy, KRS-One, Queen Latifah's U.N.I.T.Y, and DMX. Two QR codes are provided at the bottom linking to 'U.N.I.T.Y by Queen Latifah' and 'Fight The Power by Public Enemy'. The answers appear in speech bubble-style boxes with circular magenta numbered badges (35 and 36) indicating the question numbers. The page footer shows '@DJ SCIPIO'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 111,
    "fileName": "111.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 111 contains two answered Hip-Hop questions. Question 37 asks about artists whose life stories have inspired the respondent, with the answer citing DMX and his track 'Slippin'. The answer is displayed in a light beige/cream bubble on the right with the number 37 in a magenta circle on the left. A QR code appears below this answer linking to 'Slippin'. Question 38 asks about Hip-Hop's contribution to personal growth, with the answer crediting Mobb Deep's 'Shook Ones' for its inspiring lyrics. This answer appears in a light gray bubble on the left with the number 38 in a magenta circle on the right. Another QR code links to 'Shook Ones'. The page footer shows @DJ SCIPIO and page number 111.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 112,
    "fileName": "112.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 112 of the Hip-Hop Time Capsule book featuring questions 39 and 40. Question 39 asks about the first time the user tried to write their own rap, with the answer stating 'Does not apply. I never tried to write my own raps.' displayed in a light gray speech bubble with the number 39 in a magenta circle. Question 40 asks who or what inspired them to try and how they would rate their skills, with the answer 'Does not apply. No one inspired me to write a rap.' shown in a light gray speech bubble with the number 40 in a magenta circle. The page shows consecutive questions with N/A responses, indicating the respondent has never attempted to write rap music. The page footer displays @DJ SCIPIO and page number 112.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 113,
    "fileName": "113.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question41_answer",
        "type": "multiline",
        "label": "Have you ever met or worked with any of your favorite artists or legends in Hip-Hop?",
        "position": {
          "top": "28%",
          "left": "20%"
        },
        "width": "65%",
        "height": 180,
        "multiline": true,
        "numberOfLines": 8,
        "placeholder": "Tap to answer...",
        "prefilled": "Yes, I have met and worked with some of my favorite artists. Kool Moe Dee and I were sixth grade classmates. We both attended P.S. 129 in Harlem. I also met Queen Latifah, Prodigy of Mobb Deep, Run-DMC and Grandmaster Jay, Raekwon, T.I., Lil' Jon, Rasheeda, Scrappy, Scarface, Pastor Troy, Master P and many more."
      },
      {
        "id": "question42_answer",
        "type": "multiline",
        "label": "Who was the better lyricist: Biggie or Tupac?",
        "position": {
          "top": "78%",
          "left": "35%"
        },
        "width": "50%",
        "height": 80,
        "multiline": true,
        "numberOfLines": 3,
        "placeholder": "Tap to answer...",
        "prefilled": "No comment..."
      }
    ],
    "description": "Page 113 contains two Hip-Hop questions. Question 41 asks about meeting or working with favorite Hip-Hop artists and legends. The answer mentions being sixth grade classmates with Kool Moe Dee at P.S. 129 in Harlem, and meeting numerous legends including Queen Latifah, Prodigy of Mobb Deep, Run-DMC, Grandmaster Jay, Raekwon, T.I., Lil' Jon, Rasheeda, Scrappy, Scarface, Pastor Troy, and Master P. A QR code is included linking to 'Shook Ones' by Mobb Deep. Question 42 asks the classic debate question about who was the better lyricist between Biggie and Tupac, with the diplomatic answer 'No comment...' The page has magenta circular number badges (41 and 42) and includes DJ Scipio's handle at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 114,
    "fileName": "114.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question43",
        "type": "multiline",
        "label": "43. What were your thoughts on the infamous East Coast vs. West Coast War? Did you choose a side?",
        "position": {
          "top": "18%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question44",
        "type": "multiline",
        "label": "44. If you could have fifteen minutes with your favorite Hip-Hop legend or artist, who would it be and what would you say?",
        "position": {
          "top": "58%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 114 of Hip-Hop Time Capsule featuring two questions (43 and 44). Question 43 asks about the East Coast vs. West Coast War with the answer 'No comment' displayed in a speech bubble with number 43. Question 44 asks about spending fifteen minutes with a favorite Hip-Hop legend, with a detailed answer about Mary J. Blige shown in a speech bubble with number 44. The page includes DJ Scipio's handle at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 115,
    "fileName": "115.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 115 of a Hip-Hop questionnaire showing two answered questions. Question 45 asks about spending a day with a favorite Hip-Hop legend, with the answer indicating Queen Latifah and studio work. Question 46 asks about choosing an artist for a rap battle, with Jay Z as the answer. Each answer appears in a light gray rounded rectangle box with a magenta circular badge containing the question number. The page footer shows @DJ SCIPIO and page number 115.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 116,
    "fileName": "116.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 116 features two questions with answers. Question 47 asks about clever diss lines, with a humorous answer refusing to provide any ('Uhhh... on second thought, never mind.'). Question 48 asks for a funny/embarrassing story, with a detailed answer about attending a park jam with DJ Whiz Kid where someone fired a gun, causing everyone to run for cover. The respondent's friend Jazzy G was wearing a brand-new Puma outfit that got completely ripped going through hedges while escaping. The page includes circular numbered badges (47 in magenta, 48 in magenta) next to their respective responses.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 117,
    "fileName": "117.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page (117) contains two answered questions (#49 and #50) from DJ Scipio's Hip-Hop Time Capsule. Question 49 asks about challenging an artist to a dance-off, with a humorous response naming Fred Sanford from the TV show Sanford and Son. Question 50 asks about the nicest thing a Hip-Hop legend has done, with a detailed story about meeting T.I. at a record store in Columbia, South Carolina in 2003 during the promotion of his Trap Music album. The responses are displayed in speech bubble/text box format with numbered circular badges (49 and 50 in magenta/pink). The page includes decorative splash accent images and DJ Scipio's social media handle at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 118,
    "fileName": "118.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page displays two Q&A entries (questions 51 and 52) with their responses already filled in. Question 51 features a magenta circular badge with '51' and asks about advice from Hip-Hop legends, with the answer describing advice from Master P about moving forward in the mixtape game. Question 52 has the number badge on the right side and asks about humorous stories, with a brief negative response. The answers are presented in speech bubble-style containers with light gray backgrounds. The page number 118 and DJ Scipio's social media handle appear at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 119,
    "fileName": "119.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 119 features two answered questions about women in Hip-Hop. Question 53 asks about early contributions and favorite female artists, with an answer highlighting their dynamic artistry and listing The Sequence, Queen Latifah, Roxanne Shante, ShaRock, Debbie D., and Missy Elliott. Question 54 asks about post-80s favorites, answered with Salt-n-Pepa, Lil' Kim, MC Lyte, Remy Ma, and Lady of Rage. A QR code links to Missy Elliot's 'Lose Control' featuring Ciara. Answers appear in rounded text boxes with magenta circular question numbers (53 and 54).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 120,
    "fileName": "120.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 120 displays two questions (55 and 56) with detailed answers about favorite female and male Hip-Hop and R&B artists. Question 55 has a circular badge with '55' and lists artists including Mary J. Blige, Lauren Hill, Aaliyah, Whitney Houston, Beyonce, and others. Question 56 has a circular badge with '56' and lists male artists including Keith Sweat, Usher, Ginuwine, Tank, and others. The page includes four QR codes linking to songs: 'You Remind Me' by Mary J. Blige, 'Single Ladies' by Beyonce, 'Rock the Boat' by Aaliyah, and 'Right and a Wrong Way' by Keith Sweat. The page footer shows '@DJ SCIPIO' and page number 120.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 121,
    "fileName": "121.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 121 of the Hip-Hop Time Capsule book featuring two Q&A responses from DJ Scipio. Question 57 asks about choosing a career in Rap or Hip-Hop and how the person is contributing to the genre, or what they're doing instead. The answer confirms they chose a Hip-Hop career and would otherwise have a boring 9-to-5 job. Question 58 asks about challenges faced in a Rap or Hip-Hop career. The answer discusses facing criticism from older generations who didn't understand or appreciate the new style of DJing, specifically 'cuttin' and scratchin' records.' The responses are displayed in speech bubble-style text boxes with circular numbered badges (57 and 58 in magenta/pink). The page footer shows the attribution '@DJ SCIPIO' and page number 121.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 122,
    "fileName": "122.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 122 of DJ Scipio's Hip-Hop Time Capsule book. It contains two questions (59 and 60) with detailed answers. Question 59 asks about family members or friends who provided encouragement during challenges, and DJ Scipio mentions his brother Stanley Scipio, friend Greg Simpkins, and nephew Kevin Bush, noting they were also DJs who understood his challenges. Question 60 asks how he overcame those challenges, and he explains he refused to let them deter him, recognizing the new style of DJ'ing as something special and refusing to give up. The answers are presented in speech bubble-style text boxes with circular numbered badges (59 and 60) in magenta/pink color. The page includes DJ Scipio's social media handle at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 123,
    "fileName": "123.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 123 from Hip-Hop Time Capsule book featuring two questions with answers. Question 61 asks about favorite Hip-Hop producers, with an extensive list provided including Swizz Beatz, Timbaland, DJ Marley Marl, and others. The answer is displayed in a gray bubble with a magenta circle containing '61' on the left. Question 62 asks about Hip-Hop's influence on views about diversity and inclusion, with an answer explaining that Hip-Hop helped the respondent realize everyone has a story to tell regardless of background. This answer is in a gray bubble with a magenta circle containing '62' on the right. The page has '@DJ SCIPIO' at the bottom center and '123' as the page number.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 124,
    "fileName": "124.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 124 of the Hip-Hop Time Capsule book featuring two Q&A entries. Question 63 asks about songs or artists that helped shape the respondent's voice and identity, with the answer crediting Public Enemy. The answer appears in a light gray rounded rectangle with a magenta circular badge containing '63' on the left side. Question 64 asks about Hip-Hop's storytelling aspect and whether the respondent has written their own stories. The answer appears in a light gray rounded rectangle with a magenta circular badge containing '64' on the right side, stating appreciation for storytelling but noting their story hasn't been written yet but may come soon. The page footer shows '@DJ SCIPIO' centered at the bottom with page number 124.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 125,
    "fileName": "125.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 125 from DJ Scipio's Hip-Hop Time Capsule featuring two questions (65 and 66) with pre-filled answers. Question 65 asks about Hip-Hop bringing communities together, with an answer describing block party celebrations for deceased community members. Question 66 asks about community activism through Hip-Hop, with an answer describing DJ work organizing fundraisers and back-to-school drives. The answers are displayed in gray speech bubble boxes, with question 65's answer numbered with a magenta circle containing '65' on the left, and question 66's answer numbered with a magenta circle containing '66' on the right. The page includes DJ Scipio's handle and page number at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 126,
    "fileName": "126.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 126 features two answered Hip-Hop questions. Question 67 asks about favorite aspects of the user's generation of Hip-Hop, with a response emphasizing the positive, fun nature of the music and its ability to keep people focused and out of trouble. Question 68 asks about favorite Hip-Hop karaoke songs, with the answer being 'Rapper's Delight' by Sugar Hill Gang. A QR code is included at the bottom right, labeled 'Rapper's Delight', presumably linking to the song. The answers are displayed in rounded speech bubble-style containers with magenta circular question numbers (67 and 68).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 127,
    "fileName": "127.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains two questions (69 and 70) with pre-filled answers about Hip-Hop's influence on exploring other music genres and Dirty South artists' contributions to Hip-Hop. Question 69 has a pink circular badge with '69' and discusses exploration of West Coast, Dirty South, and Southern Soul music. Question 70 has a pink circular badge with '70' and lists influential Dirty South artists including OutKast, Goodie Mob, T.I., UGK, The Geto Boys, Lil' Flip, Lil Jon, Master P, and Scarface. The bottom of the page features three QR codes linking to songs: 'My Mind is Playing Tricks' by the Geto Boys, 'They Don't Dance No More' by Goodie Mob, and 'ATLiens' by Goodie Mob. The page is credited to @DJ SCIPIO and numbered 127.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 128,
    "fileName": "128.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 128 of Hip-Hop Time Capsule featuring two answered questions about West Coast hip-hop artists and Hip-Hop's positive impact. Question 71 lists favorite West Coast artists including Tupac, Snoop Dogg, Ice Cube, Ice-T, Easy-E, Too Short, E-40, Mack 10, Nate Dogg, MC Hammer, The D.O.C., and Xzibit. The answer is displayed in a light gray rounded rectangle with a pink circular badge numbered '71'. Below are three QR codes linking to classic West Coast songs: 'Me Against The World' by Tupac, 'Today Was A Good Day' by Ice Cube, and 'Gin and Juice' by Snoop Dogg. Question 72 discusses Hip-Hop's positive impact, with the answer stating it brings different races and cultures together, displayed in a light gray rounded rectangle with a pink circular badge numbered '72'. The page is credited to @DJ SCIPIO at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 129,
    "fileName": "129.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 129 displays two Hip-Hop interview questions with completed answers. Question 73 asks about artists who have positively impacted classic Hip-Hop's evolution, with the answer praising J. Cole, Kendrick Lamar, and Nipsey Hussle for being more lyrical than other new artists. Question 74 asks about over-hyped or negatively impactful artists, answered simply with 'No comment.' The answers appear in gray rounded rectangles with large pink circular number badges (73 and 74). The page is credited to @DJ SCIPIO at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 130,
    "fileName": "130.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 130 features questions 75 and 76 with filled-in answers. Question 75 asks about Hip-Hop songs that matched the respondent's energy during frustration or hardship, both in the past and today. The answer lists several songs including Party Up by DMX, Thug Luv by Bone Thugs-N-Harmony featuring Tupac, I Don't Give A F*ck by Lil Jon, Wild Out by The Lox, and Throw Ya Gunz(In The Air) by Onyx, noting the respondent still likes the same songs. Three QR codes are displayed for Wild Out by The Lox, Thug Luv by Bone Thugs-N-Harmony ft. Tupac, and Party Up by DMX. Question 76 asks about local artists or DJs the respondent is most proud of. The answer discusses DJ Whiz Kid, a childhood friend from the Bronx who lived in Parkside Housing. The respondent recalls playing basketball together on Saturdays and expresses pride in DJ Whiz Kid becoming one of the top Hip-Hop DJs. A fourth QR code labeled 'The Original Whiz Kid' is included. A large '75' badge appears in the top right corner. The page footer shows '@DJ SCIPIO' and page number 130.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 131,
    "fileName": "131.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains two answered questions about hip-hop music. Question 77 asks about favorite beatbox artists, with the answer listing Doug E. Fresh, The Fat Boys, and Biz Markie, with a QR code linking to 'Doug E. Fresh & Slick Rick - The Show'. Question 78 asks about the most sampled artist, with a detailed answer about James Brown and the history of sampling, including information about Grandmaster Flash and DJ Marley Marl. A QR code links to 'Funky Drummer' by James Brown. The answers appear in rounded text boxes with circular numbered badges (77 and 78). The page footer shows @DJ SCIPIO and page number 131.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 132,
    "fileName": "132.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question79",
        "type": "multiline",
        "label": "What rapper, if any, influenced you to become, or want to become, a rapper? How?",
        "position": {
          "top": "27%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question80",
        "type": "multiline",
        "label": "Like Mt. Rushmore, if there were a Mt. EASTmore of Hip-Hop, who would you choose?",
        "position": {
          "top": "65%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 132 of the Hip-Hop Time Capsule presents two questions about rap influences and East Coast Hip-Hop legends. Question 79 asks what rapper influenced the reader to become or want to become a rapper and how. The example answer states that no rapper influenced them. Question 80 asks readers to choose who would be on a 'Mt. EASTmore' of Hip-Hop, similar to Mt. Rushmore. The example answer lists Melle Mel, Kool Moe Dee, Grandmaster Caz, and DMX. Both questions have numbered circular badges (79 and 80 in magenta) and shaded answer boxes. The page includes the author credit '@DJ SCIPIO' at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 133,
    "fileName": "133.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains two Hip-Hop related questions (81 and 82) with provided answers. Question 81 asks about choosing artists for a 'Mt. WESTmore of Hip-Hop' with the answer selecting Snoop Dogg, Tupac, Ice Cube, and Ice-T. Question 82 asks about a 'Mt. Ladies-Onlymore of Hip-Hop' with the answer choosing Queen Latifah, MC Lyte, Roxanne Shant and MC Sha-Rock. The answers are displayed in rounded gray boxes with magenta circular number badges (81 and 82). The page includes the author credit '@DJ SCIPIO' at the bottom and page number 133.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 134,
    "fileName": "134.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Content page from a Hip-Hop Time Capsule book featuring two questions with detailed answers. Question 83 asks about influential local DJs and lists 11 DJs including DJ Shakim, DJ Prince Ice, and others. Question 84 asks about favorite club songs to play as a DJ, with a comprehensive list of classic hip-hop tracks from artists like Chic, Esther Williams, GrandMaster Flash, and others. The page includes a notable highlight that Sha-Rock is the first female Hip-Hop MC. Three QR codes at the bottom link to songs: 'Play That Beat Mr. DJ', 'Funk You Up', and 'That's The Joint'. The page is numbered 134 and includes the handle @DJ_SCIPIO at the bottom. Question numbers 83 and 84 appear in circular pink badges.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 135,
    "fileName": "135.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question86_answer",
        "type": "multiline",
        "label": "What are your favorite Hip-Hop love songs today?",
        "position": {
          "top": "62%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 135 features two Hip-Hop trivia questions about love songs. Question 85 asks about the first official Hip-Hop love song and its artist, with a pre-filled answer identifying LL Cool J's 'I Need Love' from 1987 in a gray speech bubble with number 85 in a magenta circle. A QR code is included, presumably linking to the song. Question 86 asks about favorite Hip-Hop love songs today, with a simple pre-filled response 'I don't have any' in a gray speech bubble with number 86 in a magenta circle. The page includes the DJ Scipio attribution at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 136,
    "fileName": "136.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 136 features two answered questions from a Hip-Hop Time Capsule. Question 87 asks about favorite women artists in Hip-Hop today, with the answer listing Beyonce, Sexy Red, Nicki Minaj, Angie Stone, Cardi B, Megan Thee Stallion, Saweetie and Latto, followed by 'RIP Angie Stone' with a dove icon. Question 88 asks what's on the user's playlist right now, listing songs by Kendrick Lamar, Cambatta, Saweetie, and GloRilla. A QR code appears at the bottom of the page linking to 'Not Like Us' by Kendrick Lamar. The answers are displayed in rounded grey text boxes with magenta circular question numbers (87 and 88). The page is credited to @DJ SCIPIO at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 137,
    "fileName": "137.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question89",
        "type": "multiline",
        "label": "In your generation, who was your favorite graffiti artist? Do you have a favorite one today?",
        "position": {
          "top": "30%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question90",
        "type": "multiline",
        "label": "In your opinion, what ignited the legendary beef between Drake and Kendrick Lamar?",
        "position": {
          "top": "70%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 137 of the Hip-Hop Time Capsule features two questions with example answers displayed in speech bubble-style boxes. Question 89 asks about favorite graffiti artists from the respondent's generation and today, with an answer mentioning The Crazy Five, Blade, Seen, and BS119. Question 90 asks about the Drake and Kendrick Lamar beef, with an answer explaining it started with Kendrick's verse on Big Sean's 'Control.' The questions are numbered 89 and 90 with magenta circular badges, and the page is credited to @DJ SCIPIO at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 138,
    "fileName": "138.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question91",
        "type": "multiline",
        "label": "91. How did it impact your perception of them?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question92",
        "type": "multiline",
        "label": "92. What specific lyrics from their diss tracks stood out the most to you?",
        "position": {
          "top": "60%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Input page containing questions 91 and 92 from the Hip-Hop Time Capsule book. Question 91 asks about how something impacted perception with a 'No comment...' response shown in a gray bubble with pink circle labeled '91'. Question 92 asks about specific lyrics from diss tracks that stood out, with a sample response about Kendrick Lamar's track in a gray bubble with pink circle labeled '92'. Page footer shows '@DJ SCIPIO' and page number 138.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 139,
    "fileName": "139.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question93",
        "type": "multiline",
        "label": "93. Who have you determined the winner, and which song led you to that conclusion?",
        "position": {
          "top": "28%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Input page 139 featuring two questions about determining a winner in what appears to be a music competition or comparison. Question 93 asks who the winner is and which song led to that conclusion, with a response bubble showing 'No comment.' Question 94 asks about whether the respondent's inner-circle agreed with their opinion, with a response indicating most agreed but some did not. The page has numbered circular badges (93 and 94) in magenta/pink color. The footer shows the creator's handle @DJ SCIPIO and page number 139. Question 93 appears to be the fillable input field for this page.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 140,
    "fileName": "140.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains questions 95 and 96 with pre-filled answers about Hip-Hop rivalries and beefs. Question 95 asks whether rivalries benefit or negatively impact Hip-Hop culture, with an answer explaining they benefit the culture by showcasing lyrical skills as long as they stay on wax. Question 96 asks about iconic beefs, listing pairs like Kool Moe Dee and Busy Bee Starski, Kool Moe Dee and LL Cool J, Jay-Z and Nas, 50 Cent and Ja Rule, and Tupac and Biggie. Three QR codes at the bottom link to historical battle content. The answers are displayed in gray rounded boxes with magenta circular number badges (95 and 96). Page number 140 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 141,
    "fileName": "141.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question97",
        "type": "multiline",
        "label": "97. Considering this year as the year of enlightenment, what breaking news about an artist you admired changed your perception of them?",
        "position": {
          "top": "20%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question98",
        "type": "multiline",
        "label": "98. Presently, which artists represent the best of both old-school and new-school Hip-Hop?",
        "position": {
          "top": "55%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 141 contains two Hip-Hop questions. Question 97 asks about breaking news that changed perception of an admired artist in 'the year of enlightenment,' with a 'No comment...' response in a gray bubble marked with number 97 in a magenta circle. Question 98 asks which artists currently represent both old-school and new-school Hip-Hop, with a detailed response listing Snoop Dogg, LL Cool J, 50 Cent, Eminem and Keith Sweat, marked with number 98 in a magenta circle. The page includes the signature '@DJ SCIPIO' at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 142,
    "fileName": "142.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Final two questions (99 and 100) of the Hip-Hop Time Capsule questionnaire. Question 99 asks about the respondent's role in contributing to Hip-Hop culture through consumption and community interaction. The answer indicates the person is both a fan and DJ who helped break records. Question 100 asks when the person realized they ARE Hip-Hop, with a detailed response describing their first jam at Boston Secor Center, including fashion details (Ceasar haircut, mock neck shirt, Lee Jeans, British Walkers, 007), and experiencing all four elements of Hip-Hop (DJing, MCing, B-Boying, Graffiti). Three QR codes are shown for classic funk/R&B songs used in Hip-Hop: 'Apache' by Incredible Bongo Band, 'I Just Want To Do My Thing' by Edwin Starr, and 'Give It Up or Turn It Loose' by James Brown. The page includes decorative splash-icon accents and is attributed to @DJ SCIPIO.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 143,
    "fileName": "143.png",
    "type": "title",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a title page for a Hip-Hop Time Capsule journal/workbook by Anita Scipio. The page features bold yellow graffiti-style text at the top reading 'HIP-HOP TIME CAPSULE' against a purple and blue background. Below that is white text stating 'Document Your Personal Journey'. The center of the page features a large pink/magenta starburst or badge shape with torn paper edges, containing the author's name 'ANITA SCIPIO' and subtitle 'THIS IS MY JOURNEY' in yellow outlined text. The overall design uses vibrant colors - purple, blue, pink, and magenta - with a street art/urban aesthetic. The page number 143 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 144,
    "fileName": "144.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "name_field",
        "type": "text",
        "label": "MY NAME IS:",
        "position": {
          "top": "45%",
          "left": "10%"
        },
        "width": "80%",
        "height": 50,
        "multiline": false,
        "numberOfLines": 1,
        "placeholder": "Enter your name..."
      },
      {
        "id": "birthplace_field",
        "type": "text",
        "label": "I WAS BORN AND RAISED IN",
        "position": {
          "top": "65%",
          "left": "10%"
        },
        "width": "80%",
        "height": 50,
        "multiline": false,
        "numberOfLines": 1,
        "placeholder": "Enter your birthplace..."
      },
      {
        "id": "dob_field",
        "type": "text",
        "label": "MY D.O.B IS:",
        "position": {
          "top": "82%",
          "left": "10%"
        },
        "width": "80%",
        "height": 50,
        "multiline": false,
        "numberOfLines": 1,
        "placeholder": "Enter your date of birth..."
      }
    ],
    "description": "This is a personal information input page from a Hip-Hop Time Capsule book. The page features graffiti-style text at the top listing various hip-hop elements (rap, DJ'ing, culture, flow, style, lyrics, rhymes, graffiti, b-boy, fashion, beatboxing, sampling). It contains three fill-in fields for name, birthplace, and date of birth, with example information filled in for Anita Scipio (born Dec 14, 1956, raised in Harlem and the Bronx). The page is decorated with a pink paint splatter graphic in the top right corner and a pink microphone icon in the bottom left. A pink underline separates each field. The page concludes with the statement 'I LOVE HIP-HOP AND THIS IS MY JOURNEY.' Page number 144 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 145,
    "fileName": "145.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a filled-out example page showing two questions about discovering Hip-Hop music with completed answers. Question 1 asks when the person first discovered Hip-Hop (answered: 1977), displayed in a pink circular badge numbered '1'. Question 2 asks if they remember where they were, with answer number '2' in a pink circular badge. The detailed response describes watching TV in their bedroom when their brother Hilton played a record on his new DJ equipment. The page includes a reference to 'Rap and Hip Hop: Crash Course Black American History #47' with a QR code, and notes this represents one of several different theories about Hip-Hop's origins. The page is credited to @ANITA and numbered 145.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 146,
    "fileName": "146.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This content page displays questions 3 and 4 with their answered responses. Question 3 asks about the first song that caught attention, with the answer in a gray bubble marked with '3' in magenta explaining it was 'Good Times' by Chic and introducing the concept of cutting and scratching. Question 4 asks about emotions felt when first hearing Hip-Hop, with the answer in a gray bubble marked with '4' in magenta describing feelings of annoyance due to a brother repeatedly playing Good Times. Two QR codes at the bottom link to the original song and a breakbeat mix. Page number 146 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 147,
    "fileName": "147.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 147 of the Hip-Hop Time Capsule book, displaying questions 5 and 6 with completed answers. Question 5 asks about the hottest/illest MCs, and the answer lists pioneers including Coke La Rock, Disco King Mario, DJ Hollywood, DJ Kool Herc, Grandmaster Flash, Melle Mel, LL Cool J, Kool Moe Dee, MC Lyte, and Doug E. Fresh, with special mention of Kool Herc's famous Sedgwick Ave party and merry-go-round technique. Question 6 asks if hip-hop inspired the person to pursue any hip-hop disciplines, with a simple 'No, it did not' response. The page includes a historical flyer image from 1520 Sedgwick Ave and a QR code linking to information about Kool Herc's technique. Large circular numbers 5 and 6 in magenta mark each question. Footer shows '@ANITA' and page number 147.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 148,
    "fileName": "148.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page shows questions 7 and 8 from a Hip-Hop questionnaire. Question 7 asks about Hip-Hop's role in friendships and social circles, with a negative response given in a numbered circle labeled '7'. Question 8 asks about songs that gave confidence to overcome personal challenges, with a detailed answer in circle '8' listing songs by Tupac, Curtis Blow, Black Sheep, and Kid-n-Play. Four QR codes are displayed at the bottom, presumably linking to the mentioned songs. The page is attributed to @ANITA and numbered 148.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 149,
    "fileName": "149.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 149 displays questions 9 and 10 from a Hip-Hop Time Capsule questionnaire. Question 9 asks about top jams/concerts, answered in a circular magenta badge numbered '9'. The response explains the respondent stayed home for family parties or attended house parties. Question 10, marked with a large magenta '10' badge, asks about influential DJs in Hip-Hop. The answer lists numerous legendary DJs including GrandMaster Flash, Eric B., DJ Jazzy Jeff, and others. Below is a Hot 97 logo section with a special note titled 'The Rival Station That Shaped the Culture' acknowledging Hot 97's impact on hip-hop radio and listing additional influential DJs like Funk Master Flex and DJ Kay Slay. The page includes microphone and chain accent images and ends with the handle @ANITA.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 150,
    "fileName": "150.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 150 features two answered questions (11 and 12) with responses from a hip-hop personality. Question 11 discusses favorite people to party with, mentioning family and Mama Earlene Scipio. Question 12 discusses old-school dances including The Wop, The Bump, and The Hustle. The page begins with a statement about Ed Lover, Lisa G, and Hot 97's contributions to hip-hop culture. There's a QR code at the bottom right linking to 'The Woppit Dance by B-Fats'. The page includes decorative elements like check marks and splash icons, with the number 11 and 12 highlighted in magenta circles.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 151,
    "fileName": "151.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a completed input page from a Hip-Hop Time Capsule book showing questions 13 and 14. Question 13 asks about top five Hip-Hop clubs, with the answer mentioning only two clubs in the Bronx: Boston Road Ballroom and The Stardust Ballroom. Question 14 asks about party songs that 'rocked the house' and lists six classic hip-hop tracks. The page includes four QR codes at the bottom linking to some of the mentioned songs. A large pink circle with '13' appears next to the first answer, and a pink circle with '14' appears next to the second answer. The page number 151 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 152,
    "fileName": "152.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 152 contains two answered questions (15 and 16) about hip-hop music history. Question 15 asks about the first song the person could fully recite, answered as 'Rapper's Delight' by Sugar Hill Gang with historical context about its 1979 release. Two QR codes are provided for the song - one regular and one with lyrics. Question 16 asks about the top five 'illest' male artists, listing Tupac, Snoop Dogg, Run-DMC, LL Cool J and Eric B. & Rakim. The questions are numbered in magenta circles (15 and 16).",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 153,
    "fileName": "153.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page displays questions 17 and 18 with their completed answers from user @ANITA. Question 17 asks about regrets for missing concerts/events, answered that working in radio for 35+ years allowed participation in desired events with no regrets. Question 18 asks about old-school quotes still used today, answered with Eric B. and Rakim's line 'Thought I was a donut, ya tried to glaze me!' The answers are displayed in speech bubble-style boxes with circular numbered badges (17 and 18). A QR code appears at the bottom right with the caption 'Eric B. Is President'. Page number 153 is shown at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 154,
    "fileName": "154.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains questions 19 and 20 from a Hip-Hop Time Capsule book. Question 19 asks about favorite club songs, with an answer mentioning The Stardust Ballroom and Boston Road Ball Room clubs, and favorite artists including LL Cool J, Run-DMC, Eric B. and Rakim, Salt-N-Pepa, and MC Lyte. Five QR codes are displayed linking to songs: 'I'm Bad' by LLCJ, 'I Know You Got Soul' by Eric B. & Rakim, 'My Melody' by Eric B. & Rakim, 'Ruffneck' by MC Lyte, and 'Shoop' by Salt-N-Pepa. Question 20 asks about top five favorite Break Dance tracks for B-Boys, with the answer identifying 'Bongo Rock' by The Incredible Bongo Band as the top favorite and one of the most important tracks in Hip-Hop history. A QR code for 'Bongo Rock' is included. The page is numbered 154 and includes the footer '@ANITA'. The question numbers are displayed in large magenta circles.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 155,
    "fileName": "155.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 155 of the Hip-Hop Time Capsule book displaying two pre-answered questions. Question 21 asks about DJ equipment ownership with a short 'No' response accompanied by a magenta circular badge with '21' in white. Question 22 asks about experiencing violence at clubs or jams, with a longer response describing a near-riot situation at a Brooklyn Hip-Hop concert, accompanied by a magenta circular badge with '22' in white. The page shows completed responses rather than blank input fields. The username '@ANITA' appears at the bottom of the page.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 156,
    "fileName": "156.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 156 displays two questions (23 and 24) about being affected by the loss of artists. Question 23 has a circular magenta number badge '23' and a brief affirmative answer. Question 24 has a circular magenta number badge '24' positioned on the right side of the text block. The detailed answer discusses the emotional impact of losing hip-hop artists, specifically naming DJ Scott La Rock as the first significant loss in 1987, followed by Tupac, DMX, Nipsey Hussle, Young Dolph, King Von, Pop Smoke, and FBG Duck. The respondent mentions personally meeting DMX, Young Dolph, and Pop Smoke. A QR code appears in the bottom right corner, with 'DJ Scott La Rock' referenced as a link below. The page has a minimalist design with gray text boxes containing the answers.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 157,
    "fileName": "157.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 647 (line 8 column 507)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 158,
    "fileName": "158.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 655 (line 8 column 515)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 159,
    "fileName": "159.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A memorial page honoring DMX and other hip-hop legends who have passed away. The page begins with a personal reflection on DMX's death and its emotional impact on the author. Four QR codes are displayed linking to content about DMX including 'Lord Give Me A Sign', 'Praying for The Breakfast Club', 'Jay Z on DMX', and 'Juvenile and others on DMX'. The text continues with a description of the collective grief at the radio station when these legends passed. The page concludes with a purple-colored tribute 'Long Live All of Our Hip-Hop Legends!' followed by a list of names: Craig Mack, Black Rob, DJ Kay Slay, Fatman Scoop, Rich Homie Quan and DJ Clark Kent. A dove icon appears in the bottom right. The page is attributed to '@ANITA' and numbered 159.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 160,
    "fileName": "160.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 160 contains two questions (25 and 26) with completed answers. Question 25 asks about doing something kind or important for a favorite artist, with a detailed answer about helping DMX obtain an EpiPen during a radio interview at Power 105.1 with The Breakfast Club. Question 26 asks about which song lyrics the person would want to come true for a day, with a brief answer stating they can't think of any at the moment. The page includes circular magenta numbered badges (25 and 26) next to each question-answer pair. The author attribution '@ANITA' appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 161,
    "fileName": "161.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 161 shows two answered questions about Hip-Hop memories. Question 27 asks about memorable song experiences, answered with a story about 'Bailando' by Enrique Iglesias ft. Sean Paul at a front desk, with a heartfelt tribute to Sean Paul. Question 28 asks about Hip-Hop crushes, answered with admiration for Big Daddy Kane's performance style and personality. Each answer has an associated QR code linking to the mentioned songs. The answers are displayed in gray speech bubbles with magenta circular number badges (27 and 28).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 162,
    "fileName": "162.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 162 features two hip-hop questions with detailed answers. Question 29 asks about favorite New York mixtape DJs, with answer 2 listing numerous influential DJs including DJ Prostyle, DJ Clue, DJ Envy, and many others. Question 30 inquires about favorite B-Boys, with answer 30 explaining the author's appreciation for NYC Breakers (Mr. Wave, Action, Lil Lep) and Rock Steady Crew (Crazy Legs). The page includes three QR codes at the bottom linking to content about NYC Breakers, Crazy Legs, and the Beat Street movie battle at The Roxy. Pink circular badges display the answer numbers 2 and 30. The page has decorative ink blot accents.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 163,
    "fileName": "163.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question31",
        "type": "multiline",
        "label": "What record pool, if any, did you belong to?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 100,
        "multiline": true,
        "numberOfLines": 4,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question32",
        "type": "multiline",
        "label": "When you were on your way to a club, looking clean (or as we used to say) looking fresh, what were your favorite colognes, perfumes, or body oils to wear?",
        "position": {
          "top": "70%",
          "left": "10%"
        },
        "width": "80%",
        "height": 100,
        "multiline": true,
        "numberOfLines": 4,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 163 contains two questions about hip-hop culture. Question 31 asks about record pool membership, with a sample answer indicating no membership. Question 32 asks about favorite fragrances worn when going to clubs in the 'looking fresh' days, with a detailed sample answer mentioning 1980s perfumes including Sunflowers by Elizabeth Arden, Oscar de la Renta, and Chanel No. 5. The page has numbered badges (31 and 32) next to the responses, and includes the author handle @ANITA at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 164,
    "fileName": "164.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains two questions about Hip-Hop fashion and footwear (questions 33 and 34) with handwritten-style answers. Question 33 asks about favorite Hip-Hop clothing/gear and is answered in a speech bubble with a pink circular number '33' icon. The respondent mentions turtle neck sweaters and appreciation for Hip-Hop's fashion influence. Question 34 asks about sneaker and shoe preferences past and present, answered in a gray speech bubble with a pink circular number '34' icon. The respondent discusses wearing marshmallow shoes for height and high heels, now preferring comfortable flats. The page footer shows '@ANITA' and page number 164.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 165,
    "fileName": "165.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page shows questions 35 and 36 with answers. Question 35 asks about favorite party drinks then and now, with the answer in a light gray speech bubble next to a pink circular number '35'. Question 36 asks about artists who influenced views on social issues and activism, with the answer in a light gray speech bubble next to a pink circular number '36'. Three QR codes are displayed at the bottom linking to songs: 'Changes' by Tupac, 'Dear Mama' by Tupac, and 'The Bigger Picture' by Lil Baby 2020. The page number 165 and @ANITA handle appear at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 166,
    "fileName": "166.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page displays questions 37 and 38 with completed answers. Question 37 asks about artists whose life stories have inspired the respondent, with an answer about Tupac Shakur in a speech bubble numbered 37. Question 38 asks about Hip-Hop's contribution to personal growth, with a detailed response in a speech bubble numbered 38 mentioning multiple songs and artists including Queen Latifah, Boogie Down Production, KRS-One, and Tupac. The page includes a QR code at the bottom, the song title 'Self Destruction by BDP', social handle @ANITA, and page number 166.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 167,
    "fileName": "167.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 744 (line 24 column 197)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 168,
    "fileName": "168.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or ']' after array element in JSON at position 1068 (line 10 column 461)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 169,
    "fileName": "169.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a continuation page (page 169) featuring nine QR codes arranged in a 3x3 grid. Each QR code links to either social media profiles (Instagram accounts for DJ Cool Kev, Eddie Valentin, and LaToya Shanice) or music tracks by Lucky Leon Luchi and collaborators. The page includes one collaborative track 'Blood Brothers Stay Scheming' featuring CZA LINO, Lucky Leon Luchi, and Eddie Valentin. The page is credited to @ANITA at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 170,
    "fileName": "170.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 170 contains two questions with answers. Question 40 asks about inspiration for trying rap and skill rating, with a brief answer in a light gray box stating no one inspired them. Question 41 asks about meeting Hip-Hop legends, with an extensive answer describing the author's experience at iHeartMedia/Power 105.1 and providing detailed information about Lisa Glasberg (Lisa G.), a pioneering Hip-Hop radio personality who co-hosted Hot 97's morning show with Ed Lover and Dr. Dre in the 1990s. The page includes two magenta circular splash icons with numbers 40 and 41, and the author's handle @ANITA appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 171,
    "fileName": "171.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This content page displays two questions (numbered 42 and 43) with written answers about hip-hop history. Question 42 asks about Biggie versus Tupac as lyricists, with a response acknowledging Biggie's technical superiority while expressing love for Tupac. Question 43 addresses the East Coast vs. West Coast rivalry, with the respondent sharing their connection to Tupac and regret over the tragic outcome. The page includes decorative splash accent images with the number 42 and 43, and ends with the author handle @ANITA and page number 171.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 172,
    "fileName": "172.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question44",
        "type": "multiline",
        "label": "If you could have fifteen minutes with your favorite Hip-Hop legend or artist, who would it be and what would you say?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question45",
        "type": "multiline",
        "label": "If you could spend the whole day with your favorite Hip-Hop legend or artist, who would it be and what plans would you make?",
        "position": {
          "top": "70%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 172 features two related questions (44 and 45) about meeting Hip-Hop legends. Question 44 asks about spending fifteen minutes with a favorite artist, while Question 45 expands this to a whole day. The page includes two example answers: one about a meaningful encounter with DMX emphasizing his spiritual nature and humility, and another expressing fascination with Snoop Dogg and the Death Row Records era. Pink circular badges numbered 44 and 45 appear next to each question's example answer. The page is attributed to @ANITA at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 173,
    "fileName": "173.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 357 (line 8 column 214)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 174,
    "fileName": "174.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question47",
        "type": "multiline",
        "label": "What clever lines would you use to diss them?",
        "position": {
          "top": "25%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "This is page 174 of a Hip-Hop Time Capsule book featuring two questions. Question 47 asks for clever diss lines with a humorous response saying the author will need time to think. Question 48 asks about funny/embarrassing memories with a detailed answer about sliding down poorly-built stairs in The Bronx in the 1990s. The page includes two circular numbered badges (47 in magenta, 48 in magenta) marking each question. The footer shows '@ ANITA' and page number 174.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 175,
    "fileName": "175.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A humorous story continuation page describing an incident where the narrator and Sunni slid down uneven stairs while holding Lancers Ros wine. The page includes the title 'Continued...' at the top, a text block with the story content in the center, and author attribution '@ANITA' with page number '175' at the bottom. The story highlights 'Hip-Hop' in bold and describes a comical scene involving a cab driver and the narrator's brother Hilton who both found the incident hilarious.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 176,
    "fileName": "176.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page is a continuation featuring a personal story about a lifelong friendship. It includes a 'Fun Facts' section detailing the author's childhood friendship with Sana in Harlem, NY, including specific addresses and school details. A note clarifies that this story occurred over 40 years ago, mentioning the change from Sunni Burke Hayes to Sana Shabazz, and noting both friends are now religious ministers. The page includes three photos: one of Sana Shabazz as an adult wearing white head covering in a decorative frame, and two childhood photos of the friends. The page is signed by @ANITA and numbered 176.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 177,
    "fileName": "177.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 531 (line 11 column 224)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 178,
    "fileName": "178.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 613 (line 8 column 479)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 179,
    "fileName": "179.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A content page featuring personal stories about encounters with Ne-Yo and Jay Z. The page includes a title 'Ne-Yo' at the top, followed by a detailed story about Ne-Yo bringing roses to the author on Valentine's Day. The middle section contains two images: a professional photo of Jay Z on the left and a casual photo with Ne-Yo on the right, with text between them explaining the author doesn't have a photo with Jay Z. Below the images is a story about meeting Jay Z in the lobby with fans and his gracious behavior. The page includes well-wishes to Jay Z and his family at the bottom, the author's handle '@ANITA', and page number 179.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 180,
    "fileName": "180.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question51",
        "type": "multiline",
        "label": "What, if any, is the best advice that a Hip-Hop legend or artist has ever given you?",
        "position": {
          "top": "68%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 180 featuring personal stories about gifts from Snoop Dogg (a Baby Powder scented candle from his Broadus Family Collection) and Rick Ross (multiple cases of Belaire and Bumbu Rum). Includes a product image of the Broadus Family Collection candle and four photos showing various bottles and gift boxes of luxury spirits. Question 51 asks about the best advice received from a Hip-Hop legend, with the answer about staying true to oneself. The page has a white/cream background with black text and includes emotional expressions of missing both artists.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 181,
    "fileName": "181.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a content page from a Hip-Hop Time Capsule interview book featuring two questions (52 and 53). Question 52 asks about humorous stories involving favorite artists and includes a detailed anecdote about DMX on his birthday, describing how he came in for an interview while celebrating, asked for prayers, and later was seen buying hotdogs for everyone near a neighborhood hotdog stand in his characteristic raspy voice. Question 53 addresses the role of women in early Hip-Hop and their contributions to the genre through themes of feminism, gender equality, and social justice. The page includes a large magenta circular badge with '52' and the footer shows '@ANITA' and page number 181.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 182,
    "fileName": "182.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page continues from previous content and includes Fun Fact #53 about two sisters who created 'Somebody Say Ho' and worked with Grandmaster Flash and The Furious Five. Features a personal story about meeting Lil Debbie through Van Silk. Contains two photos: one selfie with Lil Debbie and one of a building where Grandmaster Flash lived. Includes a QR code for a video about the origin of 'Somebody Say Ho.' Questions 54 and 55 ask about favorite and 'baddest' women artists in Hip-Hop and R&B, with answer 54 listing Queen Latifah, Salt-N-Pepa, MC Lyte, Sha-Rock, Roxanne Shante, Lauryn Hill, Missy Elliott, Eve, TLC and Remy Ma.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 183,
    "fileName": "183.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 183 showing the continuation of question 55 and question 56 with detailed answers. Question 55 asks about favorite female Hip-Hop and R&B artists, answered with Mary J. Blige, Beyonce, Lauryn Hill, and Faith Evans, with QR codes linking to their songs. Question 56 asks about favorite male Hip-Hop and R&B artists, with an extensive list including Will Smith, Snoop Dogg, Tupac, LL Cool J, and many others, ending with a tribute to deceased legends. Five QR codes at the bottom link to songs by Will Smith, French Montana, Bell Biv Devoe, Naughty By Nature, and M.C. Hammer. A dove icon appears near the tribute text. The page number 55 appears in a pink circle at the top right, and 56 in a pink circle on the left side.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 184,
    "fileName": "184.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is question 57 in the Hip-Hop Time Capsule book. The page features five QR codes at the top linking to classic hip-hop songs including 'Ice Ice Baby' by Vanilla Ice, 'Doo Wop' by DaBaby, 'Jump Around' by House of Pain, 'Look Back At It' by A Boogie Wit The Hoodie, and '3rd Bass-Brooklyn-Queens'. The question asks whether the respondent chose a career in rap or hip-hop and how they're contributing, or what they're doing instead. The answer section contains a detailed response from someone named Anita who worked as a receptionist at iHeartMedia in NYC, including Power 105.1, where she met numerous music legends over her 35-year radio career. A pink splash accent appears on the right side with the number 57.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 185,
    "fileName": "185.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 185 continues a narrative about meeting country music legends (Dolly Parton, Emmy Lou Harris, George Jones, Willie Nelson, Randy Travis, Garth Brooks, Waylon Jennings) and working at WPLJ-FM. Question 58 asks about challenges faced in a Hip-Hop career, with a detailed answer about staying calm around Hip-Hop legends while working at iHeartMedia for twenty years. Question 59 asks about supportive family members or friends. A large decorative microphone icon with the number '58' appears on the left side of the answer text.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 186,
    "fileName": "186.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 186 describes the author's retirement from iHeartMedia and the elaborate retirement party organized by colleagues and friends. The page details the committee members who organized the event, including executives like Thea Mitchem, Tom Cuddy, Scott Hopeck, Jim Kerr, and Elvis Duran. It lists other party planners including Danielle Delillo, Nicole Wendel, Jamie Megargee, and others. The author expresses gratitude for the love and support received over 35 years, noting how her granddaughter Gayla witnessed this appreciation. A reference is made to 'Hip-Hop Time Capsule: The Next Chapter' where pictures from the party will be shared. The page ends with question 60 about overcoming challenges. A magenta/pink circular badge with '59' appears on the right side of the page.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 187,
    "fileName": "187.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 316 (line 14 column 51)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 188,
    "fileName": "188.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 188 contains two questions (62 and 63) with detailed responses. Question 62 asks about Hip-Hop's influence on views of diversity and inclusion, with an answer highlighting the global impact of Hip-Hop culture. Five QR codes are shown as examples of international Hip-Hop from Indian, Palestinian, Japanese, and Pakistani artists. Question 63 asks about songs that helped shape identity, with an answer about using Hip-Hop's raw energy to process anger. Four QR codes link to songs by DMX, Grandmaster Flash and The Furious Five, and Ludacris. The responses are marked with circular badges numbered 62 and 63.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 189,
    "fileName": "189.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 189 of a Hip-Hop Time Capsule book showing responses to questions 64 and 65. Question 64 asks about storytelling in Hip-Hop and whether the respondent has written their own stories. The answer emphasizes storytelling as integral to Hip-Hop, expressing struggles and building connections. Question 65 asks about Hip-Hop bringing the community together. The answer describes a tradition in the Bronx neighborhood (Allerton Ave and White Plains Rd.) where DJs would throw 'home-going' parties for deceased community members, and mentions Hispanic friends breakdancing, rapping, and DJing in parks. Both answers are displayed in rounded gray boxes with pink circular question number badges. The page is attributed to '@ANITA' at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 190,
    "fileName": "190.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 190 contains questions 66 and 67 with detailed answers. Question 66 asks about Hip-Hop's influence on community activism, answered with a 'No' explaining spiritual motivation instead. Question 67 asks about favorite aspects of the Hip-Hop generation, with an extensive answer celebrating pioneers, particularly Bobby Robinson, a record producer and family friend. The answer includes biographical information about Bobby Robinson (1917-2011), his record shops, labels like Enjoy Records, and his crucial role in early Hip-Hop history. The page features two magenta splash-icon decorative elements - one near question 66's answer box and one larger one near question 67.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 191,
    "fileName": "191.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 1255 (line 25 column 639)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 192,
    "fileName": "192.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 192 features question 70 about Dirty South artists' contributions to Hip-Hop. The page includes a photo with Drea O at a Charlamagne-hosted event, a quote from Anela Scorpio about Chicago talent and hope for peace, and an update box about Lil Durk's arrest. The answer lists numerous Dirty South artists including T.I., Rick Ross, Lil Wayne, 2 Chainz, and others. Four QR codes at the bottom link to songs: 'B.M.F.' by Rick Ross ft. Styles P, 'I'm Different' by 2 Chainz, 'Swing Ya Rag' by T.I., and 'Get Low' by Lil Jon & The East Side Boyz featuring Ying Yang Twins. There's also a 'Way Up with Angela Yee' logo visible.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 193,
    "fileName": "193.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Content page 193 featuring two Hip-Hop related questions with detailed answers. Question 68 asks about favorite Hip-Hop karaoke song with answer 'It Takes Two' by Rob Base and DJ EZ Rock, accompanied by a QR code for lyrics. Question 69 receives an extensive response about how Hip-Hop led to exploration of Chicago Drill music, discussing artists like FBG Duck, King Von, Lil Durk, J Mane, Tay Savage, Tay Capone, Polo G, and journalist Drea O. A significant update from October 24, 2024 notes Lil Durk's arrest for murder-for-hire plot. The page includes numbered badge icons (68 and 69) in magenta/pink, splash accent decorations, QR codes, and demonstrates deep engagement with Chicago hip-hop culture and its social context.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 194,
    "fileName": "194.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question71",
        "type": "multiline",
        "label": "71. Who are (or were) your favorite West Coast artists?",
        "position": {
          "top": "20%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question72",
        "type": "multiline",
        "label": "72. Do you believe that Hip-Hop has promoted positive change in the world? If so, how?",
        "position": {
          "top": "65%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 194 contains two Hip-Hop questions with example answers and QR codes. Question 71 asks about favorite West Coast artists, with an example answer listing Tupac, Snoop Dogg, Ice Cube, Dr. Dre, and others including Kendrick Lamar. Four QR codes are displayed with song titles underneath: 'No Limit' by G-Eazy, 'Colors' by Ice Tea, 'The Next Episode' by Dr. Dre ft. Snoop Dogg, and 'Straight Outta Compton' by N.W.A. Question 72 asks if Hip-Hop has promoted positive change in the world, with an example answer affirming it has through cultural expression, social commentary, community empowerment, fashion, and economic impact. The page is credited to @ANITA at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 195,
    "fileName": "195.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a response page showing answers to questions 73 and 74 about artists who have positively and negatively impacted Hip-Hop. Question 73's answer is displayed in a light gray rounded box with the number '73' in a magenta circle on the right. The respondent lists Common, Kendrick Lamar, J. Cole, Drake, and Big Sean as positive influences. Below are four QR codes linking to specific songs by these artists. Question 74's answer appears in another light gray box with '74' in a magenta circle on the left, discussing Drill Music as over-hyped while acknowledging exceptions from Chicago artists like Polo G, G Herbo, and others. Five QR codes are shown below linking to songs by these artists. The page includes song titles with artist names beneath each QR code, and is attributed to 'ANITA' at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 196,
    "fileName": "196.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 196 features question 75 about Hip-Hop songs that match energy during frustrating times. The page includes promotional content for Prince Dre with a crown icon, multiple QR codes linking to his book 'Surviving O Block: The Streets Don't Love You', Instagram, and various song references. There's a testimonial quote from Anita Scipio endorsing Prince Dre's book. The answer lists specific songs including 'Everything Tonight' by Pitbull ft. Ne-Yo, 'How Ya like Me Now' by Kool Moe Dee, 'They Don't Give A F*** About Us' by Tupac, and 'Now That We Found Love' by Heavy D & The Boyz. Nine QR codes are displayed throughout the page linking to various resources and songs mentioned.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 197,
    "fileName": "197.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 76 asks about local/state artists and DJs who contributed to Hip-Hop. The answer lists numerous artists from New York state. The page features a detailed spotlight on Ed Lover, his role as MTV Yo! MTV Raps co-host, and his contribution to bringing Hip-Hop to mainstream television. The number 76 appears in a pink circle. Three QR codes at the bottom link to Ed Lover content: his signature dance, a Breakfast Club interview, and his Expert Opinion show.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 198,
    "fileName": "198.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page dedicated to Ed Lover, written by Anita Scipio. The page contains a heartfelt testimonial about working with Ed Lover at Power 105.1 and attending his comedy shows at Carolines Comedy Club. It includes two photographs: one from about sixteen years ago showing Dana, Ed Lover, and Anita, and another more recent photo. The page notes that Ed is currently hosting The Ed Lover Experience on 94.7 The Block (WXBK-FM) in New York, Monday through Friday from 7pm-10pm. Page number 198 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 199,
    "fileName": "199.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 199 contains questions 77 and 78 with pre-filled answers. Question 77 asks about favorite beatbox artists, with the answer naming Doug E. Fresh, Biz Markie, and The Fat Boys, accompanied by three QR codes for music samples. A definition of beatboxing is provided. Question 77 appears in a circular magenta badge. Question 78 asks about the most sampled artist, with the answer identifying James Brown and providing definitions of sampling and historical context. Question 78 also appears in a circular magenta badge. The page has a clean, educational layout with definitions marked by asterisks.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 200,
    "fileName": "200.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question79",
        "type": "multiline",
        "label": "What rapper, if any, influenced you to become, or want to become, a rapper? How?",
        "position": {
          "top": "22%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      },
      {
        "id": "question80",
        "type": "multiline",
        "label": "Like Mt. Rushmore, if there were a Mt. EASTmore of Hip-Hop, who would you choose?",
        "position": {
          "top": "55%",
          "left": "10%"
        },
        "width": "80%",
        "height": 120,
        "multiline": true,
        "numberOfLines": 5,
        "placeholder": "Tap to answer..."
      }
    ],
    "description": "Page 200 contains two questions (79 and 80) with pre-filled example answers displayed in rounded rectangular text boxes. Question 79 asks about rapper influences with a negative response shown. Question 80 asks about creating a Mt. Rushmore of East Coast Hip-Hop, with an answer listing LL Cool J, DMX, Jay Z, and Biggie, noting that LL Cool J and DMX selections appear elsewhere. At the bottom are four QR codes linking to classic hip-hop songs by Jay-Z and The Notorious B.I.G. The page uses pink circular number badges (79 and 80) to mark each question.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 201,
    "fileName": "201.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 201 displays two completed questions about Mt. Rushmore-style Hip-Hop monuments. Question 81 asks about a Mt. WESTmore of Hip-Hop, answered with Tupac, Snoop Dogg, Ice Cube, and Dr. Dre. Four QR codes link to related songs. Question 82 asks about a Mt. Ladies-Onlymore of Hip-Hop, answered with Queen Latifah, Salt-N-Pepa, and Missy Elliot, with three QR codes linking to their songs. The answers are presented in speech bubble-style callouts with circular numbered badges (81 and 82 in magenta).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 202,
    "fileName": "202.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 202 features Question 83 asking about local DJs who made the biggest impact on Hip-Hop. The response includes a comprehensive list of influential New York-based DJs including Grandmaster Flash, Ed Lover, DJ Marley Marl, DJ Clark Kent, and others. The author then shares a personal tribute to DJ Kut, describing their friendship during their time at Power 105.1 and DJ Kut's exceptional showmanship at Caroline's Comedy Club. The page includes a circular pink badge with '83' in white, a handwritten-style signature reading 'Love ya Buddy! - Anita', and a quote from DJ Kut: 'Health is Wealth.' The page number 202 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 203,
    "fileName": "203.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 203 features two questions (84 and 85) with their answers. Question 84 asks about favorite DJ songs at a club, answered with 'I was a never a DJ.' Question 85 asks about the first official Hip-Hop love song, answered with detailed information about LL Cool J's 'I Need Love' from 1987. The answer includes extensive fun fact research explaining the historical significance of the song as a groundbreaking moment in Hip-Hop that introduced vulnerability and romance to the genre. The page includes two pink circular badges with numbers 84 and 85, a QR code at the bottom linking to 'I Need Love', and the page number 203 with '@ANITA' credit at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 204,
    "fileName": "204.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 204 features two questions with answers. Question 86 asks about favorite Hip-Hop love songs, with a brief response stating there are none. Question 87 asks about favorite women artists in Hip-Hop, with a detailed answer naming Sha-Rock, Roxanne Shante, Angie Stone, Cardi B, Young M.A, and GloRilla. An extensive footnote provides historical context about Angie Stone's contribution to Hip-Hop through The Sequence, including their pioneering role as one of the first female rap groups and their 1979 hit 'Funk You Up.' The note ends with a tribute acknowledging Angie Stone's passing on March 1, 2025. At the bottom are four QR codes linking to songs by the mentioned contemporary artists. A thank you note credits DJ SCIPIO for sharing insight about Angie Stone.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 205,
    "fileName": "205.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 205 contains questions 88 and 89 about music playlists and graffiti artists. Question 88 asks what's on the person's playlist, with an answer listing several hip-hop songs by Redman, LL Cool J ft. Eminem, DaBaby, and Eminem. Five QR codes are included to access the mentioned songs. A fun fact explains how Power 105.1 introduced them to 'I Am Blessed', the only song they don't breakdance to. Question 89 asks about favorite graffiti artists. The answer mentions Blade, a prominent artist on Bronx #2 trains, noting they don't have a current favorite. A definition of graffiti and its connection to Hip-Hop culture in the 1970s-1980s is provided. A breakdancer illustration appears with a boombox.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 206,
    "fileName": "206.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 206 of a Hip-Hop Time Capsule book featuring two questions about the Drake and Kendrick Lamar beef. Question 90 asks what ignited the legendary beef, with a response in a black circular badge (numbered 90) stating the responder wasn't up on what started it but became engaged when it made headlines. Question 91 asks how it impacted perception, with a response in a pink circular badge (numbered 91) explaining that Kendrick's 'Not Like Us' changed their perception of Drake, though they still enjoy Drake's work, particularly 'Started From The Bottom' and '0 To 100/The Catch Up.' Two QR codes at the bottom link to these Drake songs. The page is credited to @ANITA.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 207,
    "fileName": "207.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 207 displays two answered questions about the Drake vs. Kendrick Lamar diss track battle. Question 92 asks about memorable lyrics from diss tracks, with the response noting that Drake's tracks weren't memorable but highlighting Kendrick's lyrics mentioning Future, 21 Savage, Quavo, and Atlanta history. Question 93 asks who won, with the answer declaring Kendrick Lamar the winner based on 'Not Like Us.' Two QR codes are present linking to 'Family Matters' by Drake and 'Not Like Us' by Kendrick Lamar. The responses are shown in gray boxes with magenta circular number badges (92 and 93). The page footer shows @ANITA.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 208,
    "fileName": "208.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains two questions (94 and 95) with their corresponding answers. Question 94 asks about whether inner-circle opinions matched the respondent's views, with a short affirmative answer 'Yes, it did!' displayed in a light gray bubble next to a magenta circle with '94'. Question 95 asks about rivalries in Hip-Hop culture, with a longer, detailed response discussing the Drake and Kendrick beef, displayed in a light gray text bubble next to a magenta circle with '95'. The page is numbered 208 with '@ANITA' at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 209,
    "fileName": "209.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 209 of a Hip-Hop Time Capsule book featuring two Q&A entries. Question 96 asks about iconic beefs in Hip-Hop, with a detailed answer listing historic rivalries including Kool Moe Dee vs Busy B, Jay-Z vs Nas, 50 Cent vs Ja Rule, Tupac vs Biggie, and Drake vs Kendrick Lamar. Question 97 asks about breaking news that changed perception of an admired artist, with an answer about Diddy and a hotel video incident. The page includes two large circular magenta numbered badges (96 and 97) positioned on the left and right sides respectively. The footer shows '@ANITA' and page number 209.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 210,
    "fileName": "210.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 210 contains questions 98 and 99 with completed answers. Question 98 asks about artists representing both old-school and new-school Hip-Hop, with a comprehensive list of artists provided including Snoop Dogg, LL Cool J, 50 Cent, Fat Joe, Method Man, Lil Wayne, Maino, Sean Paul, Eminem, Common, Jeezy, Two Chains, Jadakiss, Nas, Fabolous, Nelly, Chuck D and Flava Flav. Question 99 asks about the fan's role in contributing to Hip-Hop culture, with the answer describing contributions through attending concerts, buying CDs, and showing love to Hip-Hop artists and legends. Five QR codes are displayed linking to songs: 'Paradise (Freestyle)' by Fabolous, 'Forgive Me' by Maino, 'Paradise' by Fat Joe/Anitta/DJ Khaled, 'I Might Forgive... But I Don't Forgive' by Jeezy, and 'Hot in Herre' by Nelly. The responses are numbered 98 and 99 in circular magenta badges.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 211,
    "fileName": "211.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Final question page (100) with a comprehensive answer about attending The Hip-Hop 50 Live event at Yankee Stadium on August 11, 2023. The response describes the realization of being Hip-Hop through experiencing unity, joy, and celebration with tens of thousands of diverse fans celebrating Hip-Hop's 50th anniversary. Features a large magenta circle with '100' and gray text box containing the full narrative response.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 212,
    "fileName": "212.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A personal narrative page describing the author's experience at a Hip-Hop concert with family members. The page concludes with the revelation 'I AM HIP-HOP!' The author reflects on multiple generations enjoying the music together, their connection to Hip-Hop culture, and memories of family members. The page is labeled as 'Continued...' at the top and includes the author attribution '@ANITA' and page number 212 at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 213,
    "fileName": "213.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: 400 {\"type\":\"error\",\"error\":{\"type\":\"invalid_request_error\",\"message\":\"messages.0.content.0.image.source.base64: image exceeds 5 MB maximum: 5423116 bytes > 5242880 bytes\"},\"request_id\":\"req_011CWNNh5yBDhGdZdxHVL3gS\"}",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 214,
    "fileName": "214.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Photo collage page featuring four images from the Hip-Hop 50 Live Concert at Yankee Stadium. The top two images show wide views of the stadium filled with crowds under purple and red lighting. The bottom two images show silhouettes of attendees (Daughter Arlene and Niece Denise on the left, Cool Kev and Melvin on the right) watching the concert from elevated seats. Two QR codes are present at the bottom corners. The page highlights Doug E. Fresh as the most unique performance of the event. Page number 214 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 215,
    "fileName": "215.png",
    "type": "title",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a title page for a section dedicated to documenting thank-yous related to someone named Anita. The page features bold, stylized yellow text at the top reading 'HIP-HOP TIME CAPSULE' with a 3D effect. Below that is pink text stating 'Document Your Personal Journey'. The center features a large pink starburst or badge shape with torn white edges, containing the text 'ANITA \"THANK-YOUS\"' in bold yellow letters with black outline. The background is predominantly purple with blue gradient effects and paint splatter decorative elements. The page number 215 appears at the bottom. The design aesthetic is vibrant and street art-inspired, consistent with hip-hop culture.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 216,
    "fileName": "216.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A heartfelt tribute page dedicated to Misael A. Nunez. The page features a centered photograph showing two people (presumably Mama and Misael) standing in front of an iHeart Media backdrop with the red and white logo visible. The woman is wearing a blue top and the man is wearing a dark blue hoodie. Below the photo is an emotional message expressing gratitude for Misael's support, belief, creative insights, patience, and dedication throughout what was described as a challenging project. The tribute is signed by 'Mama' and DJ SCIPIO, acknowledging Misael as a rock, cheerleader, and invaluable collaborator. The page is numbered 216.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 217,
    "fileName": "217.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Dedication page with two sections. First section titled 'My Dear Hubby' with decorative diamond accent and lines, expressing gratitude to Rodney for his love and unwavering support during the creation of this journal/book. Second section titled 'My Blessed Family' with similar decorative accent, thanking all family members for their love and support, with specific shout-outs to sister Debbie, brother-in-law Isaac Daniels (Foxx), Ray, goddaughter Paula Hampton, and the Scipio family members in the States and England. Page number 217 appears at bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 218,
    "fileName": "218.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A dedication or acknowledgment page addressed to Thea Mitchem, Executive Vice President of Programming for iHeartMedia's Northeast Division and Program Director of Power 105.1 NYC. The page features purple text for the name at the top, a decorative gold divider with a heart icon in the center, and a heartfelt thank you message from Anita. The message expresses gratitude for various professional courtesies, a memorable retirement party, post-retirement opportunities, and support with a book project. The message is signed 'Love always, Anita' in purple script at the bottom. Page number 218 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 219,
    "fileName": "219.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A special thanks/dedication page featuring a heartfelt message to the author's family and friends. The page has a title 'SPECIAL THANKS TO:' at the top with a decorative gold arrow divider underneath. Below the main text is the word 'love' in pink script font with an arrow through it. The bottom portion contains six personal photographs showing the author with the mentioned individuals - three photos in the top row and three in the bottom row. The page number 219 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 220,
    "fileName": "220.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page is a dedication and acknowledgment page featuring the iHeartMedia logo at the top. It expresses gratitude from someone named Anita who worked as a receptionist. The page lists seven radio stations and shows, followed by four key executives and their titles at iHeartMedia. The page opens with a proud statement about being a receptionist and closes with a heartfelt thank you message for memories and friendships. The page number 220 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 221,
    "fileName": "221.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 221 features a tribute to Angela Yee and Dan Greene. The page includes two main sections with photos and text. The top section shows a photo of Miss Anita with Angela Yee in Angela's 'Way Up with Angela Yee' studio, with the 'Way Up with Angela Yee' logo shown separately. Miss Anita expresses her gratitude for Angela's kindness and generosity over the years, congratulating her on her award-winning show. The bottom section features a photo of Miss Anita with Dan Greene, the Executive Producer of the show, whom she refers to as her 'dear son.' She expresses her deep affection for him and wishes him and Rida happiness. The page includes decorative 'Congratulations!' text in gold script and ends with a note promising more content about her bond with Angela Yee.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 222,
    "fileName": "222.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 306 (line 9 column 88)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 223,
    "fileName": "223.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 223 features three photographs from what appears to be the Breakfast Club radio show. The top image shows three people posing together in front of a blue branded backdrop. The bottom left image shows two people in a closer selfie-style photo. The bottom right image shows a person seated in an ornate gold and white throne-style chair. The page references the author's stories about their Breakfast Club/Power 105.1 family that will be shared in 'Hip-Hop Time Capsule: The Next Chapter.'",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 224,
    "fileName": "224.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Dedication page addressed to DJ Envy and Charlamagne Tha God. The author 'Mama' expresses heartfelt gratitude for their support and influence. Features a personal anecdote about DJ Envy's 'Be Fearless' advice regarding artist Mark Borino, and mentions how Charlamagne's book 'Get Honest Or Die Lying' inspired bolder self-expression. The page has a decorative divider line with a diamond accent under the title, and is signed 'Love, Mama' at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 225,
    "fileName": "225.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page featuring messages to three members of The Breakfast Club team: Jess Hilarious, Loren LoRosa, and Morgan. The page includes a photo of two smiling women (one in yellow, one in white) in the upper left corner. Decorative gold and white balloons appear at the top of the page. The messages are separated by pink divider lines with diamond accents. The first message congratulates Jess on her daughter's birth and praises her as a team member. The second congratulates Loren on being a valued team member and commends her friendship with Jess. The third is a brief message to Morgan praising her Front Page News segments.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 226,
    "fileName": "226.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a gratitude page featuring three photos of the author with people she refers to as her hip-hop 'children' and celebrity co-workers. The page includes a selfie with Taylor Hayes (nicknamed 'Little One'), a photo with DJ Stacie Spins outdoors, and a photo with Sym Symma against a red background. All photos show warm, familial relationships between the subjects.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 227,
    "fileName": "227.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A photo collage page featuring four personal photographs showing the author with various people she considers family. The page includes two photos at the top showing restaurant/dining settings with red ambiance lighting, and two photos at the bottom showing more formal event settings. Each photo is labeled with an affectionate caption referring to the people as 'son' or 'daughters' in quotation marks, suggesting close familial-type relationships with non-biological family members. Page number 227 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 228,
    "fileName": "228.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or ']' after array element in JSON at position 181 (line 9 column 17)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 229,
    "fileName": "229.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or ']' after array element in JSON at position 209 (line 10 column 17)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 230,
    "fileName": "230.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a photo gallery page featuring four images arranged in a 2x2 grid. Top left shows a woman in pink with someone labeled as 'My Dear \"Son\" AJ'. Top right shows a woman with someone holding a book, labeled 'My Dear \"Son\" Eddie F.' Bottom left shows the woman at iHeartMedia holding a colorful children's book with the caption 'Back Home At iHeartMedia'. Bottom right shows the same woman at the iHeart Radio Breakfast Club set, holding the same book with the caption 'I love iHeartMedia'. The page number 230 appears at the bottom center. The woman appears consistently in all photos wearing professional attire and displaying her book. The iHeartMedia photos show branding including the 'BREAKFAST CLUB' logo and various props including a basketball and books in the background.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 231,
    "fileName": "231.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains two testimonial entries about the author from people close to them. The first is from 'Taylor, aka Little One' who shares an emotional tribute to 'Mama,' describing their close relationship and how Taylor would always find Mama to say goodbye before leaving work, whether at the front desk, cafeteria, or nearby lunch spots. The testimonial ends with 'Love you, Little One. Forever, Mama.' The second testimonial begins from 'DJ STACIE SPINS AKA Daughterspins' who describes the author as their 'wild unpredictable child' and oldest, who enjoys intellectual and emotional conversations over Chipotle. The page is numbered 231.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 232,
    "fileName": "232.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 740 (line 12 column 80)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 233,
    "fileName": "233.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains heartfelt testimonials and tributes from workplace colleagues who have developed family-like bonds. The page features three main sections: David's message to his 'son' with a QR code linking to Insider Radio.com and a photo of a smiling man in a red polo shirt and glasses; Maria's tribute to her 'daughter' Maria discussing their teamwork at the front desk handling ticket and prize contest winners; and Kaitlyn's longer reflection on meeting her sweetheart 'daughter' after the pandemic, describing the 'Three Musketeers' (Kaitlyn, Maria, and David) who worked in the promotions and prize department. The testimonials emphasize themes of chosen family, workplace relationships, and the significance of being called 'Mama' as a term of endearment and respect.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 234,
    "fileName": "234.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 246 (line 11 column 50)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 235,
    "fileName": "235.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is page 235 of the acknowledgments section from a Hip-Hop Time Capsule book. The author (who signs as 'Mama') expresses gratitude to several people. She thanks Nyla for introducing her to the phrase 'It's all love.' She gives extensive thanks to Eddie F, the Executive Producer, for his emotional support, advice, and friendship during challenging times at reception, including their shared snack times. She also thanks Marchelle (Hi Marchelle) for support with her book. The author then acknowledges Brandon, whom she calls her 'son,' expressing how much she misses their conversations and his daily hugs. Finally, she begins thanking Nick, another person she calls 'son,' but the acknowledgment appears to continue on the next page. The tone is warm, personal, and filled with affection, using terms of endearment like 'Mama' and 'son' throughout.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 236,
    "fileName": "236.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 236 continues Miss Anita's testimonials about former interns/mentees. Contains three sections: a conclusion about Nick (discussing their daily discussions and his journey from intern to department head), a testimonial about Radio Big Mac/Corey (describing their first meeting, his hard work and charming personality, and seeing him at iHeart events and on Wild N' Out with Nick Cannon), and the beginning of a testimonial about Maurice Mitchell/Moe Mitchell (describing him as a 'son', their fun times at Reception, and his dream of being a comedian). The text is cut off mid-sentence at the bottom of the page.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 237,
    "fileName": "237.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page (237) contains two heartfelt testimonials from 'Mama' to 'Son'. The first testimonial describes the son's journey to becoming a comedian, his declaration of 'Mama, I'm a comedian', his tireless work ethic, and his current success as a member of The Bert Show cast at Q99.7 in Atlanta. The closing expresses deep love and pride. The second testimonial is from 'Ty' addressing 'Son', reflecting on their shared memories at Reception, thanking him for the honor of officiating his marriage to Amanda, celebrating their ten-year marriage and son Rahmie, and expressing gratitude for their relationship. Both messages are emotional, deeply personal, and express pride in the son's accomplishments and family life. The text is formatted with purple/blue highlighting for the closing messages.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 238,
    "fileName": "238.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains heartfelt tribute messages from Miss Anita to three prominent figures in Hip-Hop radio: DJ Redde (whom she calls her 'son'), DJ Prostyle, and Angie Martinez ('The Voice of New York'). Each tribute expresses gratitude for their support, kindness, and contributions to her life. The DJ Redde tribute celebrates his success at the Breakfast Club studio. The DJ Prostyle section includes memories of birthday parties, Caramel Frappuccinos, and his family, with a postscript acknowledging his current work at iHeartMedia's 103.5 KTU while shouting out their Power 105.1 days together. The Angie Martinez tribute begins at the bottom of the page, thanking her for years of support and remembering beautiful flowers received on Receptionist Day. The page number 238 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 239,
    "fileName": "239.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 850 (line 8 column 697)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 240,
    "fileName": "240.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 240 contains heartfelt testimonials from four DJs about a person who has achieved success in Hip-Hop. DJ Scenario ('Mama') recalls him as a man of few words who showed love and respect. DJ Whutever reminisces about front desk conversations where he shared his dreams of having a flexible DJ career without being boxed in, and celebrates his current success playing at stadiums. DJ Norie fondly remembers his warmth and kindness. DJ Will begins describing him as a great friend who supported his granddaughter Gayla's business. Each testimonial ends with a personalized message of love and best wishes, signed by the authors. The testimonials highlight themes of ambition, kindness, friendship, and achieving dreams in the Hip-Hop industry.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 241,
    "fileName": "241.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 241 continues the acknowledgments section with heartfelt personal messages to three individuals: DJ Will (thanking him for his kindness, food, and support with a humorous subliminal message joke), Eli (thanking her 'son' for his love, kindness, and support for her book), and DJ Suss One (praising his humor, friendship, help with her book, and describing meeting Sherri Shepard backstage at her show). Each message is signed with 'Love, Anita' and portions are styled in purple/bold text.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 242,
    "fileName": "242.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 626 (line 17 column 35)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 243,
    "fileName": "243.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 350 (line 8 column 222)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 244,
    "fileName": "244.png",
    "type": "input-page",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a section divider page for a Hip-Hop Time Capsule journal. The page features a vibrant purple and pink gradient background with a torn paper effect revealing a bright pink star-burst shape in the center. The top displays 'HIP-HOP TIME CAPSULE' in bold gold/yellow graffiti-style lettering with black outline. Below that is the subtitle 'Document Your Personal Journey' in white text with a pink glow effect. The center contains a large pink multi-layered star shape with the text 'ANITA AKA \"MAMA\" \"SHOUT-OUTS\"' in the same gold/yellow graffiti style. The page includes decorative paint splatter accents. The page number 244 appears at the bottom. This page introduces a section dedicated to giving recognition and appreciation to someone named Anita, known as 'Mama'.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 245,
    "fileName": "245.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a shout-out/acknowledgments page featuring two separate tributes. The first acknowledges Banker.ock@dhamarseno for creating graffiti illustrations and the book cover, with a QR code linking to their work. The second acknowledges Ash Cash Exantus, author of 'BOOK RICH: How to Create a Fortune as a Self-Published Author,' for his guidance and inspiration during the book writing process. His appearances on The Breakfast Club and Earn Your Leisure podcasts are specifically mentioned. A QR code links to his 'Earn Your Leisure' content. Both shout-outs are presented with golden ribbon banner graphics containing the text 'SHOUT-OUT' in blue letters.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 246,
    "fileName": "246.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 246 contains two shout-outs to Hip-Hop pioneers. The first honors Ralph McDaniels, creator of Video Music Box (1983), highlighting his role in documenting and showcasing emerging Hip-Hop artists. The second celebrates Van Silk, a legendary Hip-Hop promoter (1978-1984) who discovered and promoted early acts including Dougie Fresh, The Force MCs, and Grandmaster Flash & the Furious 5. Van Silk promoted over 100 shows across NYC venues and later created the first Hip-Hop pay-per-view concert series 'Rapmania' and 'Sisters in The Name of Rap' (1989-1991). The page includes QR codes and social media handles for both figures, with golden ribbon banner decorations for each shout-out section.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 247,
    "fileName": "247.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a shout-outs/acknowledgments page titled 'NEXT LEVEL SHOUT-OUTS' decorated with two gold heart chain icons at the top. The page contains two columns of names listing individuals and families being acknowledged or thanked. The names include a diverse group of people, some with family designations. The page number 247 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 248,
    "fileName": "248.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains 'Next Level Shout-Outs' acknowledgments, featuring two columns of names thanking various individuals and families. The page is decorated with gold heart icons with chains at the top corners. At the bottom is a special shout-out message to Power 105.1 Music Day Family signed by Anita. The page number 248 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 249,
    "fileName": "249.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A business shout-outs page featuring testimonials for four local businesses: Doc's Cake Shop (praised for cakes and pies, especially red velvet), Custom Candle Co. (thanking Marcie for thoughtful candle gifts), Lex Restaurant (thanking Big Steve for excellent service and chicken parm), and Coleman Chauffeur Service (praising Brian Coleman's attention to detail). Each business listing includes QR codes and logos. The page header emphasizes these are NOT SPONSORED endorsements. Page number 249 appears at bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 250,
    "fileName": "250.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page honoring officers from the 52nd Precinct. The page features four community engagement photos: top left shows Inspector Jeremy holding a child, top right shows Officer Gonzales interacting with a young girl at what appears to be a food distribution event, bottom left shows a group photo with officers and community members including children in front of pink balloons, and bottom right shows Officer Boland with a child holding what appears to be a backpack. The title is styled in purple text with decorative pink gradient lines extending from both sides and a diamond accent in the center. All photos show positive interactions between police officers and community members, particularly children.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 251,
    "fileName": "251.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page features a heartfelt tribute to Officer Arias and other NYPD officers who have made a positive impact on a young girl named Amari Austin. The page includes three photographs showing Officer Arias with Amari and other officers (Gonzales and Boland). The text describes Amari as a sweet, enthusiastic child who admires police officers and sees them as heroes. Her family members (grandmother Debra Hamilton and mother Myisha Hamilton) express gratitude for the officers' kindness and the special time they've taken to make Amari feel important. The page emphasizes the positive role these officers play in the community and in Amari's life specifically.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 252,
    "fileName": "252.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: 400 {\"type\":\"error\",\"error\":{\"type\":\"invalid_request_error\",\"message\":\"messages.0.content.0.image.source.base64: image exceeds 5 MB maximum: 5349708 bytes > 5242880 bytes\"},\"request_id\":\"req_011CWNPdo9BJXDgSkrWGAWQw\"}",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 253,
    "fileName": "253.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page dedicated to Stevin Bush (aka Supreme) from his Aunt Anita. The page features 'SUPREME' in red italic text at the top with an underline. Below is a heartfelt message of encouragement and love. The page includes three photographs: two showing Aunt Anita with Supreme in different settings (one with a red background, one in what appears to be an indoor venue), and one full-length photo of Supreme wearing a black tracksuit with 'MILANO' branding. At the bottom is a song credit for 'Spongy Rolla What's Up My Heart' by Supreme. Page number 262 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 254,
    "fileName": "254.png",
    "type": "input-page",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "its_all_love_response",
        "type": "multiline",
        "label": "IT'S ALL LOVE - ANITA",
        "position": {
          "top": "45%",
          "left": "10%"
        },
        "width": "80%",
        "height": 400,
        "multiline": true,
        "numberOfLines": 10,
        "placeholder": "Document your personal journey..."
      }
    ],
    "description": "This is a journal entry page from the Hip-Hop Time Capsule book. The page features a vibrant design with a purple and blue graffiti-style background and a large pink torn-paper effect center section. The header reads 'HIP-HOP TIME CAPSULE' in yellow graffiti-style letters, with 'Document Your Personal Journey' in pink beneath it. The main focus is a quote or prompt 'IT'S ALL LOVE' attributed to 'ANITA', displayed in large yellow outlined text in the center of the pink section. The pink area features a subtle starburst pattern. This appears to be a reflection/response page where readers can document their thoughts related to the theme of love in hip-hop culture. Paint splatter decorative elements appear around the edges. Page number 252 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 255,
    "fileName": "255.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page features the IT'S ALL LOVE YouTube channel promotional content. It includes the YouTube logo and explains the mission to document and preserve Hip-Hop history through artist interviews. The page lists several recommended platforms and shows for Hip-Hop content, including The Breakfast Club, HOT 97, On the Radar Radio, and several popular podcasts. The content emphasizes the importance of preserving authentic Hip-Hop origins and preventing historical distortion. Page number 255 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 256,
    "fileName": "256.png",
    "type": "toc",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a table of contents page listing various hip-hop related media content including podcasts, radio shows, and educational series. The page includes 15 entries featuring prominent hip-hop personalities and platforms such as Drink Champs, Sway Universe, The Joe Budden Podcast, and others. The page number 256 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 257,
    "fileName": "257.png",
    "type": "title",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a vibrant title page featuring bold yellow graffiti-style text at the top reading 'HIP-HOP TIME CAPSULE' against a purple background with blue and pink splatter effects. Below that is white text stating 'Document Your Personal Journey'. The center features a large pink burst or explosion shape with a lighter pink starburst pattern inside it. Within this shape, the text 'ANITA' and '\"SHARIN' THE LOVE\"' appears in yellow graffiti-style lettering. The page number 257 appears at the bottom. The overall design has an urban, hip-hop aesthetic with torn paper edge effects around the central pink shape.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 258,
    "fileName": "258.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Biography page for DJ COOL KEV featuring a professional photo of him wearing a white 'Total Package' t-shirt and matching blue cap. The page details his career starting in 1989, his influences, education at the Institute of Audio Research, collaborations with major artists, and his extensive mixtape collection. Includes acknowledgment from DJ COOL KEV and STEADY BREEZIN ENT. thanking supporters. Page number 258 appears at bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 259,
    "fileName": "259.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a contact and promotional page (page 259) featuring DJ Cool Kev's email address (coolkev117@aol.com). The page displays the 'TOTAL PACKAGE!!! COLLECTION' brand logo at the top center, which includes various mascot characters like a blue dripping character, yellow lion mascot, Original Bulldogs logo, and Original Young Kings/Queens branding with QR code. Below are two framed photographs showing DJ Cool Kev with children wearing branded merchandise - blue and red t-shirts with 'I' branding and caps. At the bottom are four QR codes linking to Instagram, Website, a newly published article about the Total Package Collection Brand, and the Total Package Brand itself. The page serves as both a contact page and brand showcase for DJ Cool Kev's Total Package Collection merchandise line.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 260,
    "fileName": "260.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Artist profile page for Mark Borino featuring a professional photo of the producer/artist wearing a brown jacket with black collar, showing his distinctive hairstyle and beard. The page details his major accomplishments including co-producing 'Papi's Home' on Drake's 'Certified Lover Boy' album in 2021, which reached #8 on Billboard's Hot 100 and earned him his first platinum record. The text highlights his Harold Adamson Lyric Award from ASCAP, his independent label 'House of Rivero', and mentions his recent releases 'Don't Wait Up' and 'Visions'. Two QR codes are present - one for Instagram (bottom left) and one for ffm.bio (bottom right). Page number 260 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 261,
    "fileName": "261.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Profile page for Jamie Lynn, creator of Bark Avenue Treats organic dog treats. The page features a professional photo of Jamie Lynn with long blonde hair on the left side, and her business logo showing a cartoon dog with a butterfly on the right side. The page details her 21-year career in NYC radio as an executive morning show producer for Lite FM, and her passion for creating handmade, healthy, organic dog treats with pure ingredients. Two QR codes are included at the bottom - one for @BARKAVENUETREATS and one for Instagram. The page uses purple and pink gradient header design with a decorative diamond divider.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 262,
    "fileName": "262.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 424 (line 8 column 284)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 263,
    "fileName": "263.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a testimonial/acknowledgment page dedicated to Adrian Silvestre, Director of Food and Beverage at City Experiences. The page features two VIP badges with gold laurel wreaths and crowns at the top. The main text provides heartfelt recognition of Adrian's career journey from humble beginnings, his role at City Experiences/Hornblower, and the exceptional hospitality he provides on cruises, particularly the New York Bateaux. The page includes the City Experiences logo and two QR codes at the bottom, along with the tagline 'A Night To Remember!!!' Page number 263 appears at the bottom center.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 264,
    "fileName": "264.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page tells the success story of Shaw-nae's House, a soul-food restaurant. It features the restaurant's logo at the top (a stylized house with the number 5 and Shaw-nae's HOUSE text). Below are three photos: a chef presenting food, Shaw-nae with another person holding flowers, and a collage of various dishes from the restaurant. The narrative describes how the restaurant owner contacted The Breakfast Club for exposure, leading to success and recognition. At the bottom are five QR codes linking to major media features including New York Times, Elvis Duran, NYC Tourism, Today Show, and NYT's 50 Best Restaurants in America list.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 265,
    "fileName": "265.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This appears to be a blank or nearly blank page with only the page number 265 visible in the bottom right corner. The page has a white/off-white background with no other visible content, text, images, or decorative elements.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 266,
    "fileName": "266.png",
    "type": "title",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a title page for the Hip-Hop Time Capsule book featuring DJ Scipio's 'Thank-You'. The design has a vibrant purple and blue background with graffiti-style yellow text for the main title at the top. The subtitle 'Document Your Personal Journey' appears in white and pink. The center features a large pink burst/star shape with torn paper edges containing the artist name 'DJ SCIPIO' and track title 'THANK-YOU' in bold yellow outlined letters. The page number 266 appears at the bottom. The overall aesthetic is colorful and energetic, matching hip-hop culture's visual style.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 267,
    "fileName": "267.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a dedication page featuring two tribute messages to DJ NUFIYO. The page has a decorative title in graffiti-style purple lettering at the top. The first section is dedicated to Shirley Williams and includes purple floral watercolor decorations. The second section is dedicated to Greg Simpkins and includes a photograph showing two men in a handshake pose - one wearing sunglasses and a pinstriped suit, the other in casual black clothing. Both messages express gratitude and appreciation for long-term friendship and support.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 268,
    "fileName": "268.png",
    "type": "title",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a title page for a section called 'DJ Scipio Shout-Outs' within the Hip-Hop Time Capsule book. The page features vibrant purple and pink colors with a graffiti-style header 'HIP-HOP TIME CAPSULE' in yellow 3D letters at the top. Below that is a pink banner with white text reading 'Document Your Personal Journey'. The center of the page displays a pink torn-paper or starburst effect containing the text 'DJ SCIPIO \"SHOUT-OUTS\"' in bold yellow outlined letters. The design includes paint splatter accents and has an urban, street art aesthetic. The page number 268 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 269,
    "fileName": "269.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A heartfelt acknowledgments page titled 'DJ SHOUT-OUT' with three paragraphs expressing gratitude. The first thanks the author's family for their love and support. The second gives special recognition to sister Anita for her crucial role in making the book happen. The third thanks the broader Hip-Hop community including DJs, MCs, producers, and labels. The page is decorated with a purple brushstroke banner at the top and three music-themed icons (vinyl records and DJ headphones) at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 270,
    "fileName": "270.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 270 is a thank you and shout-out page dedicated to the Carolinas. DJ SCIPIO expresses gratitude to fans for 45 years of support, stating 'without you, there would be no DJ SCIPIO!' The page features both South Carolina and North Carolina state flags. A special shout-out is given to The Breakfast Club/Power 105.1 radio show, specifically mentioning Jess Hilarious and Loren LaRosa. The thank you section lists several prominent hip-hop media personalities including Charlamagne Tha God (from Moncks Corner, SC), DJ Envy, Angela Yee (host of Way Up With Angela Yee), Jim Kerr, Kelly Kramer, DJ Clue, DJ Prostyle, DJ Suss One, and Angie Martinez. The page concludes with a special shout-out to Mikey Truth, described as 'South Carolina's #1 Urban Blogger and Queen of Paperwork,' accompanied by a crown logo with the text 'QUEEN OF PAPERWORK.'",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 271,
    "fileName": "271.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a dedication and acknowledgments page from DJ Scipio. It features a purple graffiti-style header reading 'DJ SCIPIO' and a purple brush stroke banner containing 'SHOUT-OUT' in white text. The page contains personal dedications to family members including his sister Deborah Scipio, nieces Shirley Leslie Smith and Denise Scipio, and nephews DJ Cool Kev and Melvin T. Hayes. It includes a special acknowledgment to childhood friend Kool Moe Dee for writing the book's foreword. The remainder lists numerous individuals from the hip-hop and music industry community including DJs, record pool operators, and other music professionals. The page number 271 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 272,
    "fileName": "272.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 272 features a 'DJ Shout-Out' section with a purple painted brush stroke banner containing the white text 'SHOUT-OUT'. The title 'DJ NOTHIN' appears above in stylized graffiti-style text. The page lists approximately 39 names of DJs, family members, and entertainment industry professionals being acknowledged, arranged in multiple lines across the page. This appears to be an acknowledgments or thank you page recognizing DJs and others who contributed to or supported the project.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 273,
    "fileName": "273.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: Expected ',' or '}' after property value in JSON at position 620 (line 8 column 472)",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 274,
    "fileName": "274.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is an 'About the Author' page featuring DJ SCIPIO (Hilton V. Scipio). The page includes a large photograph of DJ SCIPIO in a professional setting, wearing a red vest over a white shirt, positioned at DJ turntables and mixing equipment. The page header has decorative elements with a diamond shape between two horizontal lines. The text provides biographical information about the author's background in Harlem and The Bronx, his musical influences from soul artists, and his early involvement in Hip-Hop culture starting in 1973. The page appears to be incomplete, cutting off mid-sentence about his early Hip-Hop experiences.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 275,
    "fileName": "275.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains biographical information about DJ SCIPIO, detailing his early influences in New York (including Kool Herc, GrandMaster Flash, Grand Wizard Theodore, and family members), his move to South Carolina in 1989, and his subsequent success in the Dirty South music scene. The text describes his achievements including being among the first to bring Dirty South mixtapes to NYC, receiving over twenty awards including five consecutive Mixtape DJ of the Year awards in South Carolina, and his continued influence in the entertainment and music industry. Page number 275 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 276,
    "fileName": "276.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "About the Author page featuring Anita Scipio, former receptionist for iHeartMedia in New York. The page includes a professional photograph of Anita Scipio wearing a black outfit with a pearl necklace, smiling warmly against an orange iHeartMedia branded background. The text describes her nearly two-decade career at iHeartMedia and how she became an iconic figure known affectionately as 'Miss Anita' or 'Mama' to those who worked at the company. The page explains how she transcended her receptionist role to become the face and soul of iHeartMedia, witnessing the evolution of the entertainment industry.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 277,
    "fileName": "277.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page is a tribute to Anita Scipio, describing her role at iHeartMedia's New York office. The text highlights her nurturing personality, her relationships with celebrities and colleagues who called her 'Mama', and her role as a beacon of support beyond administrative duties. It also mentions her work as an ordained minister for over twenty years and her charitable endeavors. The page number 277 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 278,
    "fileName": "278.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page showcases media interview appearances with two prominent radio shows. The top section features The Breakfast Club interview with a group photo in their studio setting, including The Breakfast Club logo and a QR code for accessing the interview. The bottom section highlights an interview on Way Up with Angela Yee, showing the host with a guest in the iHeartRADIO studio, along with the Way Up logo and another QR code. The page number 278 appears at the bottom. This appears to be documentation of promotional media appearances related to the Hip-Hop Time Capsule project.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 279,
    "fileName": "279.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a tribute/memorial page featuring 9 photographs showing the same woman (likely the book's author or subject) posing with various famous hip-hop artists. The page is titled 'Thank you all, for the love and great memories...' at the top. The photos are arranged in a 3x3 grid, each labeled with the artist's name: Kool Moe Dee, LL Cool J, Ice-T (top row), DMX, Snoop Dogg, Rick Ross (middle row), and 2 Chainz, Fat Joe, and Treach (bottom row). Each photo shows a warm, friendly moment between the woman and the respective artist. The page number 279 appears at the bottom center.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 280,
    "fileName": "280.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page displays a 3x3 grid of photographs featuring the same woman posing with various hip-hop celebrities and artists. The top row shows photos with Mary J Blige, Kid 'n Play, and Ice Cube. The middle row features Redman, Meek Mill, and Moneybagg Yo. The bottom row includes Rev Run, DMC, and A$AP Rocky. Each photo is labeled with the celebrity's name beneath it. This appears to be a personal collection showcasing meetings with prominent figures in hip-hop culture. The page number 280 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 281,
    "fileName": "281.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: 400 {\"type\":\"error\",\"error\":{\"type\":\"invalid_request_error\",\"message\":\"messages.0.content.0.image.source.base64: image exceeds 5 MB maximum: 5273648 bytes > 5242880 bytes\"},\"request_id\":\"req_011CWNQAbixE1keEqcryLwde\"}",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 282,
    "fileName": "282.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A photo collage page displaying eight photographs of what appears to be the same woman (likely a grandmother or family member) posing with various hip-hop and rap artists including Chris Brown, Takashi 69, Casanova 2x, Waka Flocka, Machine Gun Kelly, D. Rawlings & Common, Young M.A, and Salt-N-Pepa. The photos are arranged in a grid layout with captions identifying each celebrity. One photo features Young M.A holding a red t-shirt that was made by the book owner's granddaughter Gayla. The page number 282 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 283,
    "fileName": "283.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A media collage page showcasing Will Smith's viral moment from January 2020. The page features a decorative title with ornamental arrows and a gold shield icon, followed by multiple screenshots of news coverage from various outlets. The images show Will Smith embracing and celebrating with Anita Scipio, a retiring iHeartRadio receptionist, at her farewell party. A QR code is included in the upper right for additional content. The layout displays approximately 10-12 screenshots from different media sources, all documenting this heartwarming celebrity encounter that generated widespread press coverage.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 284,
    "fileName": "284.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page features a personal reflection from Anita about her retirement and Hip-Hop journey. At the top are two QR codes - one labeled 'Will Smith' on the left and one labeled 'Reflecting on My Viral Moment with Will Smith' on the right. In the center is an Instagram-style post showing a photo of two people in conversation. Below is a handwritten-style paragraph expressing gratitude for encounters with Hip-Hop legends and mentioning a future book called 'Hip-Hop Time Capsule: The Next Chapter.' The page number 284 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 285,
    "fileName": "285.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page documents Anita's retirement celebration and tribute. It features multiple sections with photos, QR codes, and personal messages. The top section shows appreciation for Elvis Duran with an invitation to Anita's 40th birthday party. The main story headline announces Elvis Duran giving the retiring employee a trip and $10,000. Throughout the page are multiple QR codes linking to different content including an 'Ugly Cry Alert', favorite songs of the night ('Suge' by DaBaby and 'It Takes Two' by Rob Base), shout-outs to DJs, and her signature song 'Lean On Me'. The page includes party photos showing decorations and celebrations, as well as a 'Mama's VIP' sign from iHeartAnita.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 286,
    "fileName": "286.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Final page of the Hip-Hop Time Capsule book titled 'Heartfelt Wishes'. The page features a purple script title at the top, followed by three paragraphs of heartfelt closing messages to readers. The authors thank readers for their journey, share their personal story of perseverance in creating the book despite setbacks, mention their visions coming true with appearances on The Breakfast Club and Angela Yee's show, and offer inspirational advice. The page concludes with 'BE Fearless' styled in purple decorative script, referencing DJ Envy. Page number 286 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 287,
    "fileName": "287.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Final page of the book featuring a photo of Anita and Hilton together at the top, followed by a request for Amazon reviews. The page includes their warm closing message 'Love and Blessings' and 'Thank You'. At the bottom are four QR codes linking to: Amazon reviews, Anita's Instagram, Team Scipio website, and DJ Scipio's logo showing pyramids with the Smooth Entertainment brand. This serves as both a conclusion and a call-to-action page encouraging reader engagement.",
    "needsCustomLayout": true
  }
]