[
  {
    "pageNumber": 1,
    "fileName": "1.png",
    "type": "title",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "author_name_1",
        "type": "text",
        "label": "ANITA SCIPIO",
        "position": "bottom-left"
      },
      {
        "id": "author_name_2",
        "type": "text",
        "label": "HILTON V. SCIPIO",
        "position": "bottom-right"
      }
    ],
    "description": "Title page for 'Hip-Hop Time Capsule: Document Your Personal Journey' with subtitle and author attribution fields for two authors",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 2,
    "fileName": "2.png",
    "type": "blank",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A blank page with only the page number '2' centered at the bottom",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 3,
    "fileName": "3.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Thank you page featuring a quote 'Your Support Is Everything!' with decorative musical notes, followed by 'Thank you!' and signed by 'Anita Scipio and DJ SCIPIO'. The page includes decorative silhouettes at the bottom showing a breakdancer, cassette tape, and dancer figure.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 4,
    "fileName": "4.png",
    "type": "copyright",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Copyright page containing all rights reserved notice and copyright symbol with '2024 TEAM SCIPIO' at the bottom. Page number 4 appears at the bottom center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 5,
    "fileName": "5.png",
    "type": "toc",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Table of Contents page listing 16 chapters with page numbers, including sections on Title Page, Autograph Page, Copyright Page, Foreward, Kool Moe Dee Hats, Introduction, dedications, personal journey questions, hip-hop quotes, trivia questions, and journey stories from DJ SCIPIO and Anita Scipio",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 6,
    "fileName": "6.png",
    "type": "toc",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Table of Contents page showing chapters 17-30 with page numbers ranging from 220-284. Includes topics about Angela Yee, The Breakfast Club, DJ SCIPIO sections, author bios for Hilton and Anita Scipio, celebrity photos, and closing chapters. Contains a note at bottom about automatic numbering system for the first three pages.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 7,
    "fileName": "7.png",
    "type": "foreword",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Foreword page introducing the Hip-Hop Time Capsule book, written about co-authors Anita Scipio and DJ SCIPIO (Hilton V. Scipio). The text describes Hip-Hop as a living cultural testament and explains the authors' extensive experience in the Hip-Hop industry - DJ SCIPIO with over 45 years in the Carolinas and Anita Scipio with nearly two decades at iHeartMedia.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 8,
    "fileName": "8.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains an introduction and historical note about Hip-Hop, signed by Kool Moe Dee. It describes personal experiences and introduces a 'Hip-Hop Time Capsule' concept. The bottom section features a note from the authors about the historic 1981 battle between Kool Moe Dee and Busy Bee Starski at Harlem World, with three QR codes linking to recordings of this historic battle.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 9,
    "fileName": "9.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page titled 'Kool Moe Dee: Hats' featuring two photographs of the artist wearing sunglasses and hats, followed by biographical text describing Kool Moe Dee as a pioneering rapper and Hip-Hop artist. The text explains his role in Treacherous Three, his musical contributions, and his passion for hats. The page mentions his agreement to write a foreword with the condition that hats' significance in Hip-Hop be emphasized.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 10,
    "fileName": "10.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page discusses the cultural significance of hats in hip-hop, featuring a quote from Kool Moe Dee explaining how hats became symbols of empowerment and identity, representing a metaphorical African crown. The page concludes with a summary about how hip-hop fashion choices had lasting impact on broader fashion culture.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 11,
    "fileName": "11.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Conclusion page of a section about hats in early Hip-Hop, signed by Anita, followed by a fun fact quiz matching Hip-Hop artists to their iconic headwear from the Hip-Hop Time Capsule cover. Lists The Notorious B.I.G. (crown), RUN-DMC (black Fedora), Queen Latifah (yellow-gold Kufi-style crown hat), LL Cool J (red Kangol), and Kool Moe Dee (black leather flat top Kufi).",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 12,
    "fileName": "12.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Introduction page with decorative musical notes header. The page introduces the book 'Hip-Hop Time Capsule' and explains the author Anita Scipio's background as an 18-year iHeartMedia receptionist and lifelong Hip-Hop fan since 1978. It describes her inspiration from attending the Hip-Hop 50 Live Concert at Yankee Stadium on August 12, 2023, which led to creating this book to help people document their personal Hip-Hop journeys and memories.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 13,
    "fileName": "13.png",
    "type": "foreword",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Foreword or introduction page explaining the author's motivation for creating 'Hip-Hop Time Capsule: Document Your Personal Journey.' The author discusses their collaboration with co-author DJ SCIPIO, acknowledges their own limitations as a fan rather than expert, and explains how they learned about Hip-Hop's origins from pioneers like DJ Hollywood, Grandmaster Flowers, Disco King Mario, and Cool Herc. The page mentions the book contains 100 thought-provoking questions and emphasizes its uniqueness in the market.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 14,
    "fileName": "14.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is a foreword or introduction page (page 14) where the author discusses the challenging process of writing a book about Hip-Hop's 50-year history. The author mentions including 50 quotes, 50 trivia questions, and 235 QR codes throughout the book. They also acknowledge working with their brother Hilton (DJ SCIPIO) and discuss the various setbacks faced during the book's creation.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 15,
    "fileName": "15.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page explaining the QR code feature in the book, describing how selected codes link to hip-hop songs to create an interactive experience. Discusses the decision to use original versions of songs and link to official platforms like YouTube to support artists while avoiding copyright issues. The page emphasizes making the book family-friendly and creating an interactive journey through hip-hop history.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 16,
    "fileName": "16.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Introduction page explaining copyright and QR code linking policies for Hip-Hop content, followed by a section header introducing a Hip-Hop Time Capsule feature for documenting personal journey. Includes content warning about audience suitability and describes the evolution of the journal project from original plan to include personal experiences.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 17,
    "fileName": "17.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Content page explaining why the book was split into two volumes. The author describes how the project grew beyond its original format and became too large for a single volume. Includes a heading 'Why This book Became Two Volumes' in purple text. The page discusses the division of content between volumes and acknowledges a colleague named Thea Mitchem from iHeartMedia.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 18,
    "fileName": "18.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Announcement page for upcoming book 'this time in color' and Hip-Hop Time Capsule app. Features two QR codes - one linking to Brian Moore's Portfolio (bmoore4452.github.io) and one for Instagram (@BMOORE4452). Includes promotional text about the new book having a foreword by a Hip-Hop legend and featuring artists/legends on a deeper personal level. Also announces an app created by nephew Brian Moore coming to Apple, Android and Web.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 19,
    "fileName": "19.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A 'Sneak Peek' page showing two framed photographs at the top - one featuring Kool Moe Dee and LL Cool J, another featuring 50 Cent. Below is a list of famous hip-hop artists and celebrities mentioned in the book, including Kool Moe Dee, LL Cool J, Snoop Dogg, DMX, Will Smith, Salt-N-Pepa, Mary J Blige, Fat Joe, Ice Tea, Rick Ross, Ice Cube, 50 Cent, Young MA, 2 Chainz, Da Baby, Jezzy, Run-DMC, French Montana, Redman, Wiz Khalifa, Big Sean, Nelly, TI, Sean Paul, Treach, Moneybagg Yo, and many more.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 20,
    "fileName": "20.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page dedicated to DaBaby, featuring two photos at the top - one black and white photo on the left and one color photo with multiple people on the right. The page contains a heartfelt story about a retired person's encounter with DaBaby on October 1st, describing how the artist went out of his way to connect after missing them at The Breakfast Club. The text includes gratitude messages to Sherri, Garrett, and the team, signed by 'Mama'. The page includes the 'stay TUNED' logo at the bottom and is numbered page 20.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 21,
    "fileName": "21.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A dedication page titled 'ANITA'S DEDICATION' featuring two photographs showing family members together. The page contains a heartfelt dedication message to the author's daughter Arlene Yvette Scipio and granddaughter Gayla Renee Robinson, expressing love, gratitude, and blessings. The message is signed 'Love, Mom & Grandma' with decorative heart graphics.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 22,
    "fileName": "22.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A dedication page titled 'HILTON'S DEDICATION' featuring two photographs at the top - one showing a person in a yellow dress holding a Broadway playbill, and another showing a young girl in pink. Below is a heartfelt dedication message from Dad/Papa Scipio to his daughter Cheri Scipio-White, granddaughters Kadence L. White and Chloe N. White, and late son Hilton Fuquan Scipio (RIP). The dedication discusses the book's purpose to share Hip-Hop journey memories and inspire family. The page is decorated with purple floral graphics at the bottom corners and includes a dove symbol.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 23,
    "fileName": "23.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "questions_section",
        "type": "writing_area",
        "label": "QUESTIONS",
        "position": "center",
        "description": "Large blank area for writing questions related to hip-hop personal journey"
      }
    ],
    "description": "A page titled 'Hip-Hop Time Capsule' with subtitle 'Document Your Personal Journey' featuring a large pink burst-shaped area labeled 'QUESTIONS' where users can write their responses. The page has a purple background with graffiti-style text and urban aesthetic.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 24,
    "fileName": "24.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "name",
        "type": "text",
        "label": "MY NAME IS:",
        "position": "upper"
      },
      {
        "id": "birthplace",
        "type": "text",
        "label": "I WAS BORN AND RAISED IN:",
        "position": "middle-upper"
      },
      {
        "id": "dob",
        "type": "text",
        "label": "MY D.O.B IS:",
        "position": "middle-lower"
      }
    ],
    "description": "Hip-hop themed personal information page with decorative graffiti-style text and paint splatter graphics. Contains three fill-in fields for name, birthplace, and date of birth. Includes hip-hop culture keywords at top and motivational message at bottom with microphone illustration.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 25,
    "fileName": "25.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question1_response",
        "type": "multiline_text",
        "label": "1. When did you first discover Hip-Hop music?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question2_response",
        "type": "multiline_text",
        "label": "2. Do you remember where you were?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Interactive journal page with two reflective questions about discovering Hip-Hop music. Features a purple crown icon at top right and a pink silhouette of a dancer at bottom left. Contains multiple blank lines for written responses to both questions.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 26,
    "fileName": "26.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question3",
        "type": "long_text",
        "label": "3. What was the first song that caught your attention?",
        "lines": 8
      },
      {
        "id": "question4",
        "type": "long_text",
        "label": "4. What were the emotions you felt hearing Hip-Hop for the first time?",
        "lines": 8
      }
    ],
    "description": "A journal page with two reflection questions about first experiences with Hip-Hop music. The page includes decorative elements - a pink paint splatter graphic at the top right and a purple chain with dollar sign pendant at the bottom left. Each question has multiple blank lines for written responses.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 27,
    "fileName": "27.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "q5_response",
        "type": "text_area",
        "label": "5. Who are (or were) your hottest (or as we used to say \"illest\") MCs?",
        "position": "top"
      },
      {
        "id": "q6_response",
        "type": "text_area",
        "label": "6. Did Hip-Hop inspire you to become, or want to become, a lyricist, rapper, dancer, or DJ? If so, was there anyone in particular who inspired you?",
        "position": "bottom"
      }
    ],
    "description": "Interactive page with two open-ended questions about hip-hop MCs and inspiration, with multiple blank lines provided for written responses. Page includes decorative music notes icon at top and hip-hop graffiti-style graphic at bottom. Page number 27.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 28,
    "fileName": "28.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question7",
        "type": "text",
        "label": "7. Did Hip-Hop play a role in your friendship or social circles?",
        "position": "top"
      },
      {
        "id": "question8",
        "type": "text",
        "label": "8. What were the top three or more songs that gave you the confidence to overcome a personal challenge in your life?",
        "position": "bottom"
      }
    ],
    "description": "Page 28 contains two journal-style questions about Hip-Hop's influence on social relationships and empowering songs. Each question has multiple blank lines for written responses. The page includes decorative graphics of a purple paint splatter at the top and a pink speaker icon at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 29,
    "fileName": "29.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question9_line1",
        "type": "text",
        "label": "Top five hottest jams or concerts - line 1",
        "position": "middle-upper"
      },
      {
        "id": "question9_line2",
        "type": "text",
        "label": "Top five hottest jams or concerts - line 2",
        "position": "middle-upper"
      },
      {
        "id": "question9_line3",
        "type": "text",
        "label": "Top five hottest jams or concerts - line 3",
        "position": "middle-upper"
      },
      {
        "id": "question9_line4",
        "type": "text",
        "label": "Top five hottest jams or concerts - line 4",
        "position": "middle-upper"
      },
      {
        "id": "question9_line5",
        "type": "text",
        "label": "Top five hottest jams or concerts - line 5",
        "position": "middle-upper"
      },
      {
        "id": "question9_line6",
        "type": "text",
        "label": "Top five hottest jams or concerts - line 6",
        "position": "middle"
      },
      {
        "id": "question10_line1",
        "type": "text",
        "label": "Top DJs who made the biggest impact on Hip-Hop - line 1",
        "position": "lower"
      },
      {
        "id": "question10_line2",
        "type": "text",
        "label": "Top DJs who made the biggest impact on Hip-Hop - line 2",
        "position": "lower"
      },
      {
        "id": "question10_line3",
        "type": "text",
        "label": "Top DJs who made the biggest impact on Hip-Hop - line 3",
        "position": "lower"
      },
      {
        "id": "question10_line4",
        "type": "text",
        "label": "Top DJs who made the biggest impact on Hip-Hop - line 4",
        "position": "lower"
      },
      {
        "id": "question10_line5",
        "type": "text",
        "label": "Top DJs who made the biggest impact on Hip-Hop - line 5",
        "position": "lower"
      },
      {
        "id": "question10_line6",
        "type": "text",
        "label": "Top DJs who made the biggest impact on Hip-Hop - line 6",
        "position": "lower"
      },
      {
        "id": "question10_line7",
        "type": "text",
        "label": "Top DJs who made the biggest impact on Hip-Hop - line 7",
        "position": "lower"
      },
      {
        "id": "question10_line8",
        "type": "text",
        "label": "Top DJs who made the biggest impact on Hip-Hop - line 8",
        "position": "lower-bottom"
      }
    ],
    "description": "Page 29 contains two Hip-Hop related questions: Question 9 asks about top five hottest jams or concerts and where they were attended (with 6 blank lines), and Question 10 asks about top DJs who made the biggest impact on Hip-Hop (with 8 blank lines). The page includes decorative musical note graphics and a microphone illustration.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 30,
    "fileName": "30.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_11",
        "type": "text_lines",
        "label": "11. Who, from your crew, are (or were) your favorite people to party with?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_12",
        "type": "text_lines",
        "label": "12. What were your top three old-school dances back in the day, and what are they today?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Interactive page with two questions about partying with crew members and favorite old-school dances, with multiple blank lines for written responses. Page includes decorative purple paint splatter graphic at top and pink headphones graphic at bottom. Page number 30.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 31,
    "fileName": "31.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_13",
        "type": "multi-line text",
        "label": "13. What or are (or were) your top five Hip-Hop clubs?",
        "numberOfLines": 6
      },
      {
        "id": "question_14",
        "type": "multi-line text",
        "label": "14. What are your top five or more party songs that really turned it up (or as we used to say) rocked the house?",
        "numberOfLines": 8
      }
    ],
    "description": "A page with two questions about Hip-Hop culture. Question 13 asks about favorite Hip-Hop clubs with 6 blank lines for answers. Question 14 asks about party songs with 8 blank lines for answers. The page includes a purple paint splatter graphic at the top and a pink cassette tape icon at the bottom. Page number 31 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 32,
    "fileName": "32.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_15",
        "type": "text_area",
        "label": "15. What was the first song that you could fully recite?",
        "position": "top"
      },
      {
        "id": "question_16",
        "type": "text_area",
        "label": "16. In your day, who were the hottest or (as we used to say \"illest\") top five male artists or groups?",
        "position": "bottom"
      }
    ],
    "description": "Page 32 contains two questions with multiple blank lines for written responses. Question 15 asks about the first song the reader could fully recite (decorated with musical notes icon). Question 16 asks about top five male artists or groups from their era (decorated with a breakdancer silhouette icon at bottom).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 33,
    "fileName": "33.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question17",
        "type": "text",
        "label": "17. What is the one concert or event that you regret missing?",
        "lines": 7
      },
      {
        "id": "question18",
        "type": "text",
        "label": "18. What are some old-school lines or quotes that you still recite today?",
        "lines": 8
      }
    ],
    "description": "Page 33 contains two questions about music and cultural memories. Question 17 asks about a missed concert or event with regret, featuring a purple crown icon. Question 18 asks about old-school lines or quotes still recited today, with a pink boombox illustration at the bottom. Both questions have multiple blank lines for written responses.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 34,
    "fileName": "34.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "q19_line1",
        "type": "text",
        "label": "Question 19: Favorite club songs - Line 1",
        "position": "middle-upper"
      },
      {
        "id": "q19_line2",
        "type": "text",
        "label": "Question 19: Favorite club songs - Line 2",
        "position": "middle-upper"
      },
      {
        "id": "q19_line3",
        "type": "text",
        "label": "Question 19: Favorite club songs - Line 3",
        "position": "middle-upper"
      },
      {
        "id": "q19_line4",
        "type": "text",
        "label": "Question 19: Favorite club songs - Line 4",
        "position": "middle-upper"
      },
      {
        "id": "q19_line5",
        "type": "text",
        "label": "Question 19: Favorite club songs - Line 5",
        "position": "middle-upper"
      },
      {
        "id": "q19_line6",
        "type": "text",
        "label": "Question 19: Favorite club songs - Line 6",
        "position": "middle-upper"
      },
      {
        "id": "q19_line7",
        "type": "text",
        "label": "Question 19: Favorite club songs - Line 7",
        "position": "middle-upper"
      },
      {
        "id": "q20_line1",
        "type": "text",
        "label": "Question 20: Top 5 Break Dance tracks for B-Boys - Line 1",
        "position": "middle-lower"
      },
      {
        "id": "q20_line2",
        "type": "text",
        "label": "Question 20: Top 5 Break Dance tracks for B-Boys - Line 2",
        "position": "middle-lower"
      },
      {
        "id": "q20_line3",
        "type": "text",
        "label": "Question 20: Top 5 Break Dance tracks for B-Boys - Line 3",
        "position": "middle-lower"
      },
      {
        "id": "q20_line4",
        "type": "text",
        "label": "Question 20: Top 5 Break Dance tracks for B-Boys - Line 4",
        "position": "middle-lower"
      },
      {
        "id": "q20_line5",
        "type": "text",
        "label": "Question 20: Top 5 Break Dance tracks for B-Boys - Line 5",
        "position": "middle-lower"
      },
      {
        "id": "q20_line6",
        "type": "text",
        "label": "Question 20: Top 5 Break Dance tracks for B-Boys - Line 6",
        "position": "middle-lower"
      },
      {
        "id": "q20_line7",
        "type": "text",
        "label": "Question 20: Top 5 Break Dance tracks for B-Boys - Line 7",
        "position": "middle-lower"
      },
      {
        "id": "q20_line8",
        "type": "text",
        "label": "Question 20: Top 5 Break Dance tracks for B-Boys - Line 8",
        "position": "middle-lower"
      }
    ],
    "description": "Page 34 contains two music-related questions. Question 19 asks about favorite songs to be played at a club with 7 blank lines for answers. Question 20 asks about top 5 favorite Break Dance tracks for B-Boys with 8 blank lines for answers. Page includes a pink paint splatter graphic at top and purple cassette tape icon at bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 35,
    "fileName": "35.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_21",
        "type": "text_area",
        "label": "21. Did you own any DJ equipment, and if so, what kind?",
        "position": "top",
        "lines": 8
      },
      {
        "id": "question_22",
        "type": "text_area",
        "label": "22. Have you ever been at a club or jam where shots were fired or some type of violence took place?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Survey or questionnaire page with two questions about DJ equipment ownership and experiences with violence at clubs. Each question is followed by multiple blank lines for written responses. Decorative silhouettes of dancers appear in magenta (top right) and blue (bottom left).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 36,
    "fileName": "36.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_23",
        "type": "text_area",
        "label": "Have you ever been affected by the loss of an artist that you were a big fan of?",
        "position": "top"
      },
      {
        "id": "question_24",
        "type": "text_area",
        "label": "If so, how were you specifically affected?",
        "position": "bottom"
      }
    ],
    "description": "A journal or workbook page with two related questions about experiencing the loss of a favorite artist. Question 23 asks if the reader has been affected by an artist's death, and question 24 asks for specific details about how they were affected. The page includes decorative elements: a purple paint splatter graphic at the top and a purple speaker illustration at the bottom. Multiple blank lines are provided for written responses to each question.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 37,
    "fileName": "37.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_25",
        "type": "text_area",
        "label": "25. Have you ever had the opportunity to do something kind or important for your favorite artist?",
        "position": "top"
      },
      {
        "id": "question_26",
        "type": "text_area",
        "label": "26. If the lyrics in one of your favorite songs could come true for a day, which lyrics would you choose?",
        "position": "bottom"
      }
    ],
    "description": "A journal or workbook page with two music-related questions. Question 25 asks about doing something kind for a favorite artist (with 7 blank lines). Question 26 asks which song lyrics the reader would want to come true (with 8 blank lines). The page is decorated with pink headphones icon at top right and a purple boombox illustration at bottom left. Page number 37.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 38,
    "fileName": "38.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_27",
        "type": "text_area",
        "label": "27. What Hip-Hop song do you hear and instantly remember exactly where you were and what you were doing?",
        "position": "top"
      },
      {
        "id": "question_28",
        "type": "text_area",
        "label": "28. Were there any Hip-Hop artists you had a crush on back in your day? If so, who? How about today?",
        "position": "bottom"
      }
    ],
    "description": "Interactive page with two hip-hop related questions. Question 27 asks about memorable hip-hop songs and associated memories. Question 28 asks about crushes on hip-hop artists past and present. Multiple blank lines provided for written responses to each question. Page includes decorative music notes graphic at top and hip-hop style text graphic at bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 39,
    "fileName": "39.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_29",
        "type": "multi-line text",
        "label": "29. Who are some of your favorite New York mixtape DJs?",
        "position": "top"
      },
      {
        "id": "question_30",
        "type": "multi-line text",
        "label": "30. Who were your favorite B-Boys, and why?",
        "position": "bottom"
      }
    ],
    "description": "Page 39 of what appears to be a hip-hop culture questionnaire or journal. Contains two questions: one about favorite New York mixtape DJs and another about favorite B-Boys. Each question is followed by multiple blank lines for written responses. Decorative elements include a pink microphone icon at the top and purple musical notes at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 40,
    "fileName": "40.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "field_31",
        "type": "multiline_text",
        "label": "31. What record pool, if any, did you belong to?",
        "position": "top"
      },
      {
        "id": "field_32",
        "type": "multiline_text",
        "label": "32. When you were on your way to a club; looking clean (or as we used to say) looking fresh, what were your favorite colognes, perfumes, or body oils to wear?",
        "position": "bottom"
      }
    ],
    "description": "Page 40 contains two open-ended questions about record pools and favorite fragrances worn to clubs, with multiple blank lines provided for written responses. Decorative graphics appear at the top (pink splatter) and bottom (purple dancing figure) of the page.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 41,
    "fileName": "41.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_33",
        "type": "multiline_text",
        "label": "33. Fashion is an integral part of Hip-Hop. Back in your day, what was your favorite Hip-Hop drip (or as we used to say) gear? And now?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_34",
        "type": "multiline_text",
        "label": "34. What was your sneaker and shoe game like? And now?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Interactive page with two questions about hip-hop fashion and sneakers, past and present. Features a purple paint splatter graphic at top and pink cassette tape icon at bottom. Page 41.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 42,
    "fileName": "42.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_35",
        "type": "text_area",
        "label": "35. What were your favorite drinks to get your party started? And now?",
        "position": "top"
      },
      {
        "id": "question_36",
        "type": "text_area",
        "label": "36. What three or more artists or groups have influenced your view of social issues and activism?",
        "position": "bottom"
      }
    ],
    "description": "Page 42 containing two questions with multiple blank lines for written responses. Question 35 asks about favorite party drinks past and present, accompanied by a music note icon. Question 36 asks about artists/groups that influenced views on social issues and activism, with a hip-hop style graphic at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 43,
    "fileName": "43.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_37",
        "type": "long_text",
        "label": "37. Are there any particular artists or groups whose life stories have inspired you?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_38",
        "type": "long_text",
        "label": "38. Has Hip-Hop contributed to your personal growth, and if so, which song or artist do you credit with your development?",
        "position": "bottom",
        "lines": 7
      }
    ],
    "description": "Interactive page with two reflection questions about hip-hop artists and personal growth, featuring blank lines for written responses. Page includes decorative elements: a pink crown graphic at top right and purple drip design at bottom left. Page number 43.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 44,
    "fileName": "44.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_39",
        "type": "text_area",
        "label": "39. When was the first time (if ever) that you tried to write your own rap?",
        "position": "top",
        "lines": 6
      },
      {
        "id": "question_40",
        "type": "text_area",
        "label": "40. Who or what inspired you to try, and how would you rate your skills?",
        "position": "bottom",
        "lines": 7
      }
    ],
    "description": "Interactive journal page with two questions about writing rap. Question 39 asks about the first time trying to write rap, and question 40 asks about inspiration and self-rating of skills. Each question has multiple blank lines for written responses. Page includes decorative graphics of a paint splatter at top and a microphone at bottom. Page number 44 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 45,
    "fileName": "45.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_41",
        "type": "multi_line_text",
        "label": "Have you ever met or worked with any of your favorite artists or legends in Hip-Hop?",
        "position": "top"
      },
      {
        "id": "question_42",
        "type": "multi_line_text",
        "label": "Who was the better lyricist: Biggie or Tupac?",
        "position": "bottom"
      }
    ],
    "description": "A questionnaire page with two hip-hop related questions. Question 41 asks about meeting or working with favorite hip-hop artists or legends, with 7 blank lines for response. Question 42 asks about comparing Biggie and Tupac as lyricists, also with multiple blank lines. The page includes decorative elements: a pink paint splatter graphic in the top right and a blue silhouette of a person jumping at the bottom left. Page number 45 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 46,
    "fileName": "46.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_43",
        "type": "text_area",
        "label": "43. What were your thoughts on the infamous East Coast vs. West Coast war? Did you choose a side?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_44",
        "type": "text_area",
        "label": "44. If you could have fifteen minutes with your favorite Hip-Hop legend or artist, who would it be and what would you say?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Interactive page with two hip-hop related questions: one about the East Coast vs. West Coast rivalry, and another asking which hip-hop legend the reader would want to meet. Each question has multiple blank lines for written responses. Page includes decorative graphics - a blue paint splatter at top right and a pink figure silhouette at bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 47,
    "fileName": "47.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_45",
        "type": "text_area",
        "label": "If you could spend the whole day with your favorite Hip-Hop legend or artist, who would it be and what plans would you make?",
        "position": "top",
        "lines": 6
      },
      {
        "id": "question_46",
        "type": "text_area",
        "label": "If you could have a rap battle with any of your favorite artists, who would you choose?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Page 47 contains two Hip-Hop related journal prompts with blank lines for responses. Question 45 asks about spending a day with a Hip-Hop legend with 6 response lines and includes a headphone icon. Question 46 asks about having a rap battle with favorite artists with 8 response lines. A 'Hip Hop' graffiti-style logo appears at the bottom of the page.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 48,
    "fileName": "48.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question47",
        "type": "text_area",
        "label": "47. What clever lines would you use to diss them?",
        "position": "top",
        "lines": 8
      },
      {
        "id": "question48",
        "type": "text_area",
        "label": "48. Can you recall a funny or embarrassing story from back in your day that you still laugh about?",
        "position": "bottom",
        "lines": 7
      }
    ],
    "description": "Interactive page with two questions: Question 47 asks about clever lines to diss someone (with paint splatter decoration), and Question 48 asks to recall a funny or embarrassing story (with breakdancer silhouette decoration). Both questions have multiple blank lines for written responses.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 49,
    "fileName": "49.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_49",
        "type": "text_area",
        "label": "49. If you could challenge any artist to a dance off, who would it be?",
        "position": "top"
      },
      {
        "id": "question_50",
        "type": "text_area",
        "label": "50. What is the nicest thing a Hip-Hop legend or artist has ever done for you?",
        "position": "bottom"
      }
    ],
    "description": "Interactive questionnaire page with two hip-hop themed questions (49 and 50) about challenging artists to a dance off and experiences with hip-hop legends. Each question has multiple blank lines for written responses. Decorated with music note graphics at top and a microphone illustration at bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 50,
    "fileName": "50.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_51",
        "type": "long_text",
        "label": "What, if any, is the best advice that a Hip-Hop legend or artist has ever given you?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_52",
        "type": "long_text",
        "label": "Do you have any humorous stories that you heard about or personally know about your favorite artists?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Interactive journal page with two questions about hip-hop advice and humorous stories about favorite artists. Contains multiple blank lines for written responses. Features a purple paint splatter graphic at top right and a pink crown graphic at bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 51,
    "fileName": "51.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_52_continuation",
        "type": "text_area",
        "label": "52. Continued...",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_53",
        "type": "text_area",
        "label": "53. In the early years, women in Hip-Hop played a crucial and invaluable role in shaping the genre. What do you believe is the most significant contribution they made? Additionally, who are your favorites?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "A page containing two questions about Hip-Hop: a continuation of question 52 with blank lines for response, and question 53 asking about women's contributions to early Hip-Hop and favorite artists. Multiple blank lines are provided for written responses to both questions. The page includes decorative elements - a pink paint splatter at the top right and a purple silhouette of a person jumping at the bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 52,
    "fileName": "52.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_54",
        "type": "text_lines",
        "label": "54. After the eighties, who were your top five (or more) women artists or groups? Who are they now?",
        "position": "top",
        "lines": 6
      },
      {
        "id": "question_55",
        "type": "text_lines",
        "label": "55. Who do you consider the top five (or more) \"baddest\" women artists in Hip-Hop and R&B?",
        "position": "bottom",
        "lines": 9
      }
    ],
    "description": "Interactive page with two questions about women artists in music. Question 54 asks about top women artists/groups after the eighties (then and now). Question 55 asks about the top 'baddest' women artists in Hip-Hop and R&B. Each question has multiple blank lines for responses. Page includes decorative purple splatter graphic at top right and pink spray can graphic at bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 53,
    "fileName": "53.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_56",
        "type": "text_area",
        "label": "Who are your favorite male Hip-Hop and R&B artists today?",
        "position": "top",
        "lines": 6
      },
      {
        "id": "question_57",
        "type": "text_area",
        "label": "Did you choose a career in Rap or Hip-Hop? If so, how are you contributing to the genre? If not, what are you doing today instead?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Page 53 contains two questions about Hip-Hop and R&B music preferences and career choices, with multiple blank lines provided for written responses. The page includes decorative elements: a purple paint splatter graphic at the top right and a purple silhouette of a break dancer at the bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 54,
    "fileName": "54.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_58",
        "type": "text_area",
        "label": "58. If you chose a career in Rap or Hip-Hop, what were some of the challenges you faced?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_59",
        "type": "text_area",
        "label": "59. Were there any particular family members or friends who encouraged and believed in you during those challenges?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Page 54 contains two open-ended questions about challenges faced in a rap or hip-hop career (question 58) and support from family and friends during those challenges (question 59). Each question has multiple blank lines for written responses. The page includes decorative musical note graphics near question 58 and a microphone graphic at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 55,
    "fileName": "55.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_60",
        "type": "textarea",
        "label": "60. How did you overcome those challenges?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_61",
        "type": "textarea",
        "label": "61. Who are your favorite Hip-Hop producers?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "A journal page with two questions about overcoming challenges and favorite Hip-Hop producers. The page includes a pink paint splatter graphic at the top right and a pink 'Hip Hop' graffiti-style graphic at the bottom left. Multiple blank lines are provided for written responses to each question.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 56,
    "fileName": "56.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_62",
        "type": "text_area",
        "label": "Has Hip-Hop influenced your view on diversity and inclusion? If so, how?",
        "position": "top"
      },
      {
        "id": "question_63",
        "type": "text_area",
        "label": "Have there been any songs or specific artists that aided you in finding your voice and shaping your identity? If so, which ones?",
        "position": "bottom"
      }
    ],
    "description": "Page 56 contains two reflection questions about hip-hop's influence on diversity/inclusion views and artists that helped shape identity. Each question has 7 blank lines for written responses. A cassette tape icon appears at the bottom, and pink musical notes decorate question 62.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 57,
    "fileName": "57.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_64",
        "type": "text_area",
        "label": "64. How do you feel about the storytelling aspect of Hip-Hop? Have you ever written your own stories?",
        "position": "top"
      },
      {
        "id": "question_65",
        "type": "text_area",
        "label": "65. Do you remember a time when Hip-Hop brought the people in your community together?",
        "position": "bottom"
      }
    ],
    "description": "Page 57 contains two reflection questions about Hip-Hop storytelling and community building, with multiple blank lines provided for written responses. Decorative graphics include a pink paint splatter at top right and a purple graffiti-style design at bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 58,
    "fileName": "58.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question66_response",
        "type": "textarea",
        "label": "66. Did Hip-Hop make you more active in your community? If so, what changes did you make and how did you improve things for the better?",
        "lines": 7
      },
      {
        "id": "question67_response",
        "type": "textarea",
        "label": "67. What do (or did) you like the most about your generation of Hip-Hop?",
        "lines": 8
      }
    ],
    "description": "Interactive page with two reflection questions about Hip-Hop's impact on community involvement (question 66) and favorite aspects of the respondent's generation of Hip-Hop (question 67). Each question has multiple blank lines for written responses. Page includes decorative music note graphics and Hip-Hop graffiti-style logo.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 59,
    "fileName": "59.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_68",
        "type": "text_area",
        "label": "68. What is your go-to favorite Hip-Hop karaoke song?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_69",
        "type": "text_area",
        "label": "69. Has Hip-Hop lead you to explore other genres of music? If so, which ones?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Page 59 contains two Hip-Hop related questions with multiple blank lines for written responses. Question 68 asks about favorite Hip-Hop karaoke songs, and question 69 asks about music genre exploration inspired by Hip-Hop. The page includes decorative elements: a purple paint splatter graphic at the top right and a pink crown illustration at the bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 60,
    "fileName": "60.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_70",
        "type": "textarea",
        "label": "70. What Dirty South artists, if any, do you feel contributed to Hip-Hop music?",
        "position": "top"
      },
      {
        "id": "question_71",
        "type": "textarea",
        "label": "71. Who are (or were) your favorite West Coast artists?",
        "position": "bottom"
      }
    ],
    "description": "Page 60 contains two open-ended questions about hip-hop music. Question 70 asks about Dirty South artists' contributions to hip-hop, and Question 71 asks about favorite West Coast artists. Each question has multiple blank lines for written responses. The page includes decorative elements: pink headphones icon in the top right and a purple drip design in the bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 61,
    "fileName": "61.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_72",
        "type": "multi-line text",
        "label": "72. Do you believe that Hip-Hop has promoted positive change in the world? If so, how?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_73",
        "type": "multi-line text",
        "label": "73. As classic Hip-Hop has evolved, what artists or groups do you feel have positively impacted the music? How?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Page 61 contains two open-ended questions about Hip-Hop's positive impact on the world and artists who have positively influenced the evolution of classic Hip-Hop. Each question has multiple blank lines for written responses. The page includes decorative music note icons at the top and a cassette tape icon at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 62,
    "fileName": "62.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_74_lines",
        "type": "text_lines",
        "label": "74. What artist or group, if any, do you believe is over-hyped or has negatively impacted the music? If so, who and how?",
        "position": "top",
        "lineCount": 7
      },
      {
        "id": "question_75_lines",
        "type": "text_lines",
        "label": "75. Back in your day, when you were frustrated or facing hardships what Hip-Hop songs matched your energy? How about today?",
        "position": "bottom",
        "lineCount": 8
      }
    ],
    "description": "Interactive page with two hip-hop related questions. Question 74 asks about over-hyped artists or groups and their negative impact. Question 75 asks about hip-hop songs that matched the reader's energy during hardships, both in the past and present. Each question has multiple blank lines for written responses. Page includes decorative elements: a paint splatter graphic at top and a purple microphone icon at bottom. Page number 62.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 63,
    "fileName": "63.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_76",
        "type": "multi-line text area",
        "label": "76. In your borough or state, which artists or DJs are you most proud of for their contribution to Rap or Hip-Hop?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_77",
        "type": "multi-line text area",
        "label": "77. Who are your favorite beatbox artists? Please name one or more.",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Page 63 contains two questions with multiple blank lines for answers. Question 76 asks about local artists/DJs proud of for their contribution to Rap or Hip-Hop. Question 77 asks about favorite beatbox artists. Decorative purple paint splatter graphic at top and pink DJ equipment graphic at bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 64,
    "fileName": "64.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_78",
        "type": "text_area",
        "label": "78. Regarding sampling, which artist of your generation was sampled the most?",
        "position": "top"
      },
      {
        "id": "question_79",
        "type": "text_area",
        "label": "79. What rapper, if any, influenced you to become, or want to become, a rapper? How?",
        "position": "bottom"
      }
    ],
    "description": "Page 64 contains two questions about music sampling and rap influences, with blank lines provided for written responses. The page includes decorative music note graphics at the top right and a crown graphic at the bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 65,
    "fileName": "65.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_80_response",
        "type": "text_area",
        "label": "80. Like Mt. Rushmore, if there were a Mt. EASTmore of Hip-Hop, who would you choose?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_81_response",
        "type": "text_area",
        "label": "81. Who would you choose for Mt. WESTmore of Hip-Hop?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Page 65 contains two hip-hop related questions about creating hypothetical Mt. Rushmore-style monuments for East Coast and West Coast hip-hop artists. The page includes decorative hip-hop themed graphics - a paint splatter at the top and graffiti-style 'Hip Hop' text at the bottom. Multiple blank lines are provided under each question for written responses.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 66,
    "fileName": "66.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_82",
        "type": "long_text",
        "label": "82. Who would you choose for a Mt. LADIES-ONLYmore of Hip-Hop?",
        "position": "top",
        "lines": 8
      },
      {
        "id": "question_83",
        "type": "long_text",
        "label": "83. In your generation, which local DJs made the biggest impact on Hip-Hop?",
        "position": "bottom",
        "lines": 8
      }
    ],
    "description": "Page 66 containing two questions about Hip-Hop: Question 82 asks about choosing for a Mt. LADIES-ONLY of Hip-Hop, and Question 83 asks about influential local DJs. Each question has multiple blank lines for written responses. The page includes decorative music note graphics at the top right and a dancing figure silhouette at the bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 67,
    "fileName": "67.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_84",
        "type": "multiline_text",
        "label": "84. As a DJ, what were/are your favorite songs to play at a club?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "question_85",
        "type": "multiline_text",
        "label": "85. Ha-haaa!!! We threw in a trivia question here... What was the first official Hip-Hop love song? (Hint: It came out in the late eighties.) Who was the artist?",
        "position": "bottom",
        "lines": 4
      }
    ],
    "description": "This page contains two questions: Question 84 asks about favorite DJ songs to play at clubs with 7 blank lines for response. Question 85 is a trivia question about the first official Hip-Hop love song from the late eighties, with 4 blank lines for the answer. The page includes decorative elements like a paint splatter graphic at the top and a thought bubble graphic at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 68,
    "fileName": "68.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_86",
        "type": "text_lines",
        "label": "86. What are your favorite Hip-Hop love songs today?",
        "position": "top",
        "numberOfLines": 7
      },
      {
        "id": "question_87",
        "type": "text_lines",
        "label": "87. Who are your favorite women artists in Hip-Hop today?",
        "position": "bottom",
        "numberOfLines": 8
      }
    ],
    "description": "Journal page with two questions about Hip-Hop music preferences: favorite love songs and favorite women artists. Features decorative elements including a pink paint splatter graphic at top right and a purple breakdancer silhouette at bottom left. Multiple blank lines provided for written responses to each question.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 69,
    "fileName": "69.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "playlist_lines",
        "type": "textarea",
        "label": "88. What's on your playlist today?",
        "position": "top",
        "lines": 7
      },
      {
        "id": "graffiti_artist_lines",
        "type": "textarea",
        "label": "89. Who was your favorite graffiti artist? Do you have a favorite today?",
        "position": "bottom",
        "lines": 7
      }
    ],
    "description": "Journal page with two questions: one about current music playlist (question 88) with 7 blank lines for response, and another about favorite graffiti artists past and present (question 89) with 7 blank lines. Decorated with purple headphones icon at top and pink microphone icon at bottom. Page number 69.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 70,
    "fileName": "70.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_90",
        "type": "long_text",
        "label": "90. In your opinion, what ignited the legendary beef between Drake and Kendrick Lamar?",
        "position": "top",
        "lines": 6
      },
      {
        "id": "question_91",
        "type": "long_text",
        "label": "91. How did it impact your perception of them?",
        "position": "bottom",
        "lines": 7
      }
    ],
    "description": "A journal page with two questions about the Drake and Kendrick Lamar beef, featuring a crown icon at the top and a dancing figure silhouette at the bottom. Question 90 asks about what ignited the legendary beef, and question 91 asks how it impacted the reader's perception of them. Each question has multiple blank lines for written responses.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 71,
    "fileName": "71.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "q92_lines",
        "type": "multi-line text",
        "label": "92. What specific lyrics from their diss tracks stood out the most to you?",
        "position": "top"
      },
      {
        "id": "q93_lines",
        "type": "multi-line text",
        "label": "93. Who have you determined the winner, and which song led you to that conclusion?",
        "position": "bottom"
      }
    ],
    "description": "Page 71 contains two questions about diss track lyrics and determining a winner. Question 92 has 6 blank lines for responses, and Question 93 has 7 blank lines. The page features a pink paint splatter graphic at the top and purple headphones icon at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 72,
    "fileName": "72.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question94_response",
        "type": "textarea",
        "label": "94. Did the opinion of those in your inner-circle match yours, or were there drastic differences?",
        "position": "top",
        "lines": 8
      },
      {
        "id": "question95_response",
        "type": "textarea",
        "label": "95. Do rivalries benefit or negatively impact Hip-Hop and the overall culture?",
        "position": "bottom",
        "lines": 7
      }
    ],
    "description": "Page 72 containing two reflection questions about hip-hop culture: question 94 about inner-circle opinions on a topic and question 95 about the impact of rivalries in hip-hop. Each question has multiple blank lines for written responses. Decorative graffiti-style graphics appear at top right and bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 73,
    "fileName": "73.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_96",
        "type": "multi-line text",
        "label": "96. What would you say are some of the most iconic beefs in Hip-Hop?",
        "position": "top"
      },
      {
        "id": "question_97",
        "type": "multi-line text",
        "label": "97. Considering this year as the year of enlightenment, what breaking news about an artist you admired changed your perception of them?",
        "position": "bottom"
      }
    ],
    "description": "Two open-ended questions about hip-hop culture - one about iconic beefs/rivalries and another about changing perceptions of admired artists. Each question has multiple blank lines for written responses. Page includes decorative headphone icon (top right) and microphone icon (bottom left).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 74,
    "fileName": "74.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_98_line_1",
        "type": "text",
        "label": "Question 98 response line 1",
        "position": "below question 98"
      },
      {
        "id": "question_98_line_2",
        "type": "text",
        "label": "Question 98 response line 2",
        "position": "below question 98"
      },
      {
        "id": "question_98_line_3",
        "type": "text",
        "label": "Question 98 response line 3",
        "position": "below question 98"
      },
      {
        "id": "question_98_line_4",
        "type": "text",
        "label": "Question 98 response line 4",
        "position": "below question 98"
      },
      {
        "id": "question_98_line_5",
        "type": "text",
        "label": "Question 98 response line 5",
        "position": "below question 98"
      },
      {
        "id": "question_99_line_1",
        "type": "text",
        "label": "Question 99 response line 1",
        "position": "below question 99"
      },
      {
        "id": "question_99_line_2",
        "type": "text",
        "label": "Question 99 response line 2",
        "position": "below question 99"
      },
      {
        "id": "question_99_line_3",
        "type": "text",
        "label": "Question 99 response line 3",
        "position": "below question 99"
      },
      {
        "id": "question_99_line_4",
        "type": "text",
        "label": "Question 99 response line 4",
        "position": "below question 99"
      },
      {
        "id": "question_99_line_5",
        "type": "text",
        "label": "Question 99 response line 5",
        "position": "below question 99"
      },
      {
        "id": "question_99_line_6",
        "type": "text",
        "label": "Question 99 response line 6",
        "position": "below question 99"
      },
      {
        "id": "question_99_line_7",
        "type": "text",
        "label": "Question 99 response line 7",
        "position": "below question 99"
      }
    ],
    "description": "Page 74 of a Hip-Hop themed questionnaire with two open-ended questions: Question 98 asks about artists representing old-school and new-school Hip-Hop, with 5 blank lines for response. Question 99 asks how the respondent's role as a Hip-Hop fan contributes to the culture, with 7 blank lines for response. Decorative elements include a hip-hop dancer silhouette at top right and a chain necklace with dollar sign at bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 75,
    "fileName": "75.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_100_response",
        "type": "text_area",
        "label": "100. And finally, when did you realize that you ARE Hip-Hop?",
        "position": "center"
      }
    ],
    "description": "Final question page (100) asking when the reader realized they ARE Hip-Hop, with multiple blank lines for writing a response. Features purple music notes decoration at top right and pink Hip-Hop graffiti-style text at bottom left.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 76,
    "fileName": "76.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page displaying 8 hip hop quotes from various artists including Remy Ma, Young M.A., Queen Latifah, Missy Elliott, N.O.R.E., Lil Wayne, Kool Moe Dee, and Jay-Z. The page has a 'BONUS' badge icon at the top left and the title '50 Hip Hop Quotes' in purple text. Each quote is numbered and attributed to its speaker.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 77,
    "fileName": "77.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 77 containing a collection of inspirational rap quotes from various hip-hop artists including Nas, Big Sean, Tupac Shakur, Rakim, Nicki Minaj, Drake, Common, Snoop Dogg, Kendrick Lamar, Pop Smoke, Post Malone, and Ice Cube. Each quote is numbered from 9-20 and attributed to its respective artist.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 78,
    "fileName": "78.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 78 containing a collection of inspirational and motivational quotes from various hip-hop artists and rappers, numbered 21-30. Each quote is attributed to its respective artist including J. Cole, Eminem, LL Cool J, DMX, Cardi B, Kanye West, Big Pun, KRS-One, Run-D.M.C., and Chuck D.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 79,
    "fileName": "79.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A collection of 10 inspirational quotes (numbered 31-40) from various hip-hop artists and rappers including Fat Joe, Mac Miller, Kodak Black, Chance the Rapper, Vanilla Ice, Doug E. Fresh, Nipsey Hussle, Grandmaster Kaz, Biggie (The Notorious B.I.G.), and Polo G. The quotes cover themes of risk-taking, living life fully, peace of mind, self-protection, authenticity, truth, power of communication, following one's heart, and turning struggle into strength.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 80,
    "fileName": "80.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 80 containing inspirational quotes from hip-hop artists and musicians, numbered 41-50. Quotes are from Lauryn Hill, Lil Baby, Megan Thee Stallion, 50 Cent, Method Man, Macklemore, Ed Lover, A$AP Rocky, DJ Marley Marl, and DJ Kool Herc. Each quote is followed by the artist's name in bold.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 81,
    "fileName": "81.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page containing trivia questions 1-9 about hip-hop history and culture, including questions about the Godfather of Hip-Hop, DJ Kool Herc's first block party, N.W.A, and various hip-hop artists. The page has a 'BONUS' badge icon and 'Trivia Questions 1-25' header.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 82,
    "fileName": "82.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 82 containing Hip-Hop trivia questions numbered 10-21, covering topics like Grammy Awards, artists, albums, and Hip-Hop history and culture.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 83,
    "fileName": "83.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 83 contains four Hip-Hop trivia questions numbered 22-25, asking about a legendary producer who worked with Nas/Jay-Z/Alicia Keys, the dance associated with Soulja Boy's 'Crank That', who sang 'I Like Big Butts' in the early '90s, and the significance of August 11, 1973 in Hip-Hop history.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 84,
    "fileName": "84.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page showing trivia answers numbered 1-25, specifically displaying answers 1-12. Includes a bonus badge icon and header 'Trivia Answers 1-25'. Answers cover hip-hop music trivia including artists like DJ Kool Herc, N.W.A, Mary J. Blige, Nas, Eminem, Cardi B, Public Enemy, and OutKast.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 85,
    "fileName": "85.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A numbered list (items 13-25) containing hip-hop related entries including song titles, artist names, albums, and historical references. Appears to be part of a quiz, trivia game, or educational content about hip-hop history.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 86,
    "fileName": "86.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page containing bonus trivia questions 26-34 about hip-hop and rap music. Questions cover topics including rappers' real names, album titles, record labels, and notable hip-hop groups. The page has a decorative 'BONUS' badge icon at the top with 'Trivia Questions 26-50' as the header.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 87,
    "fileName": "87.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Quiz or trivia page containing 11 hip-hop and rap music questions numbered 35-45, covering topics like song samples, album titles, artist names, and music history facts.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 88,
    "fileName": "88.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 88 containing five hip-hop trivia questions numbered 46-50, asking about Wu-Tang Clan's 36 Chambers, Drake's Hotline Bling, Beastie Boys' debut album, Master P's songs, and a Golden State Warrior reference.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 89,
    "fileName": "89.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Answer key page showing trivia answers numbered 26-50, including topics like 50 Cent, hip-hop artists, record labels, and song titles. Page includes a 'BONUS' logo graphic at the top.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 90,
    "fileName": "90.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A numbered list (items 38-50) of hip-hop artists and related terms, including Snoop Dogg, Jay-Z, Benjamin Haggerty, 2Pac, Lil Wayne, Drake, Master P, MC Hammer, and references to songs/albums like 'The College Dropout', '36 Chambers', and 'Licensed to Ill'.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 91,
    "fileName": "91.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Title page featuring 'Hip-Hop Time Capsule' header with tagline 'Document Your Personal Journey'. The main content shows 'DJ SCIPIO - THIS IS MY JOURNEY' in bold yellow text on a pink starburst shape against a purple background with graffiti-style effects. Page number 91 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 92,
    "fileName": "92.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "name",
        "type": "text",
        "label": "MY NAME IS:",
        "position": "center"
      },
      {
        "id": "birthplace",
        "type": "text",
        "label": "I WAS BORN AND RAISED IN",
        "position": "center"
      },
      {
        "id": "dob",
        "type": "text",
        "label": "MY D.O.B IS:",
        "position": "center"
      }
    ],
    "description": "This is a fill-in-the-blank introduction page with a hip-hop theme. It shows example answers for 'Hilton Scipio' who was born in 'Harlem and the Bronx' with D.O.B listed as 'PRIVATE'. The page includes hip-hop cultural keywords at the top (rap, DJ'ing, culture, flow, style, lyrics, rhymes, graffiti, b-boy, fashion, beatboxing, sampling) and concludes with 'I LOVE HIP-HOP AND THIS IS MY JOURNEY.' at the bottom with a microphone illustration.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 93,
    "fileName": "93.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question1_answer",
        "type": "text_bubble",
        "label": "1. When did you first discover Hip-Hop music?",
        "position": "top",
        "example_answer": "I first discovered Hip-Hop in 1976."
      },
      {
        "id": "question2_answer",
        "type": "text_bubble",
        "label": "2. Do you remember where you were?",
        "position": "bottom",
        "example_answer": "The first time I discovered Hip-Hop, I was in school. I traded a cassette tape with one of my classmates."
      }
    ],
    "description": "Interactive questionnaire page with two questions about discovering Hip-Hop music. Each question has a numbered speech bubble (1 and 2 in magenta circles) with example answers provided. Questions ask about when and where the reader first discovered Hip-Hop. Page is attributed to @DJ SCIPIO at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 94,
    "fileName": "94.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 94 showing questions 3 and 4 of an interview with DJ Scipio. Question 3 asks about the first song that caught their attention, with the answer being 'Apache' by The Incredible Bongo Band (includes a QR code). Question 4 asks about emotions felt hearing Hip-Hop for the first time, with the answer describing it as a soulful experience. The page features numbered circular badges (3 and 4) and response bubbles in a conversational format.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 95,
    "fileName": "95.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 95 contains two Q&A sections. Question 5 asks about the hottest/illest MCs, with the answer listing Kool Moe Dee, Melle Mel, GrandMaster Caz, Nas, Jay Z, and Jada Kiss. Two QR codes are displayed linking to songs by Nas and Jay-Z. Question 6 asks if Hip-Hop inspired the person to become a DJ/rapper/dancer, with the answer explaining they were already a DJ playing Soul, Disco, and Funk, but the cutting and scratching style of GrandMaster Flash and GrandWizard Theodore inspired them to become a Hip-Hop DJ.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 96,
    "fileName": "96.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Interview-style Q&A page featuring questions 7 and 8 about Hip-Hop's role in the author's social circles and inspirational songs. Question 7 discusses teaming up with DJ Jazzy G and practicing mixing skills. Question 8 lists three songs that provided confidence: 'The Message' by GrandMaster Flash and the Furious Five, 'Self Destruction' by KRS-1, and 'Yes We Can Can' by The Treacherous Three. Includes a QR code and attribution to @DJ SCIPIO.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 97,
    "fileName": "97.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page containing questions 9 and 10 about hip-hop history. Question 9 asks about top five hottest jams/concerts with an answer about venues in the Boogie Down Bronx. Question 10 asks about top DJs who impacted Hip-Hop, listing numerous influential DJs including Disco King Mario, DJ Kool Herc, Grandmaster Flash, and others, with special mention of Frankie Crocker's role. The page includes three QR codes at the bottom linking to '52 Beats' by Kid Capri, DJ Kayslay content, and 'Old School Flava' by DJ Hollywood.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 98,
    "fileName": "98.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Q&A page with two questions and answers. Question 11 asks about favorite crew members to party with, answered with names like Greg Simpkins (G Money), Dave Brown (Kool Dave), Dwayne Murray Greene (Dee Money), Billy Robinson, and Curvas Moore (Q). Question 12 asks about top three old-school dances, with answer listing The Hustle, The Freak Dance, and The Bump from back in the day, and The Electric Slide for today.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 99,
    "fileName": "99.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Q&A page featuring questions 13 and 14 about hip-hop clubs and party songs. Question 13 asks about top five hip-hop clubs, with answer listing Disco Fever, T-Connection, The Stardust Ballroom, Club 371, and The Sparkle in the Bronx. Question 14 asks about top party songs that 'rocked the house', with answer listing 'Wild Wild West' by Kool Moe Dee, 'Planet Rock' by Afrika Bambaataa and Soulsonic Force, 'It Takes Two' by Rob Base & DJ E-Z Rock, 'Set It Off' by Strafe, and 'Jam On It' by Newcleus. Three QR codes are displayed at the bottom for 'Wild Wild West', 'Planet Rock', and 'Jam On It'. Page is credited to @DJ SCIPIO and numbered 99.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 100,
    "fileName": "100.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 100 containing questions 15 and 16 about hip-hop music. Question 15 asks about the first song the reader could fully recite, with an answer about 'The Message' by Grandmaster Flash and a QR code. Question 16 asks about the top five 'illiest' male artists or groups from the reader's era, with an answer listing The Treacherous Three, The L Brothers, The Cold Crush Brothers, Grandmaster Flash and The Furious Five, and Crash Crew. Two QR codes are included linking to songs 'White Lines' and 'High Power Rap'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 101,
    "fileName": "101.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Q&A page featuring questions 17 and 18. Question 17 asks about a concert/event regretted missing, with a detailed answer about the historic 1981 Busy Bee Starsky vs Kool Moe Dee MC battle at Harlem World. Three QR codes are shown linking to related videos. Question 18 asks about old school lines still recited, with a brief response stating inability to name specific lines or verses.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 102,
    "fileName": "102.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Q&A page containing questions 19 and 20 about DJ Scipio's favorite songs. Question 19 asks about favorite club songs, listing 11 tracks including 'Apache' by The Incredible Bongo Band and others. Question 20 asks about top five favorite Break Dance tracks for B-Boys, listing 5 songs including 'The Mexican' by Babe Ruth and 'Give It Up Turn It Loose' by James Brown. Page number 102 appears at bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 103,
    "fileName": "103.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Q&A page featuring questions 21 and 22. Question 21 asks about DJ equipment ownership, with answer describing Technic Turntables, Gemini Mixer, and Kenwood Amp. Question 22 asks about club violence, with answer describing an incident at The Valley in The Bronx with DJ Jazzy G and DJ Whiz Kid.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 104,
    "fileName": "104.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_23",
        "type": "multiple_choice",
        "label": "Have you ever been affected by the loss of an artist that you were a big fan of?",
        "position": "top",
        "response": "Yes, I have been affected by the loss of a Hip-Hop artist."
      },
      {
        "id": "question_24",
        "type": "text_response",
        "label": "If so, how were you specifically affected?",
        "position": "bottom",
        "response": "I was saddened by the loss of my friend, DJ Whiz Kid. Also, DJ Silverback and DJ Robert Randolph of Orangeburg, SC."
      }
    ],
    "description": "Interview-style Q&A page with questions 23 and 24 about being affected by the loss of hip-hop artists. Question 23 asks if the person has been affected, with a response about Hip-Hop artists. Question 24 asks how they were specifically affected, with a personal response mentioning DJ Whiz Kid, DJ Silverback, and DJ Robert Randolph. Page is attributed to @DJ SCIPIO and numbered 104.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 105,
    "fileName": "105.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page shows two survey questions (25 and 26) with their answers. Question 25 asks about doing something kind for a favorite artist, with answer stating they never had that opportunity. Question 26 asks which song lyrics they'd want to come true for a day, with answer 'If I Ruled The World' by Kurtis Blow. A QR code is displayed next to question 26.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 106,
    "fileName": "106.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_27",
        "type": "text_response",
        "label": "What Hip-Hop song do you hear and instantly remember exactly where you were and what you were doing?",
        "position": "top"
      },
      {
        "id": "question_28",
        "type": "text_response",
        "label": "Was there a Hip-Hop artist you had a crush on back in your day? If so, who? How about today?",
        "position": "bottom"
      }
    ],
    "description": "Page 106 contains two Hip-Hop related questions (27 and 28) with example answers and QR codes. Question 27 asks about a memorable Hip-Hop song with the example answer 'The Mexican' by Babe Ruth. Question 28 asks about having a crush on a Hip-Hop artist with the example answer Queen Latifah, with a QR code linking to 'Ladies First' by Queen Latifah ft. Monie Love.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 107,
    "fileName": "107.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Q&A page featuring questions 29 and 30 about favorite New York mixtape DJs and favorite B-Boys. Question 29 lists multiple DJ names including DJ Clue, DJ Kay Slay, DJ Ron G, and others. Question 30 mentions Cholly Rock, Trixl, Salsa and The Legendary Twins as favorite B-Boys.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 108,
    "fileName": "108.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_31",
        "type": "text_area",
        "label": "31. What record pool, if any, did you belong to?",
        "position": "top",
        "hasResponse": true,
        "response": "The Record Pools that I belonged to were Columbia Record Pool Paul Davis and Joe Rugby; Franchise Record Pool; Mr. Excitement; Digi Waxx Media and The Boogie Report Hit Music Dispatch."
      },
      {
        "id": "question_32",
        "type": "text_area",
        "label": "32. When you were on your way to a club; looking clean (or as we used to say) looking fresh, what were your favorite colognes, perfumes, or body oils to wear?",
        "position": "bottom",
        "hasResponse": true,
        "response": "My favorite cologne was Eygptian Musk."
      }
    ],
    "description": "Interview questions 31 and 32 with answers about record pool membership and favorite colognes. Questions are numbered with magenta circular badges (31 and 32). Responses are provided in gray rounded rectangles.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 109,
    "fileName": "109.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_33",
        "type": "text_area",
        "label": "33. Fashion is an integral part of Hip-Hop. Back in your day, what was your favorite Hip-Hop drip (or as we used to say) gear?",
        "position": "top",
        "hasResponse": true,
        "response": "My favorite Hip-Hop gear was a mock neck shirt and creased Lee Jeans."
      },
      {
        "id": "question_34",
        "type": "text_area",
        "label": "34. What was your sneaker or shoe game like? And now?",
        "position": "bottom",
        "hasResponse": true,
        "response": "My shoe game included British Walkers, Marshmallows, Grips, Ballys, and Adidas Sneakers. I don't have a shoe or sneaker game."
      }
    ],
    "description": "Two interview questions about hip-hop fashion and footwear with responses. Questions 33 and 34 discuss favorite hip-hop clothing/gear and sneaker choices then versus now. Each question has a numbered response bubble with the answer.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 110,
    "fileName": "110.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 110 contains two Q&A entries (questions 35 and 36). Question 35 asks about favorite party drinks with an answer about Budweiser and no longer drinking. Question 36 asks about artists/groups that influenced views on social issues and activism, with an answer listing Public Enemy, KRS-One, U.N.I.T.Y by Queen Latifah, and DMX. Two QR codes are included linking to 'U.N.I.T.Y by Queen Latifah' and 'Fight The Power by Public Enemy'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 111,
    "fileName": "111.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 111 contains questions 37 and 38 about hip-hop influences. Question 37 asks about artists whose life stories have inspired the reader, with an answer about DMX and the track 'Slippin'. Question 38 asks about Hip-Hop's contribution to personal growth, with an answer about Mobb Deep and 'Shook Ones'. Both answers include QR codes linking to the mentioned songs.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 112,
    "fileName": "112.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 112 showing questions 39 and 40 about rap writing experience. Question 39 asks 'When was the first time (if ever) that you tried to write your own rap?' with answer 'Does not apply. I never tried to write my own raps.' Question 40 asks 'Who or what inspired you to try, and how would you rate your skills?' with answer 'Does not apply. No one inspired me to write a rap.' Both answers are numbered with magenta circular badges (39 and 40). Page includes '@DJ SCIPIO' footer.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 113,
    "fileName": "113.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_41",
        "type": "text_display_with_qr",
        "label": "41. Have you ever met or worked with any of your favorite artists or legends in Hip-Hop?",
        "response": "Yes, I have met and worked with some of my favorite artists. Kool Moe Dee and I were sixth grade classmates. We both attended P.S. 129 in Harlem. I also met Queen Latifah, Prodigy of Mobb Deep, Run-DMC and Grandmaster Jay, Raekwon, T.I., Lil' Jon, Rasheeda, Scrappy, Scarface, Pastor Troy, Master P and many more.",
        "additionalContent": "QR code for 'Shook Ones' by Mobb Deep"
      },
      {
        "id": "question_42",
        "type": "text_display",
        "label": "42. Who was the better lyricist: Biggie or Tupac?",
        "response": "No comment..."
      }
    ],
    "description": "Q&A page featuring questions 41 and 42 about meeting hip-hop artists and comparing Biggie vs Tupac. Includes a QR code linking to 'Shook Ones' by Mobb Deep. The respondent diplomatically declines to answer the Biggie vs Tupac question.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 114,
    "fileName": "114.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_43",
        "type": "text_area",
        "label": "43. What were your thoughts on the infamous East Coast vs. West Coast War? Did you choose a side?",
        "position": "top",
        "response": "No comment."
      },
      {
        "id": "question_44",
        "type": "text_area",
        "label": "44. If you could have fifteen minutes with your favorite Hip-Hop legend or artist, who would it be and what would you say?",
        "position": "bottom",
        "response": "If I had fifteen minutes with my favorite Hip-Hop Legend, it would be Mary J. Blige. I would commend her on all of her accomplishments and ask her, \"What are your plans for the evening?\" LOL!"
      }
    ],
    "description": "Page 114 containing two questions (43 and 44) with responses. Question 43 about East Coast vs West Coast hip-hop rivalry has a brief 'No comment' response. Question 44 about meeting a hip-hop legend has a detailed response about Mary J. Blige. Both responses are shown in numbered circular badges (43 and 44).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 115,
    "fileName": "115.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_45",
        "type": "text_area",
        "label": "If you could spend the whole day with your favorite Hip-Hop legend or artist, who would it be and what plans would you make?",
        "position": "top",
        "example_answer": "If I could spend the whole day with my favorite Hip-Hop legend/artist, I would choose Queen Latifah. We would go to the studio together and produce a track."
      },
      {
        "id": "question_46",
        "type": "text_area",
        "label": "If you could have a rap battle with any of your favorite artists, who would you choose?",
        "position": "bottom",
        "example_answer": "I would have a rap battle with Jay Z."
      }
    ],
    "description": "Interactive page with questions 45 and 46 about Hip-Hop preferences. Question 45 asks about spending a day with a favorite Hip-Hop artist (with Queen Latifah example). Question 46 asks about having a rap battle with a favorite artist (with Jay Z example).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 116,
    "fileName": "116.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_47",
        "type": "text_area",
        "label": "What clever lines would you use to diss them?",
        "position": "top"
      },
      {
        "id": "question_48",
        "type": "text_area",
        "label": "Can you recall a funny or embarrassing story from back in your day that you still laugh about?",
        "position": "bottom"
      }
    ],
    "description": "Page 116 contains two questions (47 and 48). Question 47 asks about clever diss lines with a humorous response example. Question 48 asks to recall a funny or embarrassing story, with DJ Scipio's example about a friend's outfit getting ripped during a park jam incident in The Bronx.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 117,
    "fileName": "117.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 117 contains two Q&A sections. Question 49 asks who the reader would challenge to a dance-off, with the answer being Fred Sanford of Sanford and Son. Question 50 asks about the nicest thing a Hip-Hop legend has done, with a detailed story about meeting T.I. at a record store in Columbia, S.C. in 2003. The page is attributed to @DJ SCIPIO at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 118,
    "fileName": "118.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Q&A page featuring questions 51 and 52. Question 51 asks about the best advice from a Hip-Hop legend, with the answer mentioning Master P's advice to 'keep moving forward' in the mixtape game. Question 52 asks about humorous stories regarding favorite artists, with a brief negative response. Page is attributed to @DJ_SCIPIO and numbered 118.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 119,
    "fileName": "119.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 119 contains two Q&A entries (questions 53 and 54) about women in Hip-Hop. Question 53 discusses early women's contributions to Hip-Hop and lists favorites including The Sequence, Queen Latifah, Roxanne Shante, ShaRock, Debbie D., and Missy Elliott. It includes a QR code linking to 'Lose Control' by Missy Elliot ft. Ciara. Question 54 asks about top five women artists after the eighties, with an answer listing Salt-n-Pepa, Lil' Kim, MC Lyte, Remy Ma and Lady of Rage, noting they remain the same today.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 120,
    "fileName": "120.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 120 containing two Q&A responses (questions 55 and 56) about favorite Hip-Hop and R&B artists. Question 55 lists top female artists with three QR codes linking to songs by Mary J. Blige, Beyonce, and Aaliyah. Question 56 lists favorite male Hip-Hop/R&B artists with one QR code linking to a Keith Sweat song.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 121,
    "fileName": "121.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_57",
        "type": "text_area",
        "label": "57. Did you choose a career in Rap or Hip-Hop? If so, how are you contributing to the genre? If not, what are you doing today instead?",
        "position": "top"
      },
      {
        "id": "question_58",
        "type": "text_area",
        "label": "58. If you chose a career in Rap or Hip-Hop, what were some of the challenges you faced?",
        "position": "bottom"
      }
    ],
    "description": "Page 121 featuring questions 57 and 58 about careers in Rap/Hip-Hop. Question 57 has a sample answer about choosing a career in rap to avoid a boring 9-to-5 job. Question 58 has a sample answer about facing criticism from older generations who didn't understand the new style of cutting and scratching records.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 122,
    "fileName": "122.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Interview-style Q&A page featuring questions 59 and 60 about support systems and overcoming challenges. Question 59 asks about family/friends who provided encouragement, answered by mentioning brother Stanley Scipio, friend Greg Simpkins, and nephew Kevin Bush - all DJs who understood the challenges. Question 60 asks how challenges were overcome, with the answer explaining determination and refusal to give up on the new DJ style. Page includes numbered circular icons (59 and 60) and is attributed to @DJ_SCIPIO at bottom. Page number 122.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 123,
    "fileName": "123.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Q&A page featuring questions 61 and 62. Question 61 asks about favorite Hip-Hop producers, with an answer listing Swizz Beatz, Timbaland, DJ Marley Marl, Ski Beatz, Dr. Dre, Jazzy Pha, Dark Child, Rodney Jenkins, D-Rock, The One Hand Producer, C-Minor, Uncle Marvelous and Skitzo. Question 62 asks if Hip-Hop influenced views on diversity and inclusion, with an affirmative answer about everyone having a story to tell. Page is numbered 123 and credited to @DJ_SCIPIO at bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 124,
    "fileName": "124.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_63_response",
        "type": "text_area",
        "label": "63. Have there been any songs or specific artists that aided you in finding your voice and shaping your identity? If so, which ones?",
        "position": "top",
        "hasResponse": true,
        "responseText": "Yes. The particular artists that helped me find my voice and my own identity was the group Public Enemy."
      },
      {
        "id": "question_64_response",
        "type": "text_area",
        "label": "64. How do you feel about the storytelling aspect of Hip-Hop? Have you ever written your own stories?",
        "position": "bottom",
        "hasResponse": true,
        "responseText": "The storytelling aspect of Hip-Hop was a great contribution. No, I have not written my story yet, but it may be coming soon."
      }
    ],
    "description": "Page 124 containing questions 63 and 64 about hip-hop influences and storytelling, with handwritten-style responses provided. Question 63 discusses Public Enemy's influence, and question 64 discusses storytelling in hip-hop with a note about potentially writing a story in the future. Authored by DJ Scipio.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 125,
    "fileName": "125.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_65_response",
        "type": "text_area",
        "label": "65. Do you remember a time when Hip-Hop brought the people in your community together?",
        "position": "top",
        "prefilledAnswer": "Yes, when someone in the community passed away, we would celebrate their life with a block party. We would get together, have some food and play their favorite songs."
      },
      {
        "id": "question_66_response",
        "type": "text_area",
        "label": "66. Did Hip-Hop make you more active in your community? If so, what changes did you make and how did you improve things for the better?",
        "position": "bottom",
        "prefilledAnswer": "Yes, as a DJ, I contributed to the community by organizing fundraisers and 'Back-to-School' drives. Many adults and children needed financial help and it made a difference for them."
      }
    ],
    "description": "Page 125 of a Hip-Hop questionnaire featuring questions 65 and 66 about community engagement through Hip-Hop, with pre-filled responses from DJ Scipio. Question 65 asks about times Hip-Hop brought the community together, and question 66 asks about community activism inspired by Hip-Hop.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 126,
    "fileName": "126.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 126 contains two Q&A entries about Hip-Hop. Question 67 asks what the respondent liked most about their generation of Hip-Hop, with an answer emphasizing the fun, positive nature and focus the music provided. Question 68 asks about their favorite Hip-Hop karaoke song, with the answer being 'Rapper's Delight' by Sugar Hill Gang. A QR code is included linking to the song.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 127,
    "fileName": "127.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 127 contains questions 69 and 70 about Hip-Hop's influence on exploring other music genres. Question 69 asks if Hip-Hop led to exploring other genres, with an answer mentioning West Coast, Dirty South Music and Southern Soul Music. Question 70 asks which Dirty South artists contributed to Hip-Hop music, with an answer listing OutKast, Goodie Mob, T.I., UGK, The Geto Boys, Lil' Flip, Lil Jon, Master P and Scarface. Three QR codes at the bottom link to songs: 'My Mind is Playing Tricks' by the Geto Boys, 'They Don't Dance No More' by Goodie Mob, and 'ATLiens' by Goodie Mob.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 128,
    "fileName": "128.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 128 contains two Q&A items (71 and 72) about West Coast hip-hop artists. Question 71 lists favorite artists including Tupac, Snoop Dogg, Ice Cube, and others, with three QR codes linking to songs. Question 72 asks about hip-hop's positive impact on the world, with a response about bringing different races and cultures together.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 129,
    "fileName": "129.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_73",
        "type": "text_response",
        "label": "73. As classic Hip-Hop has evolved, what artists or groups do you feel have positively impacted the music? How?",
        "position": "top",
        "response_provided": "The new artists that I feel have made a positive impact on the music are J. Cole, Kendrick Lamar, and Nipsey Hussle. I think they are more lyrical than some of the other new artists."
      },
      {
        "id": "question_74",
        "type": "text_response",
        "label": "74. What artist or group, if any, do you believe is over-hyped or has negatively impacted the music? If so, who and how?",
        "position": "bottom",
        "response_provided": "No comment."
      }
    ],
    "description": "Q&A page featuring two questions (73 and 74) about hip-hop artists' impact on the music, with provided responses. Question 73 discusses positive influences (J. Cole, Kendrick Lamar, Nipsey Hussle), while question 74 about negative impacts receives a 'No comment' response. Responses are displayed in circular numbered badges (73 and 74).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 130,
    "fileName": "130.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 130 contains two Q&A responses about Hip-Hop music preferences. Question 75 asks about Hip-Hop songs that match energy during frustration or hardship, with the answer listing songs by DMX, Bone Thugs-N-Harmony, Lil Jon, The Lox, and Onyx. Three QR codes link to 'Wild Out' by The Lox, 'Thug Luv' by Bone Thugs-N-Harmony ft. Tupac, and 'Party Up' by DMX. Question 76 asks about local artists/DJs, with response about DJ Whiz Kid from the Bronx, including a QR code labeled 'The Original Whiz Kid'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 131,
    "fileName": "131.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 131 contains two Q&A items (77 and 78) about beatbox artists and sampling. Question 77 asks about favorite beatbox artists with an answer listing Doug E. Fresh, The Fat Boys, and Biz Markie, accompanied by a QR code linking to 'Doug E. Fresh & Slick Rick - The Show'. Question 78 discusses James Brown as the most sampled artist and explains the history of sampling, with a QR code linking to 'Funky Drummer' by James Brown.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 132,
    "fileName": "132.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_79",
        "type": "text_area",
        "label": "79. What rapper, if any, influenced you to become, or want to become, a rapper? How?",
        "position": "top"
      },
      {
        "id": "question_80",
        "type": "text_area",
        "label": "80. Like Mt. Rushmore, if there were a Mt. EASTmore of Hip-Hop, who would you choose?",
        "position": "middle"
      }
    ],
    "description": "Two Q&A questions about hip-hop influences. Question 79 asks about rappers that influenced the reader to become a rapper (answered: no rapper influenced them). Question 80 asks about a Mt. Rushmore-style list of East Coast hip-hop artists (answered: Melle Mel, Kool Moe Dee, Grandmaster Caz, and DMX). Numbered questions 79 and 80, with answers in speech bubble-style text boxes.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 133,
    "fileName": "133.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_81",
        "type": "text_area",
        "label": "81. Who would you choose for Mt. WESTmore of Hip-Hop?",
        "position": "top",
        "hasExample": true,
        "exampleAnswer": "I would choose Snoop Dogg, Tupac, Ice Cube, and Ice-T."
      },
      {
        "id": "question_82",
        "type": "text_area",
        "label": "82. Who would you choose for a Mt. Ladies-Onlymore of Hip-Hop?",
        "position": "bottom",
        "hasExample": true,
        "exampleAnswer": "I would choose Queen Latifah, MC Lyte, Roxanne Shant and MC Sha-Rock."
      }
    ],
    "description": "Page 133 contains two interactive questions (81 and 82) about creating Mt. Rushmore-style lists for Hip-Hop artists. Question 81 asks about West Coast artists (Mt. WESTmore), and question 82 asks about female Hip-Hop artists (Mt. Ladies-Onlymore). Each question includes example answers in speech bubbles with numbered badges (81 and 82).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 134,
    "fileName": "134.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 134 contains two Q&A sections about Hip-Hop DJs. Question 83 asks about influential local DJs and lists names including DJ Shakim, DJ Prince Ice, DJ Al Sumter, and others. Question 84 asks about favorite songs to play at clubs, listing classic tracks from artists like Chic, Esther Williams, SYL Johnson, and others. The page includes three QR codes at the bottom linking to 'Play That Beat Mr. DJ', 'Funk You Up', and 'That's The Joint'. A note highlights that Sha-Rock is the first female Hip-Hop MC.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 135,
    "fileName": "135.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "favorite_hiphop_love_songs",
        "type": "text_area",
        "label": "What are your favorite Hip-Hop love songs today?",
        "position": "bottom_section"
      }
    ],
    "description": "Page 135 contains two Q&A entries (85 and 86). Question 85 asks about the first official Hip-Hop love song with the answer being 'I Need Love' by LL Cool J from 1987, including a QR code. Question 86 asks 'What are your favorite Hip-Hop love songs today?' with the answer 'I don't have any' and appears to have space for the reader to provide their own answer.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 136,
    "fileName": "136.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 136 contains two Q&A responses (questions 87 and 88). Question 87 asks about favorite women artists in Hip-Hop, listing artists like Beyonce, Sexy Red, Nicki Minaj, Angie Stone, Cardi B, Megan Thee Stallion, Saweetie and Latto, with a tribute to Angie Stone. Question 88 asks about current playlist favorites, listing songs by Kendrick Lamar, Cambatta, Black Magik 363, Saweetie, and GloRilla. Includes a QR code linking to 'Not Like Us' by Kendrick Lamar.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 137,
    "fileName": "137.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_89_answer",
        "type": "text_area",
        "label": "In your generation, who was your favorite graffiti artist? Do you have a favorite one today?",
        "position": "top"
      },
      {
        "id": "question_90_answer",
        "type": "text_area",
        "label": "In your opinion, what ignited the legendary beef between Drake and Kendrick Lamar?",
        "position": "bottom"
      }
    ],
    "description": "Page 137 with two questions (89 and 90) about graffiti artists and the Drake-Kendrick Lamar beef. Question 89 shows an example answer mentioning The Crazy Five, Blade, Seen, and BS119. Question 90 has an example answer about Kendrick's verse on 'Control'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 138,
    "fileName": "138.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_91",
        "type": "text_area",
        "label": "91. How did it impact your perception of them?",
        "position": "top"
      },
      {
        "id": "question_92",
        "type": "text_area",
        "label": "92. What specific lyrics from their diss tracks stood out the most to you?",
        "position": "middle"
      }
    ],
    "description": "A page with two questions about diss tracks and their impact. Question 91 asks about perception impact and shows 'No comment...' as the answer. Question 92 asks about specific lyrics and includes a detailed response about a Kendrick Lamar track. Questions are numbered 91 and 92 in magenta circles.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 139,
    "fileName": "139.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_93",
        "type": "text_area",
        "label": "93. Who have you determined the winner, and which song led you to that conclusion?",
        "position": "top",
        "currentValue": "No comment."
      },
      {
        "id": "question_94",
        "type": "text_area",
        "label": "94. Did the opinion of those in your inner-circle match yours, or were there drastic differences?",
        "position": "bottom",
        "currentValue": "Most people in my inner-circle agreed with my opinion, but others did not!"
      }
    ],
    "description": "Page 139 contains two questions (93 and 94) with response areas. Question 93 asks about determining a winner and which song led to that conclusion, with a 'No comment' response. Question 94 asks about whether inner-circle opinions matched the respondent's views, with an answer indicating mostly agreement but some disagreement. Both responses are shown in rounded rectangular response boxes with circular numbered badges (93 and 94).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 140,
    "fileName": "140.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 140 contains two Q&A items about Hip-Hop rivalries. Question 95 asks if rivalries benefit or negatively impact Hip-Hop culture, with an answer explaining they benefit the culture by showcasing lyrical skills. Question 96 asks about iconic Hip-Hop beefs, listing examples like Kool Moe Dee vs Busy Bee Starski, Jay-Z vs Nas, 50 Cent vs Ja Rule, and Tupac vs Biggie. Three QR codes are displayed at the bottom linking to content about 'The First battle in Hip-Hop by Busy Bee vs Kool Moe Dee', 'Beef 1 Busy Bee vs Kool Moe Dee', and 'Kool Moe Dee: Dissing Busy Bee 1981'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 141,
    "fileName": "141.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_97",
        "type": "text_area",
        "label": "97. Considering this year as the year of enlightenment, what breaking news about an artist you admired changed your perception of them?",
        "position": "top",
        "currentValue": "No comment..."
      },
      {
        "id": "question_98",
        "type": "text_area",
        "label": "98. Presently, which artists represent the best of both old-school and new-school Hip-Hop?",
        "position": "bottom",
        "currentValue": "Snoop Dogg, LL Cool J, 50 Cent, Eminem and Keith Sweat represent the best of old and new school Hip-Hop."
      }
    ],
    "description": "Page 141 contains two questions about hip-hop culture. Question 97 asks about news that changed perception of an admired artist (answered with 'No comment'). Question 98 asks about artists representing old and new school hip-hop (answered with Snoop Dogg, LL Cool J, 50 Cent, Eminem, and Keith Sweat). Each question has a numbered pink circle icon (97 and 98) and an answer bubble.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 142,
    "fileName": "142.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 142 containing questions 99-100 about Hip-Hop culture. Question 99 asks about fan contribution to the culture, with a response about breaking records as a DJ. Question 100 asks 'when did you realize that you ARE Hip-Hop?' with a detailed story about attending a first jam at The Boston Secor Center. The page includes three QR codes at the bottom linking to songs: 'Apache' by Incredible Bongo Band, 'I Just Want To Do My Thing' by Edwin Starr, and 'Give It Up or Turn It Loose' by James Brown. Questions are numbered with circular badges (99 and 100).",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 143,
    "fileName": "143.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A decorative title page for a section titled 'Hip-Hop Time Capsule' with the subtitle 'Document Your Personal Journey'. The page features the name 'ANITA SCIPIO' and 'THIS IS MY JOURNEY' in bold yellow text on a pink starburst shape against a purple background with splatter effects. Page number 143 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 144,
    "fileName": "144.png",
    "type": "content",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "name",
        "type": "text",
        "label": "MY NAME IS:",
        "position": "upper-middle"
      },
      {
        "id": "birthplace",
        "type": "text",
        "label": "I WAS BORN AND RAISED IN",
        "position": "middle"
      },
      {
        "id": "dob",
        "type": "text",
        "label": "MY D.O.B IS:",
        "position": "lower-middle"
      }
    ],
    "description": "Personal information page with hip-hop themed design featuring filled-in examples: name 'ANITA SCIPIO', birthplace 'HARLEM AND THE BRONX', date of birth 'Dec 14, 1956', and statement 'I LOVE HIP-HOP AND THIS IS MY JOURNEY.' Decorated with graffiti-style text, pink paint splatter, and microphone graphics.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 145,
    "fileName": "145.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 145 from a book about Hip-Hop history. Contains two Q&A sections: Question 1 asks 'When did you first discover Hip-Hop music?' with the answer '1977' in a numbered badge. Question 2 asks 'Do you remember where you were?' with a detailed answer about watching TV in a bedroom when a brother named Hilton started playing a record on new DJ equipment. Includes a QR code and reference to 'Rap and Hip Hop: Crash Course Black American History #47'.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 146,
    "fileName": "146.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Interview page with questions 3 and 4 about first experiences with Hip-Hop music. Question 3 asks about the first song that caught attention, with answer about 'Good Times' by Chic and learning about cutting and scratching. Question 4 asks about emotions felt hearing Hip-Hop for the first time, with a humorous answer about annoyance at brother's repetitive playing of the song. Page includes two QR codes linking to 'Good Times' by Chic and a breakbeat mix demonstrating DJing and scratching techniques.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 147,
    "fileName": "147.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Q&A page featuring questions 5 and 6 about hip-hop MCs and inspiration. Question 5 lists influential MCs including Coke La Rock, Disco King Mario, DJ Kool Herc, Grandmaster Flash, and others. Includes an image of a flyer for a 'Back to School Jam' at 1520 Sedgwick Ave and a QR code linking to Kool Herc's 'Merry-Go-Round' technique. Question 6 asks if hip-hop inspired the respondent to become a lyricist, rapper, dancer, or DJ, with the answer 'No, it did not.'",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 148,
    "fileName": "148.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page shows questions 7 and 8 from what appears to be a survey or questionnaire about Hip-Hop's influence. Question 7 asks if Hip-Hop played a role in friendships or social circles (answered 'No'). Question 8 asks about top songs that gave confidence to overcome personal challenges, with the answer listing 'Keep Ya Head Up' by Tupac, 'The Breaks' by Curtis Blow, 'The Choice Is Yours' by Black Sheep, and songs by Kid-n-Play. At the bottom are four QR codes linking to these songs.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 149,
    "fileName": "149.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains questions 9 and 10 from what appears to be a Hip-Hop questionnaire or interview. Question 9 asks about top five hottest jams or concerts, with an answer explaining the respondent stayed home with family or attended house parties. Question 10 asks about top DJs who made the biggest impact on Hip-Hop, with a detailed answer listing multiple influential DJs/MCs. The page includes a Hot 97 logo and a section titled 'The Rival Station That Shaped the Culture' with additional commentary about Hot 97's impact on hip-hop radio. Page number 149 is shown at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 150,
    "fileName": "150.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 150 contains three Q&A items about hip-hop culture. First is a tribute to Hot 97 radio station and personalities Ed Lover and Lisa G. Question 11 asks about favorite people to party with, answered with family including Mama Earlene Scipio. Question 12 asks about top three old-school dances (The Wop, The Bump, and The Hustle), with a QR code linking to 'The Woppit Dance by B-Fats' example video.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 151,
    "fileName": "151.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Q&A page featuring questions 13 and 14 about Hip-Hop clubs and party songs. Question 13 asks about top five Hip-Hop clubs with answer mentioning Boston Road Ballroom and The Stardust Ballroom in the Bronx. Question 14 asks about party songs that 'rocked the house' with a list of six classic hip-hop tracks including songs by Run-D.M.C., Boogie Down Production, B-Fats, Black Rob, and Rob Base. The page includes four QR codes at the bottom linking to 'South Bronx', 'The Woppit', 'Whoa', and 'Here We Go'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 152,
    "fileName": "152.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 152 containing questions 15 and 16 about hip-hop music. Question 15 asks about the first song the person could fully recite, with the answer being 'Rapper's Delight' by Sugar Hill Gang. Two QR codes are provided to access the song and lyrics. Question 16 asks about the top five 'illest' male artists from their era, with the answer listing Tupac, Snoop Dogg, Run-DMC, LL Cool J, and Eric B. & Rakim.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 153,
    "fileName": "153.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 153 contains two Q&A responses numbered 17 and 18. Question 17 asks about regrets for missing concerts/events, with an answer expressing no regrets due to 35+ years in radio providing opportunities. Question 18 asks about old-school quotes still used today, with the answer citing an Eric B. and Rakim lyric 'Thought I was a donut, ya tried to glaze me!' A QR code appears at the bottom labeled 'Eric B. Is President'.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 154,
    "fileName": "154.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Two Q&A questions (19 and 20) about favorite club songs and break dance tracks. Question 19 discusses favorite clubs (Stardust Ballroom and Boston Road Ball Room) and includes 5 QR codes linking to songs by LL Cool J, Eric B. & Rakim, Salt-N-Pepa, and MC Lyte. Question 20 identifies 'Bongo Rock' by The Incredible Bongo Band as the top favorite breakdance track for B-Boys, with a QR code link to the song.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 155,
    "fileName": "155.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 155 containing two Q&A entries: Question 21 asks about DJ equipment ownership (answered 'No'), and Question 22 asks about experiencing violence at clubs (answered with a story about a near-riot at a Hip-Hop concert in Brooklyn). Both responses are displayed in speech bubble-style text boxes with numbered circular icons (21 and 22).",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 156,
    "fileName": "156.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains questions 23 and 24 about being affected by the loss of artists. Question 23 asks if the reader has been affected by artist loss, with an answer stating 'Yes, I have been affected by the loss of several artists.' Question 24 asks how specifically they were affected, with a detailed response listing DJ Scott La Rock, Tupac, DMX, Nipsey Hussle, Young Dolph, King Von, Pop Smoke, and FBG Duck. The page includes a QR code at the bottom linking to information about 'DJ Scott La Rock'. The page is numbered 156.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 157,
    "fileName": "157.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A memoir page describing the author's encounter with Pop Smoke, where she accidentally smeared red lipstick on his expensive Louis Vuitton jacket during a hug. The page includes a tribute following his tragic death, and features two QR codes linking to music ('Welcome To the Party' and 'Dior') plus two social media photos showing Pop Smoke with the author and DJ Prostyle. The page is numbered 157 and includes the label 'Continued...' at the top.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 158,
    "fileName": "158.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A personal memoir page about meeting Young Dolph twice, including a story about praying for his recovery after he was shot in 2017, and expressing sadness about his later death. The page includes a photograph of Young Dolph with DJ Cool Kev, and two QR codes linking to songs 'Nothin'' and 'Real Life'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 159,
    "fileName": "159.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page honoring deceased hip-hop legends, featuring a personal reflection about DMX's passing and its emotional impact. The page includes four QR codes linking to related content (Lord Give Me A Sign, Praying for The Breakfast Club, Jay Z on DMX, and Juvenile and others on DMX). The page concludes with a memorial statement 'Long Live All of Our Hip-Hop Legends!' and lists RIP Craig Mack, Black Rob, DJ Kay Slay, Fatman Scoop, Rich Homie Quan and DJ Clark Kent, accompanied by a dove icon.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 160,
    "fileName": "160.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_25",
        "type": "text_area",
        "label": "25. Have you ever had the opportunity to do something kind or important for your favorite artist?",
        "position": "top",
        "hasResponse": true,
        "responseText": "Yes, DMX came to Power 105.1 for an interview with The Breakfast Club. Because DMX would occasionally have asthma attacks, and they wanted to be prepared just in case, I received a request to find an EpiPen for him and after making several phone calls, finally, my awesome co-worker, Jill Shelhorse, came through for me! She bought one upstairs and I was so grateful. I was beaming with pride and so honored that I got a chance to do something for the legendary DMX. Thank God, he didn't need it that day but regardless, we had his back!"
      },
      {
        "id": "question_26",
        "type": "text_area",
        "label": "26. If the lyrics in one of your favorite songs could come true for a day, which lyrics would you choose?",
        "position": "bottom",
        "hasResponse": true,
        "responseText": "I am sure there have been a few favorite lyrics I wish could come true for a day. Unfortunately, today, I can't think of any."
      }
    ],
    "description": "Two interview-style questions (25 and 26) with responses about doing something kind for a favorite artist (DMX story) and choosing song lyrics to come true.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 161,
    "fileName": "161.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_27",
        "type": "text_area",
        "label": "27. What Hip-Hop song do you hear and instantly remember exactly where you were and what you were doing?",
        "position": "top"
      },
      {
        "id": "question_28",
        "type": "text_area",
        "label": "28. Were there any Hip-Hop artists you had a crush on back in your day? If so, who? How about today?",
        "position": "bottom"
      }
    ],
    "description": "Page 161 contains two Hip-Hop related questions (27 and 28) with example answers from Anita. Question 27 includes a reference to 'Bailando' by Enrique Iglesias featuring Sean(a) Paul, Descemer Bueno, and Gente De Zona with a QR code. Question 28 references Big Daddy Kane and 'I Get The Job Done' with another QR code.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 162,
    "fileName": "162.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Q&A page featuring questions 29 and 30 about favorite New York mixtape DJs and favorite B-Boys. Question 29 lists numerous DJs including DJ Prostyle, DJ Clue, DJ Envy, and others. Question 30 discusses NYC Breakers, Rock Steady Crew, and names Mr. Wave, Action, Lil Lep, and Crazy Legs as favorites. Three QR codes at the bottom link to videos about NYC Breakers, Crazy Legs, and Beat Street movie footage.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 163,
    "fileName": "163.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_31",
        "type": "text_area",
        "label": "31. What record pool, if any, did you belong to?",
        "position": "top"
      },
      {
        "id": "question_32",
        "type": "text_area",
        "label": "32. When you were on your way to a club, looking clean (or as we used to say) looking fresh, what were your favorite colognes, perfumes, or body oils to wear?",
        "position": "bottom"
      }
    ],
    "description": "Page 163 containing two questions (31 and 32) about record pools and favorite fragrances worn to clubs. Question 31 shows an example answer 'No, I never belonged to a Record Pool.' Question 32 shows an example answer mentioning 80's perfumes including Sunflowers by Elizabeth Arden, Oscar de la Renta and Chanel No. 5.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 164,
    "fileName": "164.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains two Q&A questions (33 and 34) about Hip-Hop fashion and footwear preferences. Question 33 asks about favorite Hip-Hop drip/gear, with an answer explaining the person didn't have favorite Hip-Hop gear except turtle neck sweaters but appreciated it on others. Question 34 asks about sneaker and shoe preferences past and present, with an answer describing wearing marshmallow shoes for height in the past and now preferring comfortable flats. The page includes numbered circular icons (33 and 34) and shows '@ANITA' and page number 164 at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 165,
    "fileName": "165.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 165 contains two Q&A responses (questions 35 and 36). Question 35 asks about favorite party drinks then and now, with the answer listing Rum and Coke with lemon twist, Harvey's Bristol Creme, Lancers Ros, and Pia Coladas, noting the person no longer drinks. Question 36 asks about artists/groups that influenced views on social issues and activism, with the answer listing Tupac, DMX, KRS-One, Common, N.W.A, Grandmaster Flash and the Furious Five, and Lil Baby. Three QR codes are displayed at the bottom linking to songs: 'Changes' by Tupac, 'Dear Mama' by Tupac, and 'The Bigger Picture' by Lil Baby 2020.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 166,
    "fileName": "166.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 166 contains two Q&A questions (37 and 38) about hip-hop artists that have inspired the respondent. Question 37 discusses Tupac Shakur's inspiring life story, while Question 38 lists several hip-hop songs that contributed to personal growth, including works by Queen Latifah, Boogie Down Production, KRS-One, and Tupac. The page includes a QR code linking to 'Self Destruction by BDP' and the username '@ANITA' at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 167,
    "fileName": "167.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_39_response",
        "type": "text_area",
        "label": "When was the first time (if ever) you tried to write your own rap?",
        "position": "below_question"
      }
    ],
    "description": "Page 167 contains question 39 asking about the first time the reader tried to write their own rap. The page includes four QR codes at the top labeled 'U.N.I.T.Y', 'My Philosophy', 'Self Destruction', and 'I Ain't Mad At Ya'. Below the question is a filled response explaining that the author never tried to write rap due to family competition, followed by details about family members who were aspiring rappers in the 80s and 90s, including nephews, nieces, and great-nephews with their stage names.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 168,
    "fileName": "168.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Continuation page discussing young rappers who practiced in the Bronx, mentioning DJ Scipio's equipment and various artists including Eddie, LJ, and LaToya. The page profiles DJ Cool Kev and Dontay Bonaparte, and includes a shout-out to non-rapping family members. Two QR codes are present at the bottom - one for 'Drug Addict' by Monii Montii X Mac Da Boss, and one for Mac Da Boss Instagram.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 169,
    "fileName": "169.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page displaying 9 QR codes arranged in a 3x3 grid. Each QR code links to different Instagram accounts or music tracks. Top row features DJ Cool Key, Eddie Valentin, and LaToya Shanice Instagram links. Middle row has QR codes for songs 'Blood Brothers Stay Scheming', 'All I Got', and 'Same Shoes'. Bottom row includes 'Way That I Move', 'They Hate B4 They Love', and 'Lyric', all by Lucky Leon Luchi. Page is numbered 169 and marked as 'Continued...' at the top.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 170,
    "fileName": "170.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_40",
        "type": "text_area",
        "label": "Who or what inspired you to try, and how would you rate your skills?",
        "position": "top",
        "prefilledAnswer": "No one inspired me to write my own rap."
      },
      {
        "id": "question_41",
        "type": "text_area",
        "label": "Have you ever met or worked with any of your favorite artists or legends in Hip-Hop?",
        "position": "bottom",
        "prefilledAnswer": "I have been very fortunate to have met many of my favorite Hip-Hop legends. Working at iHeartMedia, the parent company of Power 105.1, was an absolute dream job. It doesn't get any better than working with The Breakfast Club and the best of the best DJs/On-Air Personalities in the game. However, I would like to single out ***Lisa Glasberg, aka Lisa G. She was my co-worker at iHeartMedia, and she is a good friend of mine. She is one of the kindest and most generous people I know. She is also a Hip-Hop legend. Here is a little research on Lisa G.\n\nShe was a prominent radio personality and co-host on Hot 97's morning show with Ed Lover and Dr. Dre in the 1990s. It was one of the first Hip-Hop Morning Shows on an all Hip-Hop format. She played an essential role in the early days of mainstream Hip-Hop radio, helping to bring rap music and culture to a wider audience. This show helped shape Hip-Hop radio, blending humor, music, and interviews with some of the biggest rap stars of the time. Many listeners assumed she was black because her voice and style fit seamlessly with the culture. She was well respected for her work and authenticity. Her time on Hot 97, solidified her place in Hip-Hop history. ***Love you Lisa G. Proud to know you! Anita"
      }
    ],
    "description": "Two questionnaire items (questions 40 and 41) about hip-hop inspiration and meeting legends, with filled-in responses. Question 41 features a detailed answer about Lisa Glasberg (Lisa G.) and her contributions to Hip-Hop radio history.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 171,
    "fileName": "171.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 171 contains two Q&A entries numbered 42 and 43. Question 42 asks about who was the better lyricist between Biggie and Tupac, with a response acknowledging Biggie as technically superior while expressing admiration for both. Question 43 asks about the East Coast vs. West Coast war, with a response discussing the beef between Tupac and Biggie, the role of media, and expressing regret over the loss of both artists.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 172,
    "fileName": "172.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_44",
        "type": "text_area",
        "label": "If you could have fifteen minutes with your favorite Hip-Hop legend or artist, who would it be and what would you say?",
        "position": "top"
      },
      {
        "id": "question_45",
        "type": "text_area",
        "label": "If you could spend the whole day with your favorite Hip-Hop legend or artist, who would it be and what plans would you make?",
        "position": "bottom"
      }
    ],
    "description": "Page 172 contains two numbered questions (44 and 45) about meeting Hip-Hop legends. Question 44 includes a personal response about DMX, describing meetings at iHeartMedia and his spiritual nature. Question 45 includes a response about wanting to spend time with Snoop Dogg to learn about Death Row Records history.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 173,
    "fileName": "173.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Question 46 asking about having a rap battle with favorite artists. The page includes a continued answer from a previous question describing a dream day with Snoop Dogg, including touring offices, meeting family, and listening to various songs. Four QR codes are displayed for different songs mentioned in the text.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 174,
    "fileName": "174.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_47",
        "type": "text_area",
        "label": "47. What clever lines would you use to diss them?",
        "position": "top"
      },
      {
        "id": "question_48",
        "type": "text_area",
        "label": "48. Can you recall a funny or embarrassing story from back in your day that you still laugh about?",
        "position": "bottom"
      }
    ],
    "description": "Page 174 containing two questions: Question 47 asks about clever disses with a humorous response about thinking. Question 48 asks about funny/embarrassing memories with a detailed story about sliding down uneven stairs in The Bronx in the 90s.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 175,
    "fileName": "175.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A humorous narrative page describing an incident where the narrator and her friend Sunni slide down stairs while holding Lancers Ros. The page includes three paragraphs detailing their mishap, the cab driver's reaction, and the brother Hilton witnessing the event. The page is numbered 175 and credited to @ANITA at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 176,
    "fileName": "176.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A personal tribute page featuring a 'Fun Facts' section about a lifelong friendship between the author and Sana Shabazz (formerly Sunni Burke Hayes) who grew up together in Harlem, NY. The page includes explanatory text about their current roles as religious leaders and displays three photographs - one of Sana as an adult wearing religious head covering, and two childhood photos of both friends. The page is numbered 176 and includes the header 'Continued...' and footer text '@ANITA'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 177,
    "fileName": "177.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 177 contains questions 49 and 50 from what appears to be a Hip-Hop interview or questionnaire. Question 49 asks about challenging an artist to a dance-off, with the answer naming Chris Brown and including three QR codes linking to videos about Kevin Hart teaching Chris Brown to dance and Chris Brown doing the Dougie. Question 50 asks about the nicest thing a Hip-Hop legend has done, with a brief answer mentioning there are too many to name and referencing 'Hip-Hop Time Capsule: The Next Chapter.'",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 178,
    "fileName": "178.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page dedicated to Common, the hip-hop artist. The page contains a personal story about Common bringing flowers on Secretary/Receptionist Day, praising his character, accomplishments (Oscar, Grammy), and recent performances. Includes two QR codes linking to songs 'When The Sun Shines Again' and 'Be', and ends with a congratulatory message to Common and Jennifer from Anita. Page number 178.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 179,
    "fileName": "179.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page about the author's encounters with celebrities Ne-Yo and Jay Z. The page includes personal anecdotes about Ne-Yo bringing roses on Valentine's Day and Jay Z greeting fans in the lobby. Features two images: a headshot of Jay Z on the left and a photo with Ne-Yo on the right, with text in the middle explaining why Jay Z's photo was included.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 180,
    "fileName": "180.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 180 featuring two sections about gifts from celebrities Snoop Dogg and Rick Ross. Includes a photo of a Broadus Family Collection candle, four images of liquor bottles and cases, and question 51 asking about best advice from a Hip-Hop legend. The answer states the best advice was 'Never change and always be the person that I am!'",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 181,
    "fileName": "181.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains two Q&A sections numbered 52 and 53. Question 52 asks about humorous stories involving favorite artists, with an answer about DMX coming for an interview on his birthday and later buying hotdogs. Question 53 asks about women's contributions to early Hip-Hop and begins to address their role in addressing feminism, gender equality, and social justice.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 182,
    "fileName": "182.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page continues a story about meeting Lil Debbie, one of the sisters who created the phrase 'Somebody Say Ho' for Grandmaster Flash and The Furious Five. It includes two photos - one of the author with Lil Debbie, and another showing where Grandmaster Flash used to live. The page also contains questions 54 and 55 about favorite women artists and 'baddest' women artists in Hip-Hop and R&B, with answers listing artists like Queen Latifah, Salt-N-Pepa, MC Lyte, and others. There's also a QR code linking to a video about the origin of 'Somebody Say Ho'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 183,
    "fileName": "183.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page showing the continuation of question 55 about favorite female Hip-Hop/R&B artists (listing Mary J. Blige, Beyonce, Lauryn Hill, and Faith Evans with QR codes to their songs), followed by question 56 asking about favorite male Hip-Hop/R&B artists with a detailed answer listing numerous artists like Will Smith, Snoop Dogg, Tupac, LL Cool J, and many others. The page includes multiple QR codes linking to songs by Will Smith, French Montana, Bell Biv Devoe, Naughty By Nature, and M.C. Hammer.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 184,
    "fileName": "184.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 184 contains question 57 asking about career choice in Rap or Hip-Hop. At the top are 5 QR codes labeled with song titles: 'Ice Ice Baby' by Vanilla Ice, 'Doo Wop' by DaBaby (Freestyle), 'Jump Around' by House of Pain, 'Look Back At It' by A Boogie Wit The Hoodie, and '3rd Bass-Brooklyn-Queens'. Below is an answer describing the author's career as a receptionist at iHeartMedia radio stations, meeting various music artists and legends.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 185,
    "fileName": "185.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains the continuation of a previous answer about meeting famous artists like Dolly Parton and working with Scott Shannon and Patti Steele. It then shows question 58 about challenges faced in a Hip-Hop career, with an answer describing the difficulty of staying calm when meeting Hip-Hop legends at iHeartMedia. Question 59 begins at the bottom, asking about family members or friends who provided encouragement during challenges.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 186,
    "fileName": "186.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 186 of a book describing a retirement party celebration. The author discusses support received from family, friends, and colleagues at iHeartMedia, naming various executives and friends who organized 'The Party of The Century' for their retirement. The page includes mentions of colleagues like Thea Mitchem, Tom Cuddy, Scott Hopeck, Jim Kerr, and Elvis Duran, along with others who helped plan the event. It ends with question 60 asking 'How did you overcome those challenges?'",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 187,
    "fileName": "187.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 187 contains question 61 'Who are your favorite Hip-Hop producers?' with a detailed answer about DJ Marley Marl. The page includes four QR codes linking to: 'Marley Marl Scratch' by Marley Marl feat. MC Shan, 'The Bridge', 'Mama Said Gonna Knock You Out', and '2023 I am Hip-Hop Award DJ Marley Marl'. A continuation of question 60 appears at the top discussing overcoming challenges while being starstruck.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 188,
    "fileName": "188.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Two Q&A questions about hip-hop's influence on diversity and inclusion (Q62) and songs/artists that helped shape identity (Q63). Q62 includes 5 QR codes linking to examples of hip-hop's global influence from different ethnicities (Indian, Palestinian, Japanese, Pakistani). Q63 includes 4 QR codes linking to songs that help with expressing anger: 'Ruff Ryders Anthem' by DMX, 'Party Up' by DMX, 'The Message' by Grandmaster Flash and The Furious Five, and 'Move B****' by Ludacris.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 189,
    "fileName": "189.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Interview questions 64 and 65 about Hip-Hop storytelling and community bonding. Question 64 discusses the integral role of storytelling in Hip-Hop and building connections with artists. Question 65 describes how Hip-Hop brought the Bronx community together through 'home-going' parties for deceased neighbors and neighborhood gatherings featuring breakdancing, rapping, and DJing.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 190,
    "fileName": "190.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains two questions (66 and 67) about Hip-Hop's impact on community involvement and favorite aspects of Hip-Hop generation. Question 66 has a circular icon with '66' and an answer about spiritual motivation. Question 67 includes a detailed tribute to Bobby Robinson, a Hip-Hop pioneer and record producer, with biographical information about his contributions to the music industry from the 1940s through 1980s.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 191,
    "fileName": "191.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Two Q&A pages (68-69) about Hip-Hop music. Question 68 asks about favorite Hip-Hop karaoke song with answer 'It Takes Two by Rob Base and DJ EZ Rock' and QR codes for lyrics and video. Question 69 asks if Hip-Hop led to exploring other genres, with a lengthy response about discovering Drill music, Chicago gang culture, and various artists like FBG Duck, King Von, J Mane, Tay Savage, and others. The response discusses socio-economic struggles and includes shout-outs to peace advocates and journalists.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 192,
    "fileName": "192.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 192 contains a photo of the author with Drea O at a Chalamagne event, an update about Lil Durk's arrest, a quote from Aniela Scorpio about Chicago, and question 70 asking about Dirty South artists who contributed to Hip-Hop music. The answer lists artists like T.I., Rick Ross, Lil Wayne, 2 Chainz, and others. Four QR codes at the bottom link to songs: 'B.M.F.' by Rick Ross ft. Styles P, 'I'm Different' by 2 Chainz, 'Swing Ya Rag' by T.I., and 'Get Low' by Lil Jon & The East Side Boyz.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 193,
    "fileName": "193.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains questions 68-69 about Hip-Hop music preferences. Question 68 asks about favorite Hip-Hop karaoke songs, with the answer 'It Takes Two by Rob Base and DJ EZ Rock' displayed in a circular badge numbered 68, along with a QR code for lyrics. Question 69 asks if Hip-Hop led to exploring other genres, with a lengthy response about exploring Drill music and Chicago gang culture, including shout-outs to various artists and personalities. There's an update note dated Thursday Oct. 24, 2024 about Lil Durk being arrested and charged in a murder for hire plot. Two QR codes are present on the page.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 194,
    "fileName": "194.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 194 contains questions 71 and 72 about West Coast hip-hop artists and hip-hop's positive impact on the world. Question 71 lists favorite West Coast artists including Tupac, Snoop Dogg, Ice Cube, Dr. Dre, and others, with four QR codes linking to songs. Question 72 asks about hip-hop promoting positive change, with an answer affirming it has changed the world through cultural expression, social commentary, community empowerment, fashion, and economic impact.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 195,
    "fileName": "195.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_73",
        "type": "text_response",
        "label": "73. As classic Hip-Hop has evolved, what artists or groups do you feel have positively impacted the music?",
        "position": "top"
      },
      {
        "id": "question_74",
        "type": "text_response",
        "label": "74. What artist or group, if any, do you believe is over-hyped or has negatively impacted the music? If so, who and how?",
        "position": "middle"
      }
    ],
    "description": "Page containing two questions about hip-hop music evolution. Question 73 asks about positive impacts with an example answer mentioning Common, Kendrick Lamar, J. Cole, Drake, and Big Sean with QR codes to their songs. Question 74 asks about negative impacts/over-hyped artists with an example answer discussing Drill Music and Chicago storytellers with QR codes to related songs.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 196,
    "fileName": "196.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Question 75 asks about Hip-Hop songs that match the reader's energy when frustrated or facing hardships, both in the past and today. Prince Dre's answer lists several songs including 'Everything Tonight' by Pitbull ft. Ne-Yo, 'How Ya Like Me Now' by Kool Moe Dee, 'They Don't Give A F*** About Us' by Tupac, and 'Now That We Found Love' by Heavy D & The Boyz ft. Aaron Hall. The page includes multiple QR codes linking to these songs, Instagram, the book, and other content. There's also a promotional message from Anita Scipio endorsing Prince Dre's book 'Surviving O Block: The Streets Don't Love You'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 197,
    "fileName": "197.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "answer_76",
        "type": "text_area",
        "label": "In your borough or state, which artists or DJs are you most proud of for their contribution to Rap or Hip-Hop?",
        "position": "top"
      }
    ],
    "description": "Question 76 asks about local artists/DJs the reader is proud of. An example answer discusses Ed Lover and lists many hip-hop artists from their state. The page includes Ed Lover's Wikipedia description and three QR codes linking to 'The Ed Lover Dance', an Ed Lover 'Breakfast Club' interview, and 'My Expert Opinion' with Ed Lover.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 198,
    "fileName": "198.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A testimonial page about Ed Lover, a radio personality and comedian. The page includes a personal account from Anita Scipio about working with Ed Lover at Power 105.1, their friendship, and reconnecting after fourteen years. The page contains two photographs showing Ed Lover with friends at different events. At the bottom, there's information about his current radio show 'The Ed Lover Experience' on 94.7 The Block (WXBK-FM) in New York.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 199,
    "fileName": "199.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 199 contains two quiz questions (77 and 78) about hip-hop culture. Question 77 asks about favorite beatbox artists with an answer listing Doug E. Fresh, Biz Markie, and The Fat Boys, including three QR codes linking to their work. Question 78 asks about the most sampled artist, with an answer identifying James Brown and explaining sampling history.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 200,
    "fileName": "200.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 200 contains questions 79 and 80 about rap music influences. Question 79 asks about rapper influences with the answer that no rapper influenced them. Question 80 asks about a Mt. Rushmore of Hip-Hop with the answer listing LL Cool J, DMX, Jay Z and Biggie. The page includes four QR codes linking to songs: 'Public Service Announcement' by Jay-Z, 'Hard Knock Life' by Jay Z, 'Big Poppa' by The Notorious B.I.G., and 'Juicy' by The Notorious B.I.G.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 201,
    "fileName": "201.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Two questions about creating Mt. Rushmore-style monuments for Hip-Hop. Question 81 asks who would be chosen for Mt. WESTmore, with answer listing Tupac, Snoop Dogg, Ice Cube, and Dr. Dre, accompanied by QR codes linking to four West Coast hip-hop songs. Question 82 asks about Mt. Ladies-Onlymore, with answer listing Queen Latifah, Salt-N-Pepa, and Missy Elliot, accompanied by three QR codes linking to songs by these female hip-hop artists.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 202,
    "fileName": "202.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Question 83 asking about local DJs who made the biggest impact on Hip-Hop in the author's generation. The response lists influential New York-based DJs and includes a personal story about DJ Kut, a former co-worker at Power 105.1 who was Ed Lover's DJ and performed at Caroline's Comedy Club. The page includes a circular badge with '83' and ends with a handwritten-style message 'Love ya Buddy! - Anita' and DJ Kut's quote 'Health is Wealth.'",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 203,
    "fileName": "203.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 203 contains two questions (84 and 85) with answers. Question 84 asks about favorite DJ songs with the answer 'I was never a DJ.' Question 85 asks about the first official Hip-Hop love song, with a detailed answer about LL Cool J's 'I Need Love' from 1987. The page includes a QR code linking to the song and features numbered circular badges (84 and 85) for each question.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 204,
    "fileName": "204.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 204 contains questions 86 and 87 about Hip-Hop love songs and favorite women artists in Hip-Hop. Question 86 has a brief dismissive answer. Question 87 provides a detailed response highlighting Sha-Rock, Roxanne Shante, and Angie Stone, with extensive information about Angie Stone's career with The Sequence and her passing in 2025. The page includes four QR codes at the bottom linking to songs by Cardi B, Young MA, and Glorilla, along with a tribute note thanking DJ SCIPIO.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 205,
    "fileName": "205.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Two Q&A pages (88 and 89) about Hip-Hop culture. Question 88 asks about current playlist preferences, with the answer listing several songs and including 5 QR codes for music tracks (Redman, Murder Gram Deux, Doo-Wop, Houdini, and I Am Blessed by Mr. Vega). An illustration shows a breakdancer with a boombox. Question 89 asks about favorite graffiti artists, with the answer mentioning 'Blade' as a favorite from the past, and includes an explanation of graffiti's role in Hip-Hop culture.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 206,
    "fileName": "206.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 206 contains two Q&A entries (questions 90 and 91) about the Drake and Kendrick Lamar beef. Question 90 asks what ignited the beef, with answer 90 stating uncertainty about the origins. Question 91 asks about impact on perception, with answer 91 discussing how 'Not Like Us' changed the respondent's perception of Drake while still enjoying his work. The page includes two QR codes at the bottom linking to Drake songs '0 to 100/The Catch Up' and 'Started From The Bottom'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 207,
    "fileName": "207.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page contains two Q&A entries (questions 92 and 93) discussing a rap battle between Drake and Kendrick Lamar. Question 92 asks about memorable lyrics from diss tracks, with an answer criticizing Drake's tracks compared to Kendrick's 'Not Like Us'. Question 93 asks who won and which song led to that conclusion, with the answer declaring Kendrick Lamar's 'Not Like Us' as the winner. Each answer includes a QR code linking to the respective songs mentioned.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 208,
    "fileName": "208.png",
    "type": "interactive",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "question_94_response",
        "type": "text_bubble",
        "label": "Response to question 94: Did the opinion of those in your inner-circle match yours, or were there drastic differences?",
        "position": "center-right",
        "content": "Yes, it did!"
      },
      {
        "id": "question_95_response",
        "type": "text_area",
        "label": "Response to question 95: Do rivalries benefit or negatively impact Hip-Hop and the overall culture?",
        "position": "center-left",
        "content": "In most cases, they're beneficial; however, with the Drake and Kendrick beef, I felt as though they each were trying to end the other's career, and I wasn't so sure about this one. The hatred displayed on both sides was palpable, and it was low-down and dirty, but I might add... very entertaining! Now, there is even a lawsuit that has come from this beef. I never thought that would happen in Hip-Hop but here we are... Yikes!"
      }
    ],
    "description": "Interactive page with two questions (94 and 95) about hip-hop culture, with response bubbles containing answers. Question 94 is about inner-circle opinions, and question 95 discusses rivalries in Hip-Hop, specifically mentioning the Drake and Kendrick beef.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 209,
    "fileName": "209.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Two Q&A entries (questions 96 and 97) discussing iconic hip-hop beefs and breaking news about admired artists. Question 96 lists famous rap rivalries like Kool Moe Dee vs Busy B, Jay-Z vs Nas, Drake vs Kendrick Lamar, etc. Question 97 discusses the author's changed perception of Diddy after controversial hotel video footage.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 210,
    "fileName": "210.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 210 contains questions 98 and 99 about Hip-Hop. Question 98 asks which artists represent the best of old-school and new-school Hip-Hop, with an answer listing artists like Snoop Dogg, LL Cool J, 50 Cent, and others. Five QR codes are displayed linking to songs: 'Paradise' by Fabolous, 'Forgive Me' by Maino, 'Paradise' by Fat Joe/Anitta/DJ Khaled, 'I Might Forgive...But I Don't Forgive' by Jeezy, and 'Hot in Herre' by Nelly. Question 99 asks about the reader's role as a Hip-Hop fan and how it contributes to the culture, with an answer about attending concerts, buying CDs, and showing love to artists.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 211,
    "fileName": "211.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Question 100 asks 'And finally, when did you realize that you ARE Hip-Hop?' The answer describes attending The Hip-Hop 50 Live at Yankee Stadium on August 11, 2023, where the author witnessed the unity, joy, and power of Hip-Hop culture through tens of thousands of diverse attendees celebrating together for nine hours.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 212,
    "fileName": "212.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A personal narrative about attending a hip-hop concert with family members across multiple generations. The author describes the shared joy of music, the emotional connection to hip-hop as a genre, and concludes with the realization 'I AM HIP-HOP!' The page is numbered 212 and credited to @ANITA.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 213,
    "fileName": "213.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: 400 {\"type\":\"error\",\"error\":{\"type\":\"invalid_request_error\",\"message\":\"messages.0.content.0.image.source.base64: image exceeds 5 MB maximum: 5423116 bytes > 5242880 bytes\"},\"request_id\":\"req_011CWEdfAo42zNGooRuanBRr\"}",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 214,
    "fileName": "214.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Photo collage page showing the Hip-Hop 50 Live Concert at Yankee Stadium with four images: two showing stage and crowd views from different angles, and two showing silhouettes of attendees (identified as Daughter Arlene and Niece Denise in one, and Cool Kev and Melvin in another). The page includes two QR codes and notes the most unique performance was by 'Doug E. Fresh'. Page number 214 appears at bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 215,
    "fileName": "215.png",
    "type": "title",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Chapter or section title page featuring 'HIP-HOP TIME CAPSULE' at the top with subtitle 'Document Your Personal Journey'. The main focus is on a pink torn-paper effect frame containing the text 'ANITA \"THANK-YOUS\"'. The page has a purple and blue grunge background with spray paint effects. Page number 215 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 216,
    "fileName": "216.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page dedicated to Misael A. Nunez, featuring a photo of two people in front of an iHeartMedia logo, followed by a heartfelt message from 'Mama' and DJ Scipio expressing gratitude for Misael's support, belief, and dedication to their project. The page is numbered 216.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 217,
    "fileName": "217.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Dedication page with two sections: 'My Dear Hubby' - a heartfelt thank you to Rodney for his love and support during the creation of this journal/book; and 'My Blessed Family' - expressing gratitude to family members including special mentions of sister Debbie, brother-in-law Isaac Daniels (Foxx), Ray, goddaughter Paula Hampton, and the Scipio family members in the States and England.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 218,
    "fileName": "218.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A dedication or acknowledgment page addressed to Thea Mitchem, iHeartMedia's E.V.P. of Programming for the Northeast Division and Program Director of Power 105.1 NYC. The page contains a heartfelt thank you message from Anita expressing gratitude for support, kindness, career opportunities, a retirement party, and assistance with a book. The page includes decorative elements at the top and is signed 'Love always, Anita' at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 219,
    "fileName": "219.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "An acknowledgments/dedication page titled 'SPECIAL THANKS TO:' featuring a heartfelt message thanking the author's nieces, nephew, best friend, brother, and son from Egypt. The page includes six photographs arranged in two rows showing the author with various family members and friends mentioned in the text. The word 'love' appears as decorative text in the middle of the page with arrow embellishments.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 220,
    "fileName": "220.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Acknowledgment page expressing gratitude to iHeartMedia executives and radio stations. Lists key personnel including Thea Mitchem (E.V.P. of Programming), Bernie Weiss (Division President), Steve Delusant (President of New York), and Tom Poleman (Chief Programming Officer). Lists several radio stations including Power 105.1 FM, Elvis Duran and The Morning Show, Q104 FM Classic Rock, WLTW Lite FM, WKTU-FM 103.5, 710 WOR, and Premiere Radio. Contains a personal message of thanks from Anita for memories and friendships.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 221,
    "fileName": "221.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page featuring two photographs and text about Angela Yee and Dan Greene. The page includes images of Miss Anita with both individuals, along with congratulatory messages expressing appreciation for their kindness and professional relationship. The page shows their connection to 'Way Up with Angela Yee' show and includes warm personal sentiments.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 222,
    "fileName": "222.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page titled 'My Recent Visit To: THE BREAKFAST CLUB' containing text about the author's visit to iHeartMedia's New York offices, followed by a section titled 'My Beloved Breakfast Club Family' with a group photograph of the Breakfast Club team in their studio.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 223,
    "fileName": "223.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page featuring three photographs from what appears to be a radio station visit. The top photo shows Charlamagne Tha God and DJ Envy with a guest labeled 'Queen Mama' in the center, all posed in front of a blue branded backdrop. Two additional photos below show closer shots of DJ Envy with Queen Mama, and Queen Mama sitting in an ornate gold and white throne-style chair. The page includes a note about the author's book 'In Hip-Hop Time Capsule: The Next Chapter' and mentions detailed stories about the Breakfast Club/Power 105.1 family. Page number 223 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 224,
    "fileName": "224.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This is an acknowledgment or dedication page addressed to DJ Envy and Charlamagne Tha God. The author expresses gratitude for their support and shares a personal story about receiving the advice 'Be Fearless' from DJ Envy, which impacted an artist named Mark Borino. The author also mentions how Charlamagne's book 'Get Honest Or Die Lying: Why Small Talk Sucks' influenced them to be bolder and more open. The page is signed 'Love, Mama' and is numbered 224, referencing 'Hip-Hop Time Capsule: The Next Chapter'.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 225,
    "fileName": "225.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A dedication/tribute page featuring messages to three people: Jess Hilarious, Loren LoRosa, and Morgan. The page includes a photo of two smiling women (one in yellow) and decorative balloon graphics at the top. Each section contains congratulatory messages and personal appreciations from what appears to be members of The Breakfast Club team.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 226,
    "fileName": "226.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A gratitude page featuring three photographs of the author with colleagues in the entertainment industry. The page shows Taylor Hayes ('Little One') from 'Ride or Die Daughter', DJ STACiE SPiNS, and Sym Symma. The title expresses thanks to 'Hip-Hop Children' and other Celebrity Co-Workers.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 227,
    "fileName": "227.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A photo collage page showing four photographs with captions. Top left shows two people dining with caption 'My \"Ride or Die son\" David'. Top right shows three people together captioned 'My dear sweet \"daughters\" Kaitlyn and Maria'. Bottom left shows two people with caption 'My Dear \"Son\" EmEz'. Bottom right shows two people at an event with caption 'My Dear \"Daughter\" Nyla Symone'. Page number 227 appears at bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 228,
    "fileName": "228.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A photo collage page showing four photographs of a woman in colorful attire with different people she refers to as her 'sons'. The top left shows her with Nick, top right with Brandon and Eddie F., bottom left with Radio Big Mac (labeled 'Heeey Bay-Bae!' #YERRRP!!!), and bottom right with DJ REDDE. All photos appear to be taken in similar studio or media settings. Page number 228 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 229,
    "fileName": "229.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A photo collage page showing four images of the author with different people who are dear to her. The photos show her with Ty Brazzell (labeled as 'son'), Maurice Mitchell aka Moe (labeled as 'son'), DJ Suss One (labeled as friend), and Sydney Brown (labeled as 'daughter'). Each photo has a caption identifying the person. This appears to be page 229 of the book.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 230,
    "fileName": "230.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A photo collage page showing four images with captions. The top two images show the author with two different people labeled as 'My Dear Son AJ' and 'My Dear Son Eddie F.' The bottom two images show the author at iHeartMedia, holding a book titled 'The Lost Letters', with captions 'Back Home At iHeartMedia' and 'I love iHeartMedia'. Page number 230 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 231,
    "fileName": "231.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page containing two heartfelt testimonials. The first is from 'Taylor, aka Little One' describing a loving relationship with devoted memories of finding each other before shifts and sharing hugs. The second is from 'DJ STACIE SPINS AKA Daughterspins' describing their oldest child as a wild, unpredictable person who enjoys intellectual conversations over Chipotle.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 232,
    "fileName": "232.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page containing three heartfelt testimonials from 'Mama' about her colleagues: Daughterspins (a DJ), Sym Symma (described as assertive, courageous, and spiritual), and David (who was recently promoted to oversee Promotions at iHeartMedia New York's WWPR/WAXQ/WOR). Each testimonial ends with expressions of love and includes purple-colored emphasized text.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 233,
    "fileName": "233.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page containing personal testimonials and tributes. At the top is a message from 'David My Son' expressing love and pride. Below is a photo of a smiling man in a red polo shirt and glasses, with a QR code to the left linking to InsiderRadio.com. The page includes two testimonials: one from 'Maria' about her daughter Maria being a wonderful young lady and their teamwork on prize contests, and another from 'Kaitlyn' about meeting her 'daughter' sweetheart at iHeart after the pandemic and their work together in the promotions and prize department, referring to themselves as 'the Three Musketeers.'",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 234,
    "fileName": "234.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 234 contains testimonials or messages about three people: Kaitlyn, EmEz, and Nyla Symone. Each entry appears to be written by 'Mama' describing their relationships and achievements. The text includes personal messages in purple text expressing love and encouragement. The content discusses their professional growth in what appears to be the entertainment industry, mentioning iHeart, concerts, shows, and events.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 235,
    "fileName": "235.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Acknowledgments page containing heartfelt thank-you messages to various people including Nyla (referred to as 'Mama'), Eddie F (Executive Producer), Marchelle, Miss Anita, Brandon, and Nick. The author expresses gratitude for their support, friendship, and memorable moments shared at a reception/front desk workplace.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 236,
    "fileName": "236.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 236 contains testimonials from mentors about their mentees. Features three stories: one about Nick who progressed from intern to department head, another about Radio Big Mac (Corey) who became successful and appears on Wild N' Out with Nick Cannon, and a third about Maurice Mitchell (Moe Mitchell) who dreamed of becoming a comedian. Each testimonial is signed by the mentor and expresses pride in the mentee's achievements.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 237,
    "fileName": "237.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A heartfelt page containing two personal messages. The first is from a mother ('Mama') expressing pride in her son who became a comedian and is now part of The Bert Show cast on Q99.7 in Atlanta. The second is from 'Ty' addressing 'Son', reflecting on memories at Reception, officiating his marriage to Amanda, and their 10-year journey with their son Rahmie. Both messages end with loving statements signed 'Mama'. The page number 237 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 238,
    "fileName": "238.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 238 contains three acknowledgment sections from Miss Anita expressing gratitude to DJ Redde (her 'son'), DJ Prostyle, and Angie Martinez ('The Voice of New York'). Each section describes personal memories and appreciation for their relationships and professional contributions.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 239,
    "fileName": "239.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 239 contains three tribute sections with personal messages about colleagues/friends: one about Angie (mentioning Niko and family), one about Honey German (described as strong and determined, with green hair), and one about DJ Clue (describing his role in Hip-Hop history and mentioning his daughter Bryana). Each section ends with a personal message in purple text signed by Anita.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 240,
    "fileName": "240.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Page 240 contains testimonials and messages from Anita about various DJs (DJ Scenario, DJ Whutever, DJ Norie, and DJ Will). Each entry describes personal memories and includes well-wishes signed 'Love, Anita' or 'Love, Mama'. The text includes purple-colored names and closing messages.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 241,
    "fileName": "241.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Acknowledgments page containing three personal messages from the author Anita to different people: DJ Will (thanking for support and food), Eli (referred to as 'son', thanking for love and support for her book), and DJ Suss One (thanking for friendship, humor, and helping with book promotion including appearance on Sherri Shepard show). Page number 241 appears at bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 242,
    "fileName": "242.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page containing farewell messages from coworkers (DJ Self, Sydney, AJ, and Art) expressing gratitude and love, followed by an acknowledgment section titled 'And last but not least...' that mentions Gabe P and his platform On The Radar Radio. The messages are written in a personal, affectionate tone with quotes highlighted in blue/purple text.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 243,
    "fileName": "243.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page containing a response to question 58 about challenges faced in choosing a career in Rap or Hip-Hop. The author, who signs as 'Anita aka Miss Anita aka Mama', discusses the enormous challenges in the Hip-Hop industry, including the importance of attitude, commitment, dedication, hard work, and networking. The page includes acknowledgments of Prince Dre from The O and other Hip-Hop voices, with a disclaimer about potentially forgetting to mention someone by name.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 244,
    "fileName": "244.png",
    "type": "content",
    "hasInputFields": true,
    "inputFields": [
      {
        "id": "shoutouts_area",
        "type": "text_area",
        "label": "ANITA AKA 'MAMA' SHOUT-OUTS",
        "position": "center"
      }
    ],
    "description": "A Hip-Hop Time Capsule page with vibrant purple and pink design featuring a section for documenting personal shout-outs to Anita aka 'Mama'. The page has a star-burst shaped pink text area in the center with torn paper effect borders.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 245,
    "fileName": "245.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Acknowledgments page featuring two shout-outs. The first thanks Banker.ock (@dhamarseno) for illustration work and includes a QR code. The second acknowledges Ash Cash Exantus, author of 'BOOK RICH: How to Create a Fortune as a Self-Published Author', describing how his interview on The Breakfast Club and subsequent work provided guidance during the book writing process. Includes a QR code linking to 'Earn Your Leisure'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 246,
    "fileName": "246.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A 'Shout-Out' page featuring tributes to two Hip-Hop pioneers: Ralph McDaniels, creator of Video Music Box, and Van Silk, the first Hip-Hop promoter. The page includes QR codes for VIDEOMUSICBOX and RAPMANIA_VANSILK, biographical information about their contributions to Hip-Hop culture, and acknowledgments of their support.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 247,
    "fileName": "247.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A 'Next Level Shout-Outs' acknowledgments page listing names of supporters, donors, or contributors. The page is decorated with two gold heart emojis at the top and features a centered title with decorative divider. Names are arranged in two columns, with some entries including 'Family' or multiple names, suggesting personal dedications or sponsor acknowledgments. Page number 247 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 248,
    "fileName": "248.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A 'Next Level Shout-Outs' acknowledgments page featuring two columns of names of people being thanked. The page is decorated with gold hearts at the top corners and a pink decorative divider. At the bottom is a special message in blue text: 'SHOUT-OUT TO MY POWER 105.1 MUSIC DAY FAMILY! I MISS YOU AND LOVE YOU ALWAYS! -ANITA'. The page contains approximately 60 names arranged in two columns.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 249,
    "fileName": "249.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A business shout-outs page featuring testimonials for local businesses including Doc's Cake Shop, Custom Candle Co., Lex Restaurant, and Coleman Chauffeur Service. Each testimonial is accompanied by QR codes and business logos. The page header indicates these are not sponsored endorsements, signed by Anita.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 250,
    "fileName": "250.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page titled 'Shout-Out to The 52nd Precinct!' featuring four photographs of police officers from the 52nd Precinct interacting with community members, particularly children, at what appears to be community events. The bottom of the page identifies the officers: Inspector Jeremy, Officer Gonzales, Myisha Hamilton (mother), Officer Easter, Officer DeLeon, Officer Gonzales, and Officer Boland. The page number 250 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 251,
    "fileName": "251.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page featuring three photographs of Officer Arias with a young girl named Amari Austin and other officers. The text describes Amari's admiration for police officers and expresses gratitude from her family (grandmother Debra Hamilton and mother Myisha Hamilton) for Officer Arias's kindness and positive role in the child's life.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 252,
    "fileName": "252.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: 400 {\"type\":\"error\",\"error\":{\"type\":\"invalid_request_error\",\"message\":\"messages.0.content.0.image.source.base64: image exceeds 5 MB maximum: 5349708 bytes > 5242880 bytes\"},\"request_id\":\"req_011CWEe4NYNigposzZGkWREC\"}",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 253,
    "fileName": "253.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page featuring a shout-out from Aunt Anita to her nephew Stevin Bush (aka Supreme). The page includes three photographs showing Aunt Anita and Supreme together, plus one solo photo of Supreme. The text expresses love and encouragement, ending with a reference to his song 'Spongy Rolla What's Up My Heart'. Page number 253/263 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 254,
    "fileName": "254.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A Hip-Hop Time Capsule page titled 'Document Your Personal Journey' featuring a quote 'IT'S ALL LOVE' attributed to ANITA. The page has a vibrant purple and pink color scheme with a torn paper effect frame in the center.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 255,
    "fileName": "255.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "This page promotes a YouTube channel called 'IT'S ALL LOVE' focused on documenting Hip-Hop history and artist interviews. It includes a mission statement about preserving authentic Hip-Hop origins and lists several media platforms/shows where content appears, including The Breakfast Club/Power 105.1 FM, HOT 97, On the Radar Radio, C'mon Son! The Podcast with Ed Lover, The Joe Budden Podcast, and Million Dollaz Worth of Game with Gillie and Wallo. The page emphasizes the importance of documenting true Hip-Hop history and preventing distortion of historical facts.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 256,
    "fileName": "256.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A list of hip-hop related media content including podcasts, radio shows, documentaries, and educational series. Contains titles such as 'Drink Champs', 'Halo and Me', 'Sway Universe', 'The Joe Budden Podcast', and various hip-hop history and culture programs. Page number 256 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 257,
    "fileName": "257.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Title page for a hip-hop time capsule activity featuring 'Anita - Sharin' the Love'. The page has a colorful design with yellow graffiti-style text at the top reading 'HIP-HOP TIME CAPSULE' and 'Document Your Personal Journey' in pink. The main content is displayed on a pink burst shape with torn paper effect against a purple and blue splattered background. Page number 257 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 258,
    "fileName": "258.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Biography page for DJ Cool Kev featuring a portrait photo and two paragraphs describing his career history, influences, education, collaborations, and extensive mixtape collection. The page includes a thank you message to supporters at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 259,
    "fileName": "259.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Contact and marketing page for DJ Cool Kev featuring email contact information (coolkev117@aol.com), the Total Package Collection brand logo showing various mascot characters, two promotional photos of a man with children wearing branded apparel, and four QR codes linking to Instagram, Website, a newly published article about Total Package Collection Brand, and the Total Package Brand main page.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 260,
    "fileName": "260.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Profile page for Mark Borino, a music producer and songwriter. Features a centered portrait photo with QR codes for Instagram and ffm.bio on either side. Below is biographical text describing his work on Drake's 'Certified Lover Boy' album, particularly the track 'Papi's Home' which peaked at #8 on Billboard's Hot 100. Text mentions his Harold Adamson Lyric Award from ASCAP, his independent releases under 'House of Rivero' label, and recent songs 'Don't Wait Up' and 'Visions'. The page includes a personal recommendation from Anita at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 261,
    "fileName": "261.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Profile page for Jamie Lynn featuring her photo, information about her 21-year career in NYC radio as an executive morning show producer, and her dog treat business 'Bark Avenue Treats'. Includes two QR codes for social media contact (@barkavenuetreats and Instagram) and a note from Anita encouraging readers to reach out to Jamie Lynn for her products.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 262,
    "fileName": "262.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A testimonial page about 'Donnell Land' featuring two photos of Donnell Rawlings with a woman (likely Anita), a description of the Memorial Day weekend experience at Donnell Land in Yellow Springs, Ohio, and two QR codes at the bottom - one for Donnell Land registration and one for Instagram (@donnellrawlings). The page includes a personal message signed by Anita.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 263,
    "fileName": "263.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A testimonial page honoring Adrian Silvestre, Director of Food and Beverage at City Experiences. The page features VIP laurel wreath logos at the top, a detailed acknowledgment of Adrian's career and contributions, mentions of cruises including the New York Bateaux, and includes QR codes and the City Experiences logo at the bottom. The page emphasizes Adrian's hospitality and the VIP experience he provides.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 264,
    "fileName": "264.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page featuring Shaw-nae's House, a soul-food catering business. The page includes the restaurant logo at the top, three photos showing the chef with food and various dishes, a narrative text about how Shaw-nae connected with The Breakfast Club through a personal call, and five QR codes at the bottom linking to media mentions including New York Times, Elvis Duran, NYC Tourism, Today Show, and NYT's 50 Best Restaurants in America.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 265,
    "fileName": "265.png",
    "type": "blank",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A blank page with only the page number 265 in the bottom right corner",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 266,
    "fileName": "266.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A decorative page featuring 'Hip-Hop Time Capsule' branding with DJ Scipio's 'Thank-You' track title. The page has a purple and pink color scheme with a starburst design in the center. It includes the tagline 'Document Your Personal Journey' and shows page number 266.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 267,
    "fileName": "267.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A dedication page featuring two entries: one for Shirley Williams with purple floral decoration and a heartfelt thank you message, and another for Greg Simpkins with a photograph of two men shaking hands and a message thanking him for 46 years of friendship and support. Page number 267 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 268,
    "fileName": "268.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A title page with 'Hip-Hop Time Capsule' at the top, subtitle 'Document Your Personal Journey', and centered text reading 'DJ SCIPIO \"SHOUT-OUTS\"' on a pink burst/splash design against a purple background with page number 268 at bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 269,
    "fileName": "269.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A 'DJ SHOUT-OUT' acknowledgments page thanking family members, especially sister Anita, and the Hip-Hop community including DJs, MCs, producers, and labels. The page features decorative elements including a purple brush stroke banner with 'SHOUT-OUT' text at the top, stylized 'DJ DUMP' text, and three music-related icons (record, DJ headphones, vinyl) at the bottom. Page number 269.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 270,
    "fileName": "270.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Acknowledgments page thanking fans and supporters. Features a 'Shout-out to the Carolinas' section with South Carolina and North Carolina state flags. Thanks The Breakfast Club/Power 105.1 radio station and names several individuals including Jess Hilarious, Loren LaRosa, and others. Includes 'Thank You' message from DJ SCIPIO and shout-out to Mikey Truth labeled as South Carolina's #1 Urban Blogger and Queen of Paperwork. Page includes decorative crown logo at bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 271,
    "fileName": "271.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Shout-out/acknowledgments page featuring a decorative header with 'DJ SCIPIO' and 'SHOUT-OUT' text, followed by dedications to family members and a lengthy list of friends, colleagues, and associates in the music industry",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 272,
    "fileName": "272.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A 'DJ NOTIQ SHOUT-OUT' acknowledgments page listing numerous DJs, radio personalities, artists, and industry professionals including DJ Cannon Banyon, Servin' Mike Ervin, DJ Dirty Baby, Derek White and Family, Crazy Obilla, and many others. The page features a purple brushstroke header design with white text.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 273,
    "fileName": "273.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A 'DJ SOHO SHOUT-OUT' page listing numerous hip-hop artists, DJs, producers, and music industry figures including Natalac, DJ Lord Jazz, Coke La Rock, Karate Pete Williams, and many others. The page appears to be acknowledgments or dedications from a book about hip-hop culture or history. Page number 273 appears at the bottom.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 274,
    "fileName": "274.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "An 'About the Author' page featuring a photo of DJ SCIPIO (Hilton V. Scipio) at his DJ equipment wearing a red vest and white shirt with headphones. The text provides biographical information about DJ SCIPIO, describing his upbringing in Harlem, N.Y., his musical influences including Marvin Gaye, The Stylistics, The Manhattans, and The Delfonics, his family's move to The Bronx in 1973, and his early experiences with Hip-Hop music including songs like 'Apache' by Incredible Bongo Band, 'Mardi Gra' by Bob James, and 'Catch A'.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 275,
    "fileName": "275.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Biography page about DJ SCIPIO describing his early influences in New York City, including DJs like Kool Herc, GrandMaster Flash, and Grand Wizard Theodore, as well as his friend DJ Jazzy G and brother DJ KFD. The text details his move to Orangeburg, South Carolina in 1989 where he became influential in bringing Dirty South music to the region, earning over twenty awards including five consecutive Mixtape DJ of the Year awards in South Carolina.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 276,
    "fileName": "276.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "An 'About the Author' page featuring a photograph and biography of Anita Scipio, former receptionist for iHeartMedia in New York. The page describes her nearly two-decade tenure at the company and her significance as 'Miss Anita' or 'Mama' to those who worked there. The text explains how she became an iconic figure and 'the face and soul of iHeartMedia,' witnessing the entertainment industry's evolution and meeting many celebrities.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 277,
    "fileName": "277.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A biographical tribute page about Anita Scipio describing her role at iHeartMedia's New York office, her nurturing of talent, her warm personality, and her impact as a mentor and community figure. The page highlights her legacy beyond administrative duties, including her work as an ordained minister and her charitable endeavors.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 278,
    "fileName": "278.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A page showcasing media interviews with two main sections. The top section features 'The Breakfast Club Interview' with a QR code and photo of four people in a radio studio. The bottom section shows an 'Angela Yee Interview' from the 'Way Up with Angela Yee' show with a QR code and photo of two people in a radio studio holding a book. The page header reads 'Hip-Hop Time Capsule and...' with The Breakfast Club logo.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 279,
    "fileName": "279.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A tribute page showing photos of a woman with various hip-hop artists and celebrities including Kool Moe Dee, LL Cool J, Ice-T, DMX, Snoop Dogg, Rick Ross, 2 Chainz, Fat Joe, and Treach. The page is titled 'Thank you all, for the love and great memories...' and displays 9 photographs arranged in a 3x3 grid, each labeled with the celebrity's name.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 280,
    "fileName": "280.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A collage page showing a woman posing with various hip-hop and R&B celebrities including Mary J Blige, Kid 'n Play, Ice Cube, Redman, Meek Mill, Moneybagg Yo, Rev Run, DMC, and A$AP Rocky. Each photo is labeled with the celebrity's name beneath it. The page number 280 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 281,
    "fileName": "281.png",
    "type": "content",
    "hasInputFields": false,
    "description": "Error: 400 {\"type\":\"error\",\"error\":{\"type\":\"invalid_request_error\",\"message\":\"messages.0.content.0.image.source.base64: image exceeds 5 MB maximum: 5273648 bytes > 5242880 bytes\"},\"request_id\":\"req_011CWEeLu4s2YUcmh51oo8L9\"}",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 282,
    "fileName": "282.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A photo collage page showing eight images of various celebrities and artists with a woman (presumably the author or a family member). Each photo is labeled with the name of the celebrity/artist: Chris Brown, Takashi 69, Casanova 2x, Waka Flocka, Machine Gun Kelly, D. Rawlings & Common, Young M.A (with a note about a t-shirt made by granddaughter Gayla), and Salt-N-Pepa. The page number 282 appears at the bottom.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 283,
    "fileName": "283.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A collage page showing Will Smith's viral moment visiting a receptionist named Anita Scipio at iHeartRadio for her retirement after 30 years. The page includes multiple screenshots from various media outlets (Instagram, Daily Mail, CNN, InspireMore, WLOS) covering the story from January 2020. The page is titled 'THEN LAST BUT NOT LEAST... WILL SMITH' with a subtitle 'AND MY (BARELY) 15 MINUTES OF FAME!' and includes a QR code. The layout shows various social media posts and news articles about the surprise visit.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 284,
    "fileName": "284.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A reflective page featuring two QR codes at the top (one labeled 'Will Smith' and one labeled 'Reflecting on My Viral Moment with Will Smith'), a central Instagram-style photo showing two people in conversation, and a handwritten-style text below signed by Anita. The text expresses gratitude for encounters with Hip-Hop celebrities and mentions creating a 'Hip-Hop Time Capsule: The Next Chapter' to share detailed stories about each pictured celebrity.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 285,
    "fileName": "285.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A scrapbook-style page documenting a retirement party, featuring multiple photos, QR codes, and text snippets. Includes images from Elvis Duran's radio show appearance, a birthday party invitation for 'Hala', a 'Mama's VIP' sign, party decorations, and celebration photos. Text elements highlight favorite songs ('Suge' by DaBaby, 'It Takes Two' by Rob Base, 'Lean On Me' by Bill Withers), shout-outs to DJs, and mentions of gifts including a trip to Paris, Nashville and $10,000. Multiple QR codes are placed throughout with labels like '*Ugly Cry Alert', '*Favorite Dance Song of The Night', '*Classic Song of the night', and '*Song I want to be remembered by'. The page appears to be page 285 of a memory book or retirement album.",
    "needsCustomLayout": true
  },
  {
    "pageNumber": 286,
    "fileName": "286.png",
    "type": "content",
    "hasInputFields": false,
    "inputFields": [],
    "description": "Final page titled 'Heartfelt Wishes' containing closing remarks and inspirational message from the authors. The page thanks readers for their participation, shares the authors' journey to publication including obstacles faced, mentions appearances on the Breakfast Club and Angela Yee's show, and concludes with advice to 'BE Fearless' as DJ Envy would say. Page number 286.",
    "needsCustomLayout": false
  },
  {
    "pageNumber": 287,
    "fileName": "287.png",
    "type": "interactive",
    "hasInputFields": false,
    "inputFields": [],
    "description": "A thank you page from authors Anita and Hilton requesting readers to leave reviews on Amazon. The page includes a photo of the couple, 'Love and Blessings' header text, and four QR codes linking to: Amazon Reviews, Anita's Instagram, Team Scipio Website, and DJ Scipio's Logo. Page number 287 appears at the bottom.",
    "needsCustomLayout": true
  }
]